una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s1.h
// - ----------------------------------------------------------------------------
// -          ATMEL Microcontroller Software Support  -  ROUSSET  -
// - ----------------------------------------------------------------------------
// -  DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR
// -  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
// -  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
// -  DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,
// -  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// -  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
// -  OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
// -  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
// -  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
// -  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// - ----------------------------------------------------------------------------
// - File Name           : AT91SAM3S1.h
// - Object              : AT91SAM3S1 definitions
// - Generated           : AT91 SW Application Group  09/30/2009 (16:15:55)
// - 
// - CVS Reference       : /AT91SAM3S1.pl/1.24/Wed Jul 29 14:55:43 2009//
// - CVS Reference       : /ACC_SAM3S4.pl/1.3/Wed Feb 25 13:14:09 2009//
// - CVS Reference       : /ADC_SAM3XE.pl/1.5/Tue Jan 27 10:29:26 2009//
// - CVS Reference       : /CORTEX_M3_MPU.pl/1.3/Mon Sep 15 12:43:55 2008//
// - CVS Reference       : /CORTEX_M3.pl/1.1/Mon Sep 15 15:22:06 2008//
// - CVS Reference       : /CORTEX_M3_NVIC.pl/1.8/Wed Sep 30 14:11:09 2009//
// - CVS Reference       : /DAC_SAM3S4.pl/1.2/Fri Mar 13 08:50:25 2009//
// - CVS Reference       : /DBGU_SAM3UE256.pl/1.3/Wed Sep 30 14:11:10 2009//
// - CVS Reference       : /EFC2_SAM3UE256.pl/1.3/Wed Sep 30 14:11:11 2009//
// - CVS Reference       : /HCBDMA_sam3S4.pl/1.1/Fri Mar 13 09:02:46 2009//
// - CVS Reference       : /HECC_6143A.pl/1.1/Wed Feb  9 17:16:57 2005//
// - CVS Reference       : /HMATRIX2_SAM3UE256.pl/1.5/Wed Sep 30 14:11:13 2009//
// - CVS Reference       : /SFR_SAM3S4.pl/1.3/Wed Jan 14 15:06:20 2009//
// - CVS Reference       : /MCI_6101F.pl/1.3/Wed Sep 30 14:11:15 2009//
// - CVS Reference       : /PDC_6074C.pl/1.2/Thu Feb  3 09:02:11 2005//
// - CVS Reference       : /PIO3_SAM3S4.pl/1.1/Tue Feb 17 08:07:35 2009//
// - CVS Reference       : /PITC_6079A.pl/1.2/Thu Nov  4 13:56:22 2004//
// - CVS Reference       : /PMC_SAM3S4.pl/1.8/Fri Mar 13 08:49:01 2009//
// - CVS Reference       : /PWM_SAM3S4.pl/1.1/Wed Feb 25 13:18:50 2009//
// - CVS Reference       : /RSTC_6098A.pl/1.4/Wed Sep 30 14:11:19 2009//
// - CVS Reference       : /RTC_1245D.pl/1.3/Fri Sep 17 14:01:31 2004//
// - CVS Reference       : /RTTC_6081A.pl/1.2/Thu Nov  4 13:57:22 2004//
// - CVS Reference       : /HSDRAMC1_6100A.pl/1.2/Mon Aug  9 10:52:25 2004//
// - CVS Reference       : /SHDWC_6122A.pl/1.3/Wed Oct  6 14:16:58 2004//
// - CVS Reference       : /HSMC3_SAM3S4.pl/1.1/Fri Mar 13 09:20:27 2009//
// - CVS Reference       : /SPI2.pl/1.6/Wed Sep 30 14:11:20 2009//
// - CVS Reference       : /SSC_SAM3S4.pl/1.1/Thu Apr  9 10:54:32 2009//
// - CVS Reference       : /SUPC_SAM3UE256.pl/1.2/Tue May 27 08:20:16 2008//
// - CVS Reference       : /SYS_SAM3S4.pl/1.4/Thu Mar  5 09:10:26 2009//
// - CVS Reference       : /TC_6082A.pl/1.8/Wed Sep 30 14:11:24 2009//
// - CVS Reference       : /TWI_6061B.pl/1.3/Wed Sep 30 14:11:24 2009//
// - CVS Reference       : /UDP_sam3S4.pl/1.1/Fri Mar 13 09:03:58 2009//
// - CVS Reference       : /US_6089J.pl/1.4/Wed Sep 30 14:11:25 2009//
// - CVS Reference       : /WDTC_6080A.pl/1.3/Thu Nov  4 13:58:52 2004//
// - ----------------------------------------------------------------------------

#ifndef AT91SAM3S1_H
#define AT91SAM3S1_H

#ifdef __IAR_SYSTEMS_ICC__

typedef volatile unsigned int AT91_REG;// Hardware register definition

// *****************************************************************************
//              SOFTWARE API DEFINITION  FOR System Peripherals
// *****************************************************************************
typedef struct _AT91S_SYS {
	AT91_REG	 HSMC3_SETUP0; 	//  Setup Register for CS 0
	AT91_REG	 HSMC3_PULSE0; 	//  Pulse Register for CS 0
	AT91_REG	 HSMC3_CYCLE0; 	//  Cycle Register for CS 0
	AT91_REG	 HSMC3_CTRL0; 	//  Control Register for CS 0
	AT91_REG	 HSMC3_SETUP1; 	//  Setup Register for CS 1
	AT91_REG	 HSMC3_PULSE1; 	//  Pulse Register for CS 1
	AT91_REG	 HSMC3_CYCLE1; 	//  Cycle Register for CS 1
	AT91_REG	 HSMC3_CTRL1; 	//  Control Register for CS 1
	AT91_REG	 HSMC3_SETUP2; 	//  Setup Register for CS 2
	AT91_REG	 HSMC3_PULSE2; 	//  Pulse Register for CS 2
	AT91_REG	 HSMC3_CYCLE2; 	//  Cycle Register for CS 2
	AT91_REG	 HSMC3_CTRL2; 	//  Control Register for CS 2
	AT91_REG	 HSMC3_SETUP3; 	//  Setup Register for CS 3
	AT91_REG	 HSMC3_PULSE3; 	//  Pulse Register for CS 3
	AT91_REG	 HSMC3_CYCLE3; 	//  Cycle Register for CS 3
	AT91_REG	 HSMC3_CTRL3; 	//  Control Register for CS 3
	AT91_REG	 HSMC3_SETUP4; 	//  Setup Register for CS 4
	AT91_REG	 HSMC3_PULSE4; 	//  Pulse Register for CS 4
	AT91_REG	 HSMC3_CYCLE4; 	//  Cycle Register for CS 4
	AT91_REG	 HSMC3_CTRL4; 	//  Control Register for CS 4
	AT91_REG	 HSMC3_SETUP5; 	//  Setup Register for CS 5
	AT91_REG	 HSMC3_PULSE5; 	//  Pulse Register for CS 5
	AT91_REG	 HSMC3_CYCLE5; 	//  Cycle Register for CS 5
	AT91_REG	 HSMC3_CTRL5; 	//  Control Register for CS 5
	AT91_REG	 HSMC3_SETUP6; 	//  Setup Register for CS 6
	AT91_REG	 HSMC3_PULSE6; 	//  Pulse Register for CS 6
	AT91_REG	 HSMC3_CYCLE6; 	//  Cycle Register for CS 6
	AT91_REG	 HSMC3_CTRL6; 	//  Control Register for CS 6
	AT91_REG	 HSMC3_SETUP7; 	//  Setup Register for CS 7
	AT91_REG	 HSMC3_PULSE7; 	//  Pulse Register for CS 7
	AT91_REG	 HSMC3_CYCLE7; 	//  Cycle Register for CS 7
	AT91_REG	 HSMC3_CTRL7; 	//  Control Register for CS 7
	AT91_REG	 Reserved0[16]; 	// 
	AT91_REG	 HSMC3_DELAY1; 	// SMC Delay Control Register
	AT91_REG	 HSMC3_DELAY2; 	// SMC Delay Control Register
	AT91_REG	 HSMC3_DELAY3; 	// SMC Delay Control Register
	AT91_REG	 HSMC3_DELAY4; 	// SMC Delay Control Register
	AT91_REG	 HSMC3_DELAY5; 	// SMC Delay Control Register
	AT91_REG	 HSMC3_DELAY6; 	// SMC Delay Control Register
	AT91_REG	 HSMC3_DELAY7; 	// SMC Delay Control Register
	AT91_REG	 HSMC3_DELAY8; 	// SMC Delay Control Register
	AT91_REG	 Reserved1[3]; 	// 
	AT91_REG	 HSMC3_ADDRSIZE; 	// HSMC3 ADDRSIZE REGISTER 
	AT91_REG	 HSMC3_IPNAME1; 	// HSMC3 IPNAME1 REGISTER 
	AT91_REG	 HSMC3_IPNAME2; 	// HSMC3 IPNAME2 REGISTER 
	AT91_REG	 HSMC3_FEATURES; 	// HSMC3 FEATURES REGISTER 
	AT91_REG	 HSMC3_VER; 	// HSMC3 VERSION REGISTER
	AT91_REG	 Reserved2[64]; 	// 
	AT91_REG	 HMATRIX_MCFG0; 	//  Master Configuration Register 0 : ARM I and D
	AT91_REG	 HMATRIX_MCFG1; 	//  Master Configuration Register 1 : ARM S
	AT91_REG	 HMATRIX_MCFG2; 	//  Master Configuration Register 2
	AT91_REG	 HMATRIX_MCFG3; 	//  Master Configuration Register 3
	AT91_REG	 HMATRIX_MCFG4; 	//  Master Configuration Register 4
	AT91_REG	 HMATRIX_MCFG5; 	//  Master Configuration Register 5
	AT91_REG	 HMATRIX_MCFG6; 	//  Master Configuration Register 6
	AT91_REG	 HMATRIX_MCFG7; 	//  Master Configuration Register 7
	AT91_REG	 Reserved3[8]; 	// 
	AT91_REG	 HMATRIX_SCFG0; 	//  Slave Configuration Register 0
	AT91_REG	 HMATRIX_SCFG1; 	//  Slave Configuration Register 1
	AT91_REG	 HMATRIX_SCFG2; 	//  Slave Configuration Register 2
	AT91_REG	 HMATRIX_SCFG3; 	//  Slave Configuration Register 3
	AT91_REG	 HMATRIX_SCFG4; 	//  Slave Configuration Register 4
	AT91_REG	 HMATRIX_SCFG5; 	//  Slave Configuration Register 5
	AT91_REG	 HMATRIX_SCFG6; 	//  Slave Configuration Register 6
	AT91_REG	 HMATRIX_SCFG7; 	//  Slave Configuration Register 5
	AT91_REG	 HMATRIX_SCFG8; 	//  Slave Configuration Register 8
	AT91_REG	 HMATRIX_SCFG9; 	//  Slave Configuration Register 9
	AT91_REG	 Reserved4[42]; 	// 
	AT91_REG	 HMATRIX_SFR0 ; 	//  Special Function Register 0
	AT91_REG	 HMATRIX_SFR1 ; 	//  Special Function Register 1
	AT91_REG	 HMATRIX_SFR2 ; 	//  Special Function Register 2
	AT91_REG	 HMATRIX_SFR3 ; 	//  Special Function Register 3
	AT91_REG	 HMATRIX_SFR4 ; 	//  Special Function Register 4
	AT91_REG	 HMATRIX_SFR5 ; 	//  Special Function Register 5
	AT91_REG	 HMATRIX_SFR6 ; 	//  Special Function Register 6
	AT91_REG	 HMATRIX_SFR7 ; 	//  Special Function Register 7
	AT91_REG	 HMATRIX_SFR8 ; 	//  Special Function Register 8
	AT91_REG	 HMATRIX_SFR9 ; 	//  Special Function Register 9
	AT91_REG	 HMATRIX_SFR10; 	//  Special Function Register 10
	AT91_REG	 HMATRIX_SFR11; 	//  Special Function Register 11
	AT91_REG	 HMATRIX_SFR12; 	//  Special Function Register 12
	AT91_REG	 HMATRIX_SFR13; 	//  Special Function Register 13
	AT91_REG	 HMATRIX_SFR14; 	//  Special Function Register 14
	AT91_REG	 HMATRIX_SFR15; 	//  Special Function Register 15
	AT91_REG	 Reserved5[39]; 	// 
	AT91_REG	 HMATRIX_ADDRSIZE; 	// HMATRIX2 ADDRSIZE REGISTER 
	AT91_REG	 HMATRIX_IPNAME1; 	// HMATRIX2 IPNAME1 REGISTER 
	AT91_REG	 HMATRIX_IPNAME2; 	// HMATRIX2 IPNAME2 REGISTER 
	AT91_REG	 HMATRIX_FEATURES; 	// HMATRIX2 FEATURES REGISTER 
	AT91_REG	 HMATRIX_VER; 	// HMATRIX2 VERSION REGISTER 
	AT91_REG	 PMC_SCER; 	// System Clock Enable Register
	AT91_REG	 PMC_SCDR; 	// System Clock Disable Register
	AT91_REG	 PMC_SCSR; 	// System Clock Status Register
	AT91_REG	 Reserved6[1]; 	// 
	AT91_REG	 PMC_PCER; 	// Peripheral Clock Enable Register 0:31 PERI_ID
	AT91_REG	 PMC_PCDR; 	// Peripheral Clock Disable Register 0:31 PERI_ID
	AT91_REG	 PMC_PCSR; 	// Peripheral Clock Status Register 0:31 PERI_ID
	AT91_REG	 PMC_UCKR; 	// UTMI Clock Configuration Register
	AT91_REG	 PMC_MOR; 	// Main Oscillator Register
	AT91_REG	 PMC_MCFR; 	// Main Clock  Frequency Register
	AT91_REG	 PMC_PLLAR; 	// PLL Register
	AT91_REG	 PMC_PLLBR; 	// PLL B Register
	AT91_REG	 PMC_MCKR; 	// Master Clock Register
	AT91_REG	 Reserved7[1]; 	// 
	AT91_REG	 PMC_UDPR; 	// USB DEV Clock Configuration Register
	AT91_REG	 Reserved8[1]; 	// 
	AT91_REG	 PMC_PCKR[8]; 	// Programmable Clock Register
	AT91_REG	 PMC_IER; 	// Interrupt Enable Register
	AT91_REG	 PMC_IDR; 	// Interrupt Disable Register
	AT91_REG	 PMC_SR; 	// Status Register
	AT91_REG	 PMC_IMR; 	// Interrupt Mask Register
	AT91_REG	 PMC_FSMR; 	// Fast Startup Mode Register
	AT91_REG	 PMC_FSPR; 	// Fast Startup Polarity Register
	AT91_REG	 PMC_FOCR; 	// Fault Output Clear Register
	AT91_REG	 Reserved9[28]; 	// 
	AT91_REG	 PMC_ADDRSIZE; 	// PMC ADDRSIZE REGISTER 
	AT91_REG	 PMC_IPNAME1; 	// PMC IPNAME1 REGISTER 
	AT91_REG	 PMC_IPNAME2; 	// PMC IPNAME2 REGISTER 
	AT91_REG	 PMC_FEATURES; 	// PMC FEATURES REGISTER 
	AT91_REG	 PMC_VER; 	// APMC VERSION REGISTER
	AT91_REG	 PMC_PCER1; 	// Peripheral Clock Enable Register 32:63 PERI_ID
	AT91_REG	 PMC_PCDR1; 	// Peripheral Clock Disable Register 32:63 PERI_ID
	AT91_REG	 PMC_PCSR1; 	// Peripheral Clock Status Register 32:63 PERI_ID
	AT91_REG	 PMC_PCR; 	// Peripheral Control Register
	AT91_REG	 Reserved10[60]; 	// 
	AT91_REG	 DBGU0_CR; 	// Control Register
	AT91_REG	 DBGU0_MR; 	// Mode Register
	AT91_REG	 DBGU0_IER; 	// Interrupt Enable Register
	AT91_REG	 DBGU0_IDR; 	// Interrupt Disable Register
	AT91_REG	 DBGU0_IMR; 	// Interrupt Mask Register
	AT91_REG	 DBGU0_CSR; 	// Channel Status Register
	AT91_REG	 DBGU0_RHR; 	// Receiver Holding Register
	AT91_REG	 DBGU0_THR; 	// Transmitter Holding Register
	AT91_REG	 DBGU0_BRGR; 	// Baud Rate Generator Register
	AT91_REG	 Reserved11[9]; 	// 
	AT91_REG	 DBGU0_FNTR; 	// Force NTRST Register
	AT91_REG	 Reserved12[40]; 	// 
	AT91_REG	 DBGU0_ADDRSIZE; 	// DBGU ADDRSIZE REGISTER 
	AT91_REG	 DBGU0_IPNAME1; 	// DBGU IPNAME1 REGISTER 
	AT91_REG	 DBGU0_IPNAME2; 	// DBGU IPNAME2 REGISTER 
	AT91_REG	 DBGU0_FEATURES; 	// DBGU FEATURES REGISTER 
	AT91_REG	 DBGU0_VER; 	// DBGU VERSION REGISTER 
	AT91_REG	 DBGU0_RPR; 	// Receive Pointer Register
	AT91_REG	 DBGU0_RCR; 	// Receive Counter Register
	AT91_REG	 DBGU0_TPR; 	// Transmit Pointer Register
	AT91_REG	 DBGU0_TCR; 	// Transmit Counter Register
	AT91_REG	 DBGU0_RNPR; 	// Receive Next Pointer Register
	AT91_REG	 DBGU0_RNCR; 	// Receive Next Counter Register
	AT91_REG	 DBGU0_TNPR; 	// Transmit Next Pointer Register
	AT91_REG	 DBGU0_TNCR; 	// Transmit Next Counter Register
	AT91_REG	 DBGU0_PTCR; 	// PDC Transfer Control Register
	AT91_REG	 DBGU0_PTSR; 	// PDC Transfer Status Register
	AT91_REG	 Reserved13[6]; 	// 
	AT91_REG	 DBGU0_CIDR; 	// Chip ID Register
	AT91_REG	 DBGU0_EXID; 	// Chip ID Extension Register
	AT91_REG	 Reserved14[46]; 	// 
	AT91_REG	 DBGU1_CR; 	// Control Register
	AT91_REG	 DBGU1_MR; 	// Mode Register
	AT91_REG	 DBGU1_IER; 	// Interrupt Enable Register
	AT91_REG	 DBGU1_IDR; 	// Interrupt Disable Register
	AT91_REG	 DBGU1_IMR; 	// Interrupt Mask Register
	AT91_REG	 DBGU1_CSR; 	// Channel Status Register
	AT91_REG	 DBGU1_RHR; 	// Receiver Holding Register
	AT91_REG	 DBGU1_THR; 	// Transmitter Holding Register
	AT91_REG	 DBGU1_BRGR; 	// Baud Rate Generator Register
	AT91_REG	 Reserved15[9]; 	// 
	AT91_REG	 DBGU1_FNTR; 	// Force NTRST Register
	AT91_REG	 Reserved16[40]; 	// 
	AT91_REG	 DBGU1_ADDRSIZE; 	// DBGU ADDRSIZE REGISTER 
	AT91_REG	 DBGU1_IPNAME1; 	// DBGU IPNAME1 REGISTER 
	AT91_REG	 DBGU1_IPNAME2; 	// DBGU IPNAME2 REGISTER 
	AT91_REG	 DBGU1_FEATURES; 	// DBGU FEATURES REGISTER 
	AT91_REG	 DBGU1_VER; 	// DBGU VERSION REGISTER 
	AT91_REG	 DBGU1_RPR; 	// Receive Pointer Register
	AT91_REG	 DBGU1_RCR; 	// Receive Counter Register
	AT91_REG	 DBGU1_TPR; 	// Transmit Pointer Register
	AT91_REG	 DBGU1_TCR; 	// Transmit Counter Register
	AT91_REG	 DBGU1_RNPR; 	// Receive Next Pointer Register
	AT91_REG	 DBGU1_RNCR; 	// Receive Next Counter Register
	AT91_REG	 DBGU1_TNPR; 	// Transmit Next Pointer Register
	AT91_REG	 DBGU1_TNCR; 	// Transmit Next Counter Register
	AT91_REG	 DBGU1_PTCR; 	// PDC Transfer Control Register
	AT91_REG	 DBGU1_PTSR; 	// PDC Transfer Status Register
	AT91_REG	 Reserved17[6]; 	// 
	AT91_REG	 DBGU1_CIDR; 	// Chip ID Register
	AT91_REG	 DBGU1_EXID; 	// Chip ID Extension Register
	AT91_REG	 Reserved18[46]; 	// 
	AT91_REG	 EFC0_FMR; 	// EFC Flash Mode Register
	AT91_REG	 EFC0_FCR; 	// EFC Flash Command Register
	AT91_REG	 EFC0_FSR; 	// EFC Flash Status Register
	AT91_REG	 EFC0_FRR; 	// EFC Flash Result Register
	AT91_REG	 Reserved19[1]; 	// 
	AT91_REG	 EFC0_FVR; 	// EFC Flash Version Register
	AT91_REG	 Reserved20[250]; 	// 
	AT91_REG	 PIOA_PER; 	// PIO Enable Register
	AT91_REG	 PIOA_PDR; 	// PIO Disable Register
	AT91_REG	 PIOA_PSR; 	// PIO Status Register
	AT91_REG	 Reserved21[1]; 	// 
	AT91_REG	 PIOA_OER; 	// Output Enable Register
	AT91_REG	 PIOA_ODR; 	// Output Disable Registerr
	AT91_REG	 PIOA_OSR; 	// Output Status Register
	AT91_REG	 Reserved22[1]; 	// 
	AT91_REG	 PIOA_IFER; 	// Input Filter Enable Register
	AT91_REG	 PIOA_IFDR; 	// Input Filter Disable Register
	AT91_REG	 PIOA_IFSR; 	// Input Filter Status Register
	AT91_REG	 Reserved23[1]; 	// 
	AT91_REG	 PIOA_SODR; 	// Set Output Data Register
	AT91_REG	 PIOA_CODR; 	// Clear Output Data Register
	AT91_REG	 PIOA_ODSR; 	// Output Data Status Register
	AT91_REG	 PIOA_PDSR; 	// Pin Data Status Register
	AT91_REG	 PIOA_IER; 	// Interrupt Enable Register
	AT91_REG	 PIOA_IDR; 	// Interrupt Disable Register
	AT91_REG	 PIOA_IMR; 	// Interrupt Mask Register
	AT91_REG	 PIOA_ISR; 	// Interrupt Status Register
	AT91_REG	 PIOA_MDER; 	// Multi-driver Enable Register
	AT91_REG	 PIOA_MDDR; 	// Multi-driver Disable Register
	AT91_REG	 PIOA_MDSR; 	// Multi-driver Status Register
	AT91_REG	 Reserved24[1]; 	// 
	AT91_REG	 PIOA_PPUDR; 	// Pull-up Disable Register
	AT91_REG	 PIOA_PPUER; 	// Pull-up Enable Register
	AT91_REG	 PIOA_PPUSR; 	// Pull-up Status Register
	AT91_REG	 Reserved25[1]; 	// 
	AT91_REG	 PIOA_SP1; 	// Select B Register
	AT91_REG	 PIOA_SP2; 	// Select B Register
	AT91_REG	 PIOA_ABSR; 	// AB Select Status Register
	AT91_REG	 Reserved26[5]; 	// 
	AT91_REG	 PIOA_PPDDR; 	// Pull-down Disable Register
	AT91_REG	 PIOA_PPDER; 	// Pull-down Enable Register
	AT91_REG	 PIOA_PPDSR; 	// Pull-down Status Register
	AT91_REG	 Reserved27[1]; 	// 
	AT91_REG	 PIOA_OWER; 	// Output Write Enable Register
	AT91_REG	 PIOA_OWDR; 	// Output Write Disable Register
	AT91_REG	 PIOA_OWSR; 	// Output Write Status Register
	AT91_REG	 Reserved28[16]; 	// 
	AT91_REG	 PIOA_ADDRSIZE; 	// PIO ADDRSIZE REGISTER 
	AT91_REG	 PIOA_IPNAME1; 	// PIO IPNAME1 REGISTER 
	AT91_REG	 PIOA_IPNAME2; 	// PIO IPNAME2 REGISTER 
	AT91_REG	 PIOA_FEATURES; 	// PIO FEATURES REGISTER 
	AT91_REG	 PIOA_VER; 	// PIO VERSION REGISTER 
	AT91_REG	 PIOA_SLEW1; 	// PIO SLEWRATE1 REGISTER 
	AT91_REG	 PIOA_SLEW2; 	// PIO SLEWRATE2 REGISTER 
	AT91_REG	 Reserved29[18]; 	// 
	AT91_REG	 PIOA_SENMR; 	// Sensor Mode Register
	AT91_REG	 PIOA_SENIER; 	// Sensor Interrupt Enable Register
	AT91_REG	 PIOA_SENIDR; 	// Sensor Interrupt Disable Register
	AT91_REG	 PIOA_SENIMR; 	// Sensor Interrupt Mask Register
	AT91_REG	 PIOA_SENISR; 	// Sensor Interrupt Status Register
	AT91_REG	 PIOA_SENDATA; 	// Sensor Data Register
	AT91_REG	 PIOA_RPR; 	// Receive Pointer Register
	AT91_REG	 PIOA_RCR; 	// Receive Counter Register
	AT91_REG	 PIOA_TPR; 	// Transmit Pointer Register
	AT91_REG	 PIOA_TCR; 	// Transmit Counter Register
	AT91_REG	 PIOA_RNPR; 	// Receive Next Pointer Register
	AT91_REG	 PIOA_RNCR; 	// Receive Next Counter Register
	AT91_REG	 PIOA_TNPR; 	// Transmit Next Pointer Register
	AT91_REG	 PIOA_TNCR; 	// Transmit Next Counter Register
	AT91_REG	 PIOA_PTCR; 	// PDC Transfer Control Register
	AT91_REG	 PIOA_PTSR; 	// PDC Transfer Status Register
	AT91_REG	 Reserved30[28]; 	// 
	AT91_REG	 PIOB_PER; 	// PIO Enable Register
	AT91_REG	 PIOB_PDR; 	// PIO Disable Register
	AT91_REG	 PIOB_PSR; 	// PIO Status Register
	AT91_REG	 Reserved31[1]; 	// 
	AT91_REG	 PIOB_OER; 	// Output Enable Register
	AT91_REG	 PIOB_ODR; 	// Output Disable Registerr
	AT91_REG	 PIOB_OSR; 	// Output Status Register
	AT91_REG	 Reserved32[1]; 	// 
	AT91_REG	 PIOB_IFER; 	// Input Filter Enable Register
	AT91_REG	 PIOB_IFDR; 	// Input Filter Disable Register
	AT91_REG	 PIOB_IFSR; 	// Input Filter Status Register
	AT91_REG	 Reserved33[1]; 	// 
	AT91_REG	 PIOB_SODR; 	// Set Output Data Register
	AT91_REG	 PIOB_CODR; 	// Clear Output Data Register
	AT91_REG	 PIOB_ODSR; 	// Output Data Status Register
	AT91_REG	 PIOB_PDSR; 	// Pin Data Status Register
	AT91_REG	 PIOB_IER; 	// Interrupt Enable Register
	AT91_REG	 PIOB_IDR; 	// Interrupt Disable Register
	AT91_REG	 PIOB_IMR; 	// Interrupt Mask Register
	AT91_REG	 PIOB_ISR; 	// Interrupt Status Register
	AT91_REG	 PIOB_MDER; 	// Multi-driver Enable Register
	AT91_REG	 PIOB_MDDR; 	// Multi-driver Disable Register
	AT91_REG	 PIOB_MDSR; 	// Multi-driver Status Register
	AT91_REG	 Reserved34[1]; 	// 
	AT91_REG	 PIOB_PPUDR; 	// Pull-up Disable Register
	AT91_REG	 PIOB_PPUER; 	// Pull-up Enable Register
	AT91_REG	 PIOB_PPUSR; 	// Pull-up Status Register
	AT91_REG	 Reserved35[1]; 	// 
	AT91_REG	 PIOB_SP1; 	// Select B Register
	AT91_REG	 PIOB_SP2; 	// Select B Register
	AT91_REG	 PIOB_ABSR; 	// AB Select Status Register
	AT91_REG	 Reserved36[5]; 	// 
	AT91_REG	 PIOB_PPDDR; 	// Pull-down Disable Register
	AT91_REG	 PIOB_PPDER; 	// Pull-down Enable Register
	AT91_REG	 PIOB_PPDSR; 	// Pull-down Status Register
	AT91_REG	 Reserved37[1]; 	// 
	AT91_REG	 PIOB_OWER; 	// Output Write Enable Register
	AT91_REG	 PIOB_OWDR; 	// Output Write Disable Register
	AT91_REG	 PIOB_OWSR; 	// Output Write Status Register
	AT91_REG	 Reserved38[16]; 	// 
	AT91_REG	 PIOB_ADDRSIZE; 	// PIO ADDRSIZE REGISTER 
	AT91_REG	 PIOB_IPNAME1; 	// PIO IPNAME1 REGISTER 
	AT91_REG	 PIOB_IPNAME2; 	// PIO IPNAME2 REGISTER 
	AT91_REG	 PIOB_FEATURES; 	// PIO FEATURES REGISTER 
	AT91_REG	 PIOB_VER; 	// PIO VERSION REGISTER 
	AT91_REG	 PIOB_SLEW1; 	// PIO SLEWRATE1 REGISTER 
	AT91_REG	 PIOB_SLEW2; 	// PIO SLEWRATE2 REGISTER 
	AT91_REG	 Reserved39[18]; 	// 
	AT91_REG	 PIOB_SENMR; 	// Sensor Mode Register
	AT91_REG	 PIOB_SENIER; 	// Sensor Interrupt Enable Register
	AT91_REG	 PIOB_SENIDR; 	// Sensor Interrupt Disable Register
	AT91_REG	 PIOB_SENIMR; 	// Sensor Interrupt Mask Register
	AT91_REG	 PIOB_SENISR; 	// Sensor Interrupt Status Register
	AT91_REG	 PIOB_SENDATA; 	// Sensor Data Register
	AT91_REG	 PIOB_RPR; 	// Receive Pointer Register
	AT91_REG	 PIOB_RCR; 	// Receive Counter Register
	AT91_REG	 PIOB_TPR; 	// Transmit Pointer Register
	AT91_REG	 PIOB_TCR; 	// Transmit Counter Register
	AT91_REG	 PIOB_RNPR; 	// Receive Next Pointer Register
	AT91_REG	 PIOB_RNCR; 	// Receive Next Counter Register
	AT91_REG	 PIOB_TNPR; 	// Transmit Next Pointer Register
	AT91_REG	 PIOB_TNCR; 	// Transmit Next Counter Register
	AT91_REG	 PIOB_PTCR; 	// PDC Transfer Control Register
	AT91_REG	 PIOB_PTSR; 	// PDC Transfer Status Register
	AT91_REG	 Reserved40[28]; 	// 
	AT91_REG	 PIOC_PER; 	// PIO Enable Register
	AT91_REG	 PIOC_PDR; 	// PIO Disable Register
	AT91_REG	 PIOC_PSR; 	// PIO Status Register
	AT91_REG	 Reserved41[1]; 	// 
	AT91_REG	 PIOC_OER; 	// Output Enable Register
	AT91_REG	 PIOC_ODR; 	// Output Disable Registerr
	AT91_REG	 PIOC_OSR; 	// Output Status Register
	AT91_REG	 Reserved42[1]; 	// 
	AT91_REG	 PIOC_IFER; 	// Input Filter Enable Register
	AT91_REG	 PIOC_IFDR; 	// Input Filter Disable Register
	AT91_REG	 PIOC_IFSR; 	// Input Filter Status Register
	AT91_REG	 Reserved43[1]; 	// 
	AT91_REG	 PIOC_SODR; 	// Set Output Data Register
	AT91_REG	 PIOC_CODR; 	// Clear Output Data Register
	AT91_REG	 PIOC_ODSR; 	// Output Data Status Register
	AT91_REG	 PIOC_PDSR; 	// Pin Data Status Register
	AT91_REG	 PIOC_IER; 	// Interrupt Enable Register
	AT91_REG	 PIOC_IDR; 	// Interrupt Disable Register
	AT91_REG	 PIOC_IMR; 	// Interrupt Mask Register
	AT91_REG	 PIOC_ISR; 	// Interrupt Status Register
	AT91_REG	 PIOC_MDER; 	// Multi-driver Enable Register
	AT91_REG	 PIOC_MDDR; 	// Multi-driver Disable Register
	AT91_REG	 PIOC_MDSR; 	// Multi-driver Status Register
	AT91_REG	 Reserved44[1]; 	// 
	AT91_REG	 PIOC_PPUDR; 	// Pull-up Disable Register
	AT91_REG	 PIOC_PPUER; 	// Pull-up Enable Register
	AT91_REG	 PIOC_PPUSR; 	// Pull-up Status Register
	AT91_REG	 Reserved45[1]; 	// 
	AT91_REG	 PIOC_SP1; 	// Select B Register
	AT91_REG	 PIOC_SP2; 	// Select B Register
	AT91_REG	 PIOC_ABSR; 	// AB Select Status Register
	AT91_REG	 Reserved46[5]; 	// 
	AT91_REG	 PIOC_PPDDR; 	// Pull-down Disable Register
	AT91_REG	 PIOC_PPDER; 	// Pull-down Enable Register
	AT91_REG	 PIOC_PPDSR; 	// Pull-down Status Register
	AT91_REG	 Reserved47[1]; 	// 
	AT91_REG	 PIOC_OWER; 	// Output Write Enable Register
	AT91_REG	 PIOC_OWDR; 	// Output Write Disable Register
	AT91_REG	 PIOC_OWSR; 	// Output Write Status Register
	AT91_REG	 Reserved48[16]; 	// 
	AT91_REG	 PIOC_ADDRSIZE; 	// PIO ADDRSIZE REGISTER 
	AT91_REG	 PIOC_IPNAME1; 	// PIO IPNAME1 REGISTER 
	AT91_REG	 PIOC_IPNAME2; 	// PIO IPNAME2 REGISTER 
	AT91_REG	 PIOC_FEATURES; 	// PIO FEATURES REGISTER 
	AT91_REG	 PIOC_VER; 	// PIO VERSION REGISTER 
	AT91_REG	 PIOC_SLEW1; 	// PIO SLEWRATE1 REGISTER 
	AT91_REG	 PIOC_SLEW2; 	// PIO SLEWRATE2 REGISTER 
	AT91_REG	 Reserved49[18]; 	// 
	AT91_REG	 PIOC_SENMR; 	// Sensor Mode Register
	AT91_REG	 PIOC_SENIER; 	// Sensor Interrupt Enable Register
	AT91_REG	 PIOC_SENIDR; 	// Sensor Interrupt Disable Register
	AT91_REG	 PIOC_SENIMR; 	// Sensor Interrupt Mask Register
	AT91_REG	 PIOC_SENISR; 	// Sensor Interrupt Status Register
	AT91_REG	 PIOC_SENDATA; 	// Sensor Data Register
	AT91_REG	 PIOC_RPR; 	// Receive Pointer Register
