una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s1.h
#define AT91C_HCBDMA_CBCRCIMR ((AT91_REG *) 	0x40044048) // (HCBDMA) CB DMA CRC Interrupt Mask Resgister
#define AT91C_HCBDMA_VER ((AT91_REG *) 	0x400440FC) // (HCBDMA) HCBDMA VERSION REGISTER
#define AT91C_HCBDMA_CBCRCIER ((AT91_REG *) 	0x40044040) // (HCBDMA) CB DMA CRC Interrupt Enable Resgister
#define AT91C_HCBDMA_IPNAME2 ((AT91_REG *) 	0x400440F4) // (HCBDMA) HCBDMA IPNAME2 REGISTER 
#define AT91C_HCBDMA_CBIER ((AT91_REG *) 	0x40044014) // (HCBDMA) CB DMA Interrupt Enable Register
#define AT91C_HCBDMA_CBISR ((AT91_REG *) 	0x40044020) // (HCBDMA) CB DMA Interrupt Status Register
#define AT91C_HCBDMA_IPNAME1 ((AT91_REG *) 	0x400440F0) // (HCBDMA) HCBDMA IPNAME1 REGISTER 
#define AT91C_HCBDMA_CBDIS ((AT91_REG *) 	0x4004400C) // (HCBDMA) CB DMA Disable Register
#define AT91C_HCBDMA_CBNXTEN ((AT91_REG *) 	0x40044004) // (HCBDMA) CB DMA Next Descriptor Enable Register
#define AT91C_HCBDMA_CBDLIMR ((AT91_REG *) 	0x4004402C) // (HCBDMA) CB DMA Loaded Interrupt mask Register
#define AT91C_HCBDMA_CBCRCMR ((AT91_REG *) 	0x40044038) // (HCBDMA) CB DMA CRC Mode Resgister
// ========== Register definition for TC0 peripheral ========== 
#define AT91C_TC0_SR    ((AT91_REG *) 	0x40010020) // (TC0) Status Register
#define AT91C_TC0_CCR   ((AT91_REG *) 	0x40010000) // (TC0) Channel Control Register
#define AT91C_TC0_CMR   ((AT91_REG *) 	0x40010004) // (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
#define AT91C_TC0_IER   ((AT91_REG *) 	0x40010024) // (TC0) Interrupt Enable Register
#define AT91C_TC0_CV    ((AT91_REG *) 	0x40010010) // (TC0) Counter Value
#define AT91C_TC0_RB    ((AT91_REG *) 	0x40010018) // (TC0) Register B
#define AT91C_TC0_IDR   ((AT91_REG *) 	0x40010028) // (TC0) Interrupt Disable Register
#define AT91C_TC0_RA    ((AT91_REG *) 	0x40010014) // (TC0) Register A
#define AT91C_TC0_RC    ((AT91_REG *) 	0x4001001C) // (TC0) Register C
#define AT91C_TC0_IMR   ((AT91_REG *) 	0x4001002C) // (TC0) Interrupt Mask Register
// ========== Register definition for TC1 peripheral ========== 
#define AT91C_TC1_SR    ((AT91_REG *) 	0x40010060) // (TC1) Status Register
#define AT91C_TC1_CV    ((AT91_REG *) 	0x40010050) // (TC1) Counter Value
#define AT91C_TC1_RA    ((AT91_REG *) 	0x40010054) // (TC1) Register A
#define AT91C_TC1_IER   ((AT91_REG *) 	0x40010064) // (TC1) Interrupt Enable Register
#define AT91C_TC1_RB    ((AT91_REG *) 	0x40010058) // (TC1) Register B
#define AT91C_TC1_RC    ((AT91_REG *) 	0x4001005C) // (TC1) Register C
#define AT91C_TC1_CCR   ((AT91_REG *) 	0x40010040) // (TC1) Channel Control Register
#define AT91C_TC1_IMR   ((AT91_REG *) 	0x4001006C) // (TC1) Interrupt Mask Register
#define AT91C_TC1_IDR   ((AT91_REG *) 	0x40010068) // (TC1) Interrupt Disable Register
#define AT91C_TC1_CMR   ((AT91_REG *) 	0x40010044) // (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
// ========== Register definition for TC2 peripheral ========== 
#define AT91C_TC2_SR    ((AT91_REG *) 	0x400100A0) // (TC2) Status Register
#define AT91C_TC2_IER   ((AT91_REG *) 	0x400100A4) // (TC2) Interrupt Enable Register
#define AT91C_TC2_CCR   ((AT91_REG *) 	0x40010080) // (TC2) Channel Control Register
#define AT91C_TC2_IDR   ((AT91_REG *) 	0x400100A8) // (TC2) Interrupt Disable Register
#define AT91C_TC2_RA    ((AT91_REG *) 	0x40010094) // (TC2) Register A
#define AT91C_TC2_RB    ((AT91_REG *) 	0x40010098) // (TC2) Register B
#define AT91C_TC2_IMR   ((AT91_REG *) 	0x400100AC) // (TC2) Interrupt Mask Register
#define AT91C_TC2_CV    ((AT91_REG *) 	0x40010090) // (TC2) Counter Value
#define AT91C_TC2_RC    ((AT91_REG *) 	0x4001009C) // (TC2) Register C
#define AT91C_TC2_CMR   ((AT91_REG *) 	0x40010084) // (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
// ========== Register definition for TC3 peripheral ========== 
#define AT91C_TC3_IDR   ((AT91_REG *) 	0x40014028) // (TC3) Interrupt Disable Register
#define AT91C_TC3_IER   ((AT91_REG *) 	0x40014024) // (TC3) Interrupt Enable Register
#define AT91C_TC3_SR    ((AT91_REG *) 	0x40014020) // (TC3) Status Register
#define AT91C_TC3_CV    ((AT91_REG *) 	0x40014010) // (TC3) Counter Value
#define AT91C_TC3_CMR   ((AT91_REG *) 	0x40014004) // (TC3) Channel Mode Register (Capture Mode / Waveform Mode)
#define AT91C_TC3_RC    ((AT91_REG *) 	0x4001401C) // (TC3) Register C
#define AT91C_TC3_RA    ((AT91_REG *) 	0x40014014) // (TC3) Register A
#define AT91C_TC3_IMR   ((AT91_REG *) 	0x4001402C) // (TC3) Interrupt Mask Register
#define AT91C_TC3_RB    ((AT91_REG *) 	0x40014018) // (TC3) Register B
#define AT91C_TC3_CCR   ((AT91_REG *) 	0x40014000) // (TC3) Channel Control Register
// ========== Register definition for TC4 peripheral ========== 
#define AT91C_TC4_CV    ((AT91_REG *) 	0x40014050) // (TC4) Counter Value
#define AT91C_TC4_CMR   ((AT91_REG *) 	0x40014044) // (TC4) Channel Mode Register (Capture Mode / Waveform Mode)
#define AT91C_TC4_RA    ((AT91_REG *) 	0x40014054) // (TC4) Register A
#define AT91C_TC4_IMR   ((AT91_REG *) 	0x4001406C) // (TC4) Interrupt Mask Register
#define AT91C_TC4_RC    ((AT91_REG *) 	0x4001405C) // (TC4) Register C
#define AT91C_TC4_SR    ((AT91_REG *) 	0x40014060) // (TC4) Status Register
#define AT91C_TC4_RB    ((AT91_REG *) 	0x40014058) // (TC4) Register B
#define AT91C_TC4_IDR   ((AT91_REG *) 	0x40014068) // (TC4) Interrupt Disable Register
#define AT91C_TC4_IER   ((AT91_REG *) 	0x40014064) // (TC4) Interrupt Enable Register
#define AT91C_TC4_CCR   ((AT91_REG *) 	0x40014040) // (TC4) Channel Control Register
// ========== Register definition for TC5 peripheral ========== 
#define AT91C_TC5_CV    ((AT91_REG *) 	0x40014090) // (TC5) Counter Value
#define AT91C_TC5_IER   ((AT91_REG *) 	0x400140A4) // (TC5) Interrupt Enable Register
#define AT91C_TC5_CMR   ((AT91_REG *) 	0x40014084) // (TC5) Channel Mode Register (Capture Mode / Waveform Mode)
#define AT91C_TC5_IMR   ((AT91_REG *) 	0x400140AC) // (TC5) Interrupt Mask Register
#define AT91C_TC5_RA    ((AT91_REG *) 	0x40014094) // (TC5) Register A
#define AT91C_TC5_RB    ((AT91_REG *) 	0x40014098) // (TC5) Register B
#define AT91C_TC5_RC    ((AT91_REG *) 	0x4001409C) // (TC5) Register C
#define AT91C_TC5_SR    ((AT91_REG *) 	0x400140A0) // (TC5) Status Register
#define AT91C_TC5_CCR   ((AT91_REG *) 	0x40014080) // (TC5) Channel Control Register
#define AT91C_TC5_IDR   ((AT91_REG *) 	0x400140A8) // (TC5) Interrupt Disable Register
// ========== Register definition for TCB0 peripheral ========== 
#define AT91C_TCB0_BCR  ((AT91_REG *) 	0x400100C0) // (TCB0) TC Block Control Register
#define AT91C_TCB0_VER  ((AT91_REG *) 	0x400100FC) // (TCB0)  Version Register
#define AT91C_TCB0_ADDRSIZE ((AT91_REG *) 	0x400100EC) // (TCB0) TC ADDRSIZE REGISTER 
#define AT91C_TCB0_FEATURES ((AT91_REG *) 	0x400100F8) // (TCB0) TC FEATURES REGISTER 
#define AT91C_TCB0_IPNAME2 ((AT91_REG *) 	0x400100F4) // (TCB0) TC IPNAME2 REGISTER 
#define AT91C_TCB0_BMR  ((AT91_REG *) 	0x400100C4) // (TCB0) TC Block Mode Register
#define AT91C_TCB0_IPNAME1 ((AT91_REG *) 	0x400100F0) // (TCB0) TC IPNAME1 REGISTER 
// ========== Register definition for TCB1 peripheral ========== 
#define AT91C_TCB1_IPNAME1 ((AT91_REG *) 	0x40010130) // (TCB1) TC IPNAME1 REGISTER 
#define AT91C_TCB1_IPNAME2 ((AT91_REG *) 	0x40010134) // (TCB1) TC IPNAME2 REGISTER 
#define AT91C_TCB1_BCR  ((AT91_REG *) 	0x40010100) // (TCB1) TC Block Control Register
#define AT91C_TCB1_VER  ((AT91_REG *) 	0x4001013C) // (TCB1)  Version Register
#define AT91C_TCB1_FEATURES ((AT91_REG *) 	0x40010138) // (TCB1) TC FEATURES REGISTER 
#define AT91C_TCB1_ADDRSIZE ((AT91_REG *) 	0x4001012C) // (TCB1) TC ADDRSIZE REGISTER 
#define AT91C_TCB1_BMR  ((AT91_REG *) 	0x40010104) // (TCB1) TC Block Mode Register
// ========== Register definition for TCB2 peripheral ========== 
#define AT91C_TCB2_VER  ((AT91_REG *) 	0x4001017C) // (TCB2)  Version Register
#define AT91C_TCB2_ADDRSIZE ((AT91_REG *) 	0x4001016C) // (TCB2) TC ADDRSIZE REGISTER 
#define AT91C_TCB2_FEATURES ((AT91_REG *) 	0x40010178) // (TCB2) TC FEATURES REGISTER 
#define AT91C_TCB2_BCR  ((AT91_REG *) 	0x40010140) // (TCB2) TC Block Control Register
#define AT91C_TCB2_IPNAME2 ((AT91_REG *) 	0x40010174) // (TCB2) TC IPNAME2 REGISTER 
#define AT91C_TCB2_BMR  ((AT91_REG *) 	0x40010144) // (TCB2) TC Block Mode Register
#define AT91C_TCB2_IPNAME1 ((AT91_REG *) 	0x40010170) // (TCB2) TC IPNAME1 REGISTER 
// ========== Register definition for TCB3 peripheral ========== 
#define AT91C_TCB3_IPNAME2 ((AT91_REG *) 	0x400140F4) // (TCB3) TC IPNAME2 REGISTER 
#define AT91C_TCB3_BMR  ((AT91_REG *) 	0x400140C4) // (TCB3) TC Block Mode Register
#define AT91C_TCB3_IPNAME1 ((AT91_REG *) 	0x400140F0) // (TCB3) TC IPNAME1 REGISTER 
#define AT91C_TCB3_FEATURES ((AT91_REG *) 	0x400140F8) // (TCB3) TC FEATURES REGISTER 
#define AT91C_TCB3_ADDRSIZE ((AT91_REG *) 	0x400140EC) // (TCB3) TC ADDRSIZE REGISTER 
#define AT91C_TCB3_VER  ((AT91_REG *) 	0x400140FC) // (TCB3)  Version Register
#define AT91C_TCB3_BCR  ((AT91_REG *) 	0x400140C0) // (TCB3) TC Block Control Register
// ========== Register definition for TCB4 peripheral ========== 
#define AT91C_TCB4_BMR  ((AT91_REG *) 	0x40014104) // (TCB4) TC Block Mode Register
#define AT91C_TCB4_BCR  ((AT91_REG *) 	0x40014100) // (TCB4) TC Block Control Register
#define AT91C_TCB4_IPNAME2 ((AT91_REG *) 	0x40014134) // (TCB4) TC IPNAME2 REGISTER 
#define AT91C_TCB4_FEATURES ((AT91_REG *) 	0x40014138) // (TCB4) TC FEATURES REGISTER 
#define AT91C_TCB4_IPNAME1 ((AT91_REG *) 	0x40014130) // (TCB4) TC IPNAME1 REGISTER 
#define AT91C_TCB4_VER  ((AT91_REG *) 	0x4001413C) // (TCB4)  Version Register
#define AT91C_TCB4_ADDRSIZE ((AT91_REG *) 	0x4001412C) // (TCB4) TC ADDRSIZE REGISTER 
// ========== Register definition for TCB5 peripheral ========== 
#define AT91C_TCB5_VER  ((AT91_REG *) 	0x4001417C) // (TCB5)  Version Register
#define AT91C_TCB5_ADDRSIZE ((AT91_REG *) 	0x4001416C) // (TCB5) TC ADDRSIZE REGISTER 
#define AT91C_TCB5_BMR  ((AT91_REG *) 	0x40014144) // (TCB5) TC Block Mode Register
#define AT91C_TCB5_FEATURES ((AT91_REG *) 	0x40014178) // (TCB5) TC FEATURES REGISTER 
#define AT91C_TCB5_IPNAME2 ((AT91_REG *) 	0x40014174) // (TCB5) TC IPNAME2 REGISTER 
#define AT91C_TCB5_IPNAME1 ((AT91_REG *) 	0x40014170) // (TCB5) TC IPNAME1 REGISTER 
#define AT91C_TCB5_BCR  ((AT91_REG *) 	0x40014140) // (TCB5) TC Block Control Register
// ========== Register definition for EFC0 peripheral ========== 
#define AT91C_EFC0_FMR  ((AT91_REG *) 	0x400E0A00) // (EFC0) EFC Flash Mode Register
#define AT91C_EFC0_FVR  ((AT91_REG *) 	0x400E0A14) // (EFC0) EFC Flash Version Register
#define AT91C_EFC0_FSR  ((AT91_REG *) 	0x400E0A08) // (EFC0) EFC Flash Status Register
#define AT91C_EFC0_FCR  ((AT91_REG *) 	0x400E0A04) // (EFC0) EFC Flash Command Register
#define AT91C_EFC0_FRR  ((AT91_REG *) 	0x400E0A0C) // (EFC0) EFC Flash Result Register
// ========== Register definition for MCI0 peripheral ========== 
#define AT91C_MCI0_DMA  ((AT91_REG *) 	0x40000050) // (MCI0) MCI DMA Configuration Register
#define AT91C_MCI0_SDCR ((AT91_REG *) 	0x4000000C) // (MCI0) MCI SD/SDIO Card Register
#define AT91C_MCI0_IPNAME1 ((AT91_REG *) 	0x400000F0) // (MCI0) MCI IPNAME1 REGISTER 
#define AT91C_MCI0_CSTOR ((AT91_REG *) 	0x4000001C) // (MCI0) MCI Completion Signal Timeout Register
#define AT91C_MCI0_RDR  ((AT91_REG *) 	0x40000030) // (MCI0) MCI Receive Data Register
#define AT91C_MCI0_CMDR ((AT91_REG *) 	0x40000014) // (MCI0) MCI Command Register
#define AT91C_MCI0_IDR  ((AT91_REG *) 	0x40000048) // (MCI0) MCI Interrupt Disable Register
#define AT91C_MCI0_ADDRSIZE ((AT91_REG *) 	0x400000EC) // (MCI0) MCI ADDRSIZE REGISTER 
#define AT91C_MCI0_WPCR ((AT91_REG *) 	0x400000E4) // (MCI0) MCI Write Protection Control Register
#define AT91C_MCI0_RSPR ((AT91_REG *) 	0x40000020) // (MCI0) MCI Response Register
#define AT91C_MCI0_IPNAME2 ((AT91_REG *) 	0x400000F4) // (MCI0) MCI IPNAME2 REGISTER 
#define AT91C_MCI0_CR   ((AT91_REG *) 	0x40000000) // (MCI0) MCI Control Register
#define AT91C_MCI0_IMR  ((AT91_REG *) 	0x4000004C) // (MCI0) MCI Interrupt Mask Register
#define AT91C_MCI0_WPSR ((AT91_REG *) 	0x400000E8) // (MCI0) MCI Write Protection Status Register
#define AT91C_MCI0_DTOR ((AT91_REG *) 	0x40000008) // (MCI0) MCI Data Timeout Register
#define AT91C_MCI0_MR   ((AT91_REG *) 	0x40000004) // (MCI0) MCI Mode Register
#define AT91C_MCI0_SR   ((AT91_REG *) 	0x40000040) // (MCI0) MCI Status Register
#define AT91C_MCI0_IER  ((AT91_REG *) 	0x40000044) // (MCI0) MCI Interrupt Enable Register
#define AT91C_MCI0_VER  ((AT91_REG *) 	0x400000FC) // (MCI0) MCI VERSION REGISTER 
#define AT91C_MCI0_FEATURES ((AT91_REG *) 	0x400000F8) // (MCI0) MCI FEATURES REGISTER 
#define AT91C_MCI0_BLKR ((AT91_REG *) 	0x40000018) // (MCI0) MCI Block Register
#define AT91C_MCI0_ARGR ((AT91_REG *) 	0x40000010) // (MCI0) MCI Argument Register
#define AT91C_MCI0_FIFO ((AT91_REG *) 	0x40000200) // (MCI0) MCI FIFO Aperture Register
#define AT91C_MCI0_TDR  ((AT91_REG *) 	0x40000034) // (MCI0) MCI Transmit Data Register
#define AT91C_MCI0_CFG  ((AT91_REG *) 	0x40000054) // (MCI0) MCI Configuration Register
// ========== Register definition for PDC_TWI0 peripheral ========== 
#define AT91C_TWI0_PTSR ((AT91_REG *) 	0x40018124) // (PDC_TWI0) PDC Transfer Status Register
#define AT91C_TWI0_TPR  ((AT91_REG *) 	0x40018108) // (PDC_TWI0) Transmit Pointer Register
#define AT91C_TWI0_RPR  ((AT91_REG *) 	0x40018100) // (PDC_TWI0) Receive Pointer Register
#define AT91C_TWI0_TNPR ((AT91_REG *) 	0x40018118) // (PDC_TWI0) Transmit Next Pointer Register
#define AT91C_TWI0_PTCR ((AT91_REG *) 	0x40018120) // (PDC_TWI0) PDC Transfer Control Register
#define AT91C_TWI0_RCR  ((AT91_REG *) 	0x40018104) // (PDC_TWI0) Receive Counter Register
#define AT91C_TWI0_RNCR ((AT91_REG *) 	0x40018114) // (PDC_TWI0) Receive Next Counter Register
#define AT91C_TWI0_RNPR ((AT91_REG *) 	0x40018110) // (PDC_TWI0) Receive Next Pointer Register
#define AT91C_TWI0_TNCR ((AT91_REG *) 	0x4001811C) // (PDC_TWI0) Transmit Next Counter Register
#define AT91C_TWI0_TCR  ((AT91_REG *) 	0x4001810C) // (PDC_TWI0) Transmit Counter Register
// ========== Register definition for PDC_TWI1 peripheral ========== 
#define AT91C_TWI1_TPR  ((AT91_REG *) 	0x4001C108) // (PDC_TWI1) Transmit Pointer Register
#define AT91C_TWI1_RNCR ((AT91_REG *) 	0x4001C114) // (PDC_TWI1) Receive Next Counter Register
#define AT91C_TWI1_TNCR ((AT91_REG *) 	0x4001C11C) // (PDC_TWI1) Transmit Next Counter Register
#define AT91C_TWI1_TCR  ((AT91_REG *) 	0x4001C10C) // (PDC_TWI1) Transmit Counter Register
#define AT91C_TWI1_TNPR ((AT91_REG *) 	0x4001C118) // (PDC_TWI1) Transmit Next Pointer Register
#define AT91C_TWI1_PTCR ((AT91_REG *) 	0x4001C120) // (PDC_TWI1) PDC Transfer Control Register
#define AT91C_TWI1_RNPR ((AT91_REG *) 	0x4001C110) // (PDC_TWI1) Receive Next Pointer Register
#define AT91C_TWI1_PTSR ((AT91_REG *) 	0x4001C124) // (PDC_TWI1) PDC Transfer Status Register
#define AT91C_TWI1_RPR  ((AT91_REG *) 	0x4001C100) // (PDC_TWI1) Receive Pointer Register
#define AT91C_TWI1_RCR  ((AT91_REG *) 	0x4001C104) // (PDC_TWI1) Receive Counter Register
// ========== Register definition for TWI0 peripheral ========== 
#define AT91C_TWI0_IMR  ((AT91_REG *) 	0x4001802C) // (TWI0) Interrupt Mask Register
#define AT91C_TWI0_IPNAME1 ((AT91_REG *) 	0x400180F0) // (TWI0) TWI IPNAME1 REGISTER 
#define AT91C_TWI0_CR   ((AT91_REG *) 	0x40018000) // (TWI0) Control Register
#define AT91C_TWI0_IPNAME2 ((AT91_REG *) 	0x400180F4) // (TWI0) TWI IPNAME2 REGISTER 
#define AT91C_TWI0_CWGR ((AT91_REG *) 	0x40018010) // (TWI0) Clock Waveform Generator Register
#define AT91C_TWI0_SMR  ((AT91_REG *) 	0x40018008) // (TWI0) Slave Mode Register
#define AT91C_TWI0_ADDRSIZE ((AT91_REG *) 	0x400180EC) // (TWI0) TWI ADDRSIZE REGISTER 
#define AT91C_TWI0_SR   ((AT91_REG *) 	0x40018020) // (TWI0) Status Register
#define AT91C_TWI0_IER  ((AT91_REG *) 	0x40018024) // (TWI0) Interrupt Enable Register
#define AT91C_TWI0_VER  ((AT91_REG *) 	0x400180FC) // (TWI0) Version Register
#define AT91C_TWI0_RHR  ((AT91_REG *) 	0x40018030) // (TWI0) Receive Holding Register
#define AT91C_TWI0_IADR ((AT91_REG *) 	0x4001800C) // (TWI0) Internal Address Register
#define AT91C_TWI0_IDR  ((AT91_REG *) 	0x40018028) // (TWI0) Interrupt Disable Register
#define AT91C_TWI0_THR  ((AT91_REG *) 	0x40018034) // (TWI0) Transmit Holding Register
#define AT91C_TWI0_FEATURES ((AT91_REG *) 	0x400180F8) // (TWI0) TWI FEATURES REGISTER 
#define AT91C_TWI0_MMR  ((AT91_REG *) 	0x40018004) // (TWI0) Master Mode Register
// ========== Register definition for TWI1 peripheral ========== 
#define AT91C_TWI1_CR   ((AT91_REG *) 	0x4001C000) // (TWI1) Control Register
#define AT91C_TWI1_VER  ((AT91_REG *) 	0x4001C0FC) // (TWI1) Version Register
#define AT91C_TWI1_IMR  ((AT91_REG *) 	0x4001C02C) // (TWI1) Interrupt Mask Register
#define AT91C_TWI1_IADR ((AT91_REG *) 	0x4001C00C) // (TWI1) Internal Address Register
#define AT91C_TWI1_THR  ((AT91_REG *) 	0x4001C034) // (TWI1) Transmit Holding Register
#define AT91C_TWI1_IPNAME2 ((AT91_REG *) 	0x4001C0F4) // (TWI1) TWI IPNAME2 REGISTER 
#define AT91C_TWI1_FEATURES ((AT91_REG *) 	0x4001C0F8) // (TWI1) TWI FEATURES REGISTER 
#define AT91C_TWI1_SMR  ((AT91_REG *) 	0x4001C008) // (TWI1) Slave Mode Register
#define AT91C_TWI1_IDR  ((AT91_REG *) 	0x4001C028) // (TWI1) Interrupt Disable Register
#define AT91C_TWI1_SR   ((AT91_REG *) 	0x4001C020) // (TWI1) Status Register
#define AT91C_TWI1_IPNAME1 ((AT91_REG *) 	0x4001C0F0) // (TWI1) TWI IPNAME1 REGISTER 
#define AT91C_TWI1_IER  ((AT91_REG *) 	0x4001C024) // (TWI1) Interrupt Enable Register
#define AT91C_TWI1_ADDRSIZE ((AT91_REG *) 	0x4001C0EC) // (TWI1) TWI ADDRSIZE REGISTER 
#define AT91C_TWI1_CWGR ((AT91_REG *) 	0x4001C010) // (TWI1) Clock Waveform Generator Register
#define AT91C_TWI1_MMR  ((AT91_REG *) 	0x4001C004) // (TWI1) Master Mode Register
#define AT91C_TWI1_RHR  ((AT91_REG *) 	0x4001C030) // (TWI1) Receive Holding Register
// ========== Register definition for PDC_US0 peripheral ========== 
#define AT91C_US0_RNCR  ((AT91_REG *) 	0x40024114) // (PDC_US0) Receive Next Counter Register
#define AT91C_US0_PTCR  ((AT91_REG *) 	0x40024120) // (PDC_US0) PDC Transfer Control Register
#define AT91C_US0_TCR   ((AT91_REG *) 	0x4002410C) // (PDC_US0) Transmit Counter Register
#define AT91C_US0_RPR   ((AT91_REG *) 	0x40024100) // (PDC_US0) Receive Pointer Register
#define AT91C_US0_RNPR  ((AT91_REG *) 	0x40024110) // (PDC_US0) Receive Next Pointer Register
#define AT91C_US0_TNCR  ((AT91_REG *) 	0x4002411C) // (PDC_US0) Transmit Next Counter Register
#define AT91C_US0_PTSR  ((AT91_REG *) 	0x40024124) // (PDC_US0) PDC Transfer Status Register
#define AT91C_US0_RCR   ((AT91_REG *) 	0x40024104) // (PDC_US0) Receive Counter Register
#define AT91C_US0_TNPR  ((AT91_REG *) 	0x40024118) // (PDC_US0) Transmit Next Pointer Register
#define AT91C_US0_TPR   ((AT91_REG *) 	0x40024108) // (PDC_US0) Transmit Pointer Register
// ========== Register definition for US0 peripheral ========== 
#define AT91C_US0_MAN   ((AT91_REG *) 	0x40024050) // (US0) Manchester Encoder Decoder Register
#define AT91C_US0_IER   ((AT91_REG *) 	0x40024008) // (US0) Interrupt Enable Register
#define AT91C_US0_NER   ((AT91_REG *) 	0x40024044) // (US0) Nb Errors Register
#define AT91C_US0_BRGR  ((AT91_REG *) 	0x40024020) // (US0) Baud Rate Generator Register
#define AT91C_US0_VER   ((AT91_REG *) 	0x400240FC) // (US0) VERSION Register
#define AT91C_US0_IF    ((AT91_REG *) 	0x4002404C) // (US0) IRDA_FILTER Register
#define AT91C_US0_RHR   ((AT91_REG *) 	0x40024018) // (US0) Receiver Holding Register
#define AT91C_US0_CSR   ((AT91_REG *) 	0x40024014) // (US0) Channel Status Register
#define AT91C_US0_FEATURES ((AT91_REG *) 	0x400240F8) // (US0) US FEATURES REGISTER 
#define AT91C_US0_ADDRSIZE ((AT91_REG *) 	0x400240EC) // (US0) US ADDRSIZE REGISTER 
#define AT91C_US0_IMR   ((AT91_REG *) 	0x40024010) // (US0) Interrupt Mask Register
#define AT91C_US0_THR   ((AT91_REG *) 	0x4002401C) // (US0) Transmitter Holding Register
#define AT91C_US0_FIDI  ((AT91_REG *) 	0x40024040) // (US0) FI_DI_Ratio Register
#define AT91C_US0_MR    ((AT91_REG *) 	0x40024004) // (US0) Mode Register
#define AT91C_US0_RTOR  ((AT91_REG *) 	0x40024024) // (US0) Receiver Time-out Register
#define AT91C_US0_IPNAME1 ((AT91_REG *) 	0x400240F0) // (US0) US IPNAME1 REGISTER 
#define AT91C_US0_IDR   ((AT91_REG *) 	0x4002400C) // (US0) Interrupt Disable Register
#define AT91C_US0_IPNAME2 ((AT91_REG *) 	0x400240F4) // (US0) US IPNAME2 REGISTER 
#define AT91C_US0_CR    ((AT91_REG *) 	0x40024000) // (US0) Control Register
#define AT91C_US0_TTGR  ((AT91_REG *) 	0x40024028) // (US0) Transmitter Time-guard Register
// ========== Register definition for PDC_US1 peripheral ========== 
#define AT91C_US1_TNPR  ((AT91_REG *) 	0x40028118) // (PDC_US1) Transmit Next Pointer Register
#define AT91C_US1_RPR   ((AT91_REG *) 	0x40028100) // (PDC_US1) Receive Pointer Register
#define AT91C_US1_TCR   ((AT91_REG *) 	0x4002810C) // (PDC_US1) Transmit Counter Register
#define AT91C_US1_RCR   ((AT91_REG *) 	0x40028104) // (PDC_US1) Receive Counter Register
#define AT91C_US1_TPR   ((AT91_REG *) 	0x40028108) // (PDC_US1) Transmit Pointer Register
#define AT91C_US1_RNPR  ((AT91_REG *) 	0x40028110) // (PDC_US1) Receive Next Pointer Register
#define AT91C_US1_TNCR  ((AT91_REG *) 	0x4002811C) // (PDC_US1) Transmit Next Counter Register
#define AT91C_US1_PTCR  ((AT91_REG *) 	0x40028120) // (PDC_US1) PDC Transfer Control Register
#define AT91C_US1_RNCR  ((AT91_REG *) 	0x40028114) // (PDC_US1) Receive Next Counter Register
#define AT91C_US1_PTSR  ((AT91_REG *) 	0x40028124) // (PDC_US1) PDC Transfer Status Register
// ========== Register definition for US1 peripheral ========== 
#define AT91C_US1_ADDRSIZE ((AT91_REG *) 	0x400280EC) // (US1) US ADDRSIZE REGISTER 
#define AT91C_US1_IDR   ((AT91_REG *) 	0x4002800C) // (US1) Interrupt Disable Register
#define AT91C_US1_FEATURES ((AT91_REG *) 	0x400280F8) // (US1) US FEATURES REGISTER 
#define AT91C_US1_IPNAME2 ((AT91_REG *) 	0x400280F4) // (US1) US IPNAME2 REGISTER 
#define AT91C_US1_MAN   ((AT91_REG *) 	0x40028050) // (US1) Manchester Encoder Decoder Register
#define AT91C_US1_CR    ((AT91_REG *) 	0x40028000) // (US1) Control Register
#define AT91C_US1_TTGR  ((AT91_REG *) 	0x40028028) // (US1) Transmitter Time-guard Register
#define AT91C_US1_IF    ((AT91_REG *) 	0x4002804C) // (US1) IRDA_FILTER Register
#define AT91C_US1_FIDI  ((AT91_REG *) 	0x40028040) // (US1) FI_DI_Ratio Register
#define AT91C_US1_THR   ((AT91_REG *) 	0x4002801C) // (US1) Transmitter Holding Register
#define AT91C_US1_VER   ((AT91_REG *) 	0x400280FC) // (US1) VERSION Register
#define AT91C_US1_MR    ((AT91_REG *) 	0x40028004) // (US1) Mode Register
#define AT91C_US1_CSR   ((AT91_REG *) 	0x40028014) // (US1) Channel Status Register
#define AT91C_US1_IER   ((AT91_REG *) 	0x40028008) // (US1) Interrupt Enable Register
#define AT91C_US1_NER   ((AT91_REG *) 	0x40028044) // (US1) Nb Errors Register
#define AT91C_US1_RHR   ((AT91_REG *) 	0x40028018) // (US1) Receiver Holding Register
#define AT91C_US1_IPNAME1 ((AT91_REG *) 	0x400280F0) // (US1) US IPNAME1 REGISTER 
#define AT91C_US1_IMR   ((AT91_REG *) 	0x40028010) // (US1) Interrupt Mask Register
#define AT91C_US1_BRGR  ((AT91_REG *) 	0x40028020) // (US1) Baud Rate Generator Register
#define AT91C_US1_RTOR  ((AT91_REG *) 	0x40028024) // (US1) Receiver Time-out Register
// ========== Register definition for PDC_SSC0 peripheral ========== 
#define AT91C_SSC0_RNCR ((AT91_REG *) 	0x40004114) // (PDC_SSC0) Receive Next Counter Register
#define AT91C_SSC0_TPR  ((AT91_REG *) 	0x40004108) // (PDC_SSC0) Transmit Pointer Register
