una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s1.h
// *****************************************************************************
//               PIO DEFINITIONS FOR AT91SAM3S1
// *****************************************************************************
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) // Pin Controlled by PA0
#define AT91C_PA0_PWMH0    ((unsigned int) AT91C_PIO_PA0) //  
#define AT91C_PA0_TIOA0    ((unsigned int) AT91C_PIO_PA0) //  
#define AT91C_PA0_A17      ((unsigned int) AT91C_PIO_PA0) //  
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) // Pin Controlled by PA1
#define AT91C_PA1_PWMH1    ((unsigned int) AT91C_PIO_PA1) //  
#define AT91C_PA1_TIOB0    ((unsigned int) AT91C_PIO_PA1) //  
#define AT91C_PA1_A18      ((unsigned int) AT91C_PIO_PA1) //  
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) // Pin Controlled by PA10
#define AT91C_PA10_UTXD0    ((unsigned int) AT91C_PIO_PA10) //  
#define AT91C_PA10_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PA10) //  
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) // Pin Controlled by PA11
#define AT91C_PA11_SPI0_NPCS0 ((unsigned int) AT91C_PIO_PA11) //  
#define AT91C_PA11_PWMH0    ((unsigned int) AT91C_PIO_PA11) //  
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) // Pin Controlled by PA12
#define AT91C_PA12_SPI0_MISO ((unsigned int) AT91C_PIO_PA12) //  
#define AT91C_PA12_PWMH1    ((unsigned int) AT91C_PIO_PA12) //  
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) // Pin Controlled by PA13
#define AT91C_PA13_SPI0_MOSI ((unsigned int) AT91C_PIO_PA13) //  
#define AT91C_PA13_PWMH2    ((unsigned int) AT91C_PIO_PA13) //  
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) // Pin Controlled by PA14
#define AT91C_PA14_SPI0_SPCK ((unsigned int) AT91C_PIO_PA14) //  
#define AT91C_PA14_PWMH3    ((unsigned int) AT91C_PIO_PA14) //  
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) // Pin Controlled by PA15
#define AT91C_PA15_TF       ((unsigned int) AT91C_PIO_PA15) //  
#define AT91C_PA15_TIOA1    ((unsigned int) AT91C_PIO_PA15) //  
#define AT91C_PA15_PWML3    ((unsigned int) AT91C_PIO_PA15) //  
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) // Pin Controlled by PA16
#define AT91C_PA16_TK       ((unsigned int) AT91C_PIO_PA16) //  
#define AT91C_PA16_TIOB1    ((unsigned int) AT91C_PIO_PA16) //  
#define AT91C_PA16_PWML2    ((unsigned int) AT91C_PIO_PA16) //  
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) // Pin Controlled by PA17
#define AT91C_PA17_TD       ((unsigned int) AT91C_PIO_PA17) //  
#define AT91C_PA17_PCK1     ((unsigned int) AT91C_PIO_PA17) //  
#define AT91C_PA17_PWMH3    ((unsigned int) AT91C_PIO_PA17) //  
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) // Pin Controlled by PA18
#define AT91C_PA18_RD       ((unsigned int) AT91C_PIO_PA18) //  
#define AT91C_PA18_PCK2     ((unsigned int) AT91C_PIO_PA18) //  
#define AT91C_PA18_A14      ((unsigned int) AT91C_PIO_PA18) //  
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) // Pin Controlled by PA19
#define AT91C_PA19_RK       ((unsigned int) AT91C_PIO_PA19) //  
#define AT91C_PA19_PWML0    ((unsigned int) AT91C_PIO_PA19) //  
#define AT91C_PA19_A15      ((unsigned int) AT91C_PIO_PA19) //  
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) // Pin Controlled by PA2
#define AT91C_PA2_PWMH2    ((unsigned int) AT91C_PIO_PA2) //  
#define AT91C_PA2_SCK0     ((unsigned int) AT91C_PIO_PA2) //  
#define AT91C_PA2_DATRG    ((unsigned int) AT91C_PIO_PA2) //  
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) // Pin Controlled by PA20
#define AT91C_PA20_RF       ((unsigned int) AT91C_PIO_PA20) //  
#define AT91C_PA20_PWML1    ((unsigned int) AT91C_PIO_PA20) //  
#define AT91C_PA20_A16      ((unsigned int) AT91C_PIO_PA20) //  
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) // Pin Controlled by PA21
#define AT91C_PA21_RXD1     ((unsigned int) AT91C_PIO_PA21) //  
#define AT91C_PA21_PCK1     ((unsigned int) AT91C_PIO_PA21) //  
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) // Pin Controlled by PA22
#define AT91C_PA22_TXD1     ((unsigned int) AT91C_PIO_PA22) //  
#define AT91C_PA22_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PA22) //  
#define AT91C_PA22_NCS2     ((unsigned int) AT91C_PIO_PA22) //  
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) // Pin Controlled by PA23
#define AT91C_PA23_SCK1     ((unsigned int) AT91C_PIO_PA23) //  
#define AT91C_PA23_PWMH0    ((unsigned int) AT91C_PIO_PA23) //  
#define AT91C_PA23_A19      ((unsigned int) AT91C_PIO_PA23) //  
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) // Pin Controlled by PA24
#define AT91C_PA24_RTS1     ((unsigned int) AT91C_PIO_PA24) //  
#define AT91C_PA24_PWMH1    ((unsigned int) AT91C_PIO_PA24) //  
#define AT91C_PA24_A20      ((unsigned int) AT91C_PIO_PA24) //  
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) // Pin Controlled by PA25
#define AT91C_PA25_CTS1     ((unsigned int) AT91C_PIO_PA25) //  
#define AT91C_PA25_PWMH2    ((unsigned int) AT91C_PIO_PA25) //  
#define AT91C_PA25_A23      ((unsigned int) AT91C_PIO_PA25) //  
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) // Pin Controlled by PA26
#define AT91C_PA26_DCD1     ((unsigned int) AT91C_PIO_PA26) //  
#define AT91C_PA26_TIOA2    ((unsigned int) AT91C_PIO_PA26) //  
#define AT91C_PA26_MCI0_DA2 ((unsigned int) AT91C_PIO_PA26) //  
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) // Pin Controlled by PA27
#define AT91C_PA27_DTR1     ((unsigned int) AT91C_PIO_PA27) //  
#define AT91C_PA27_TIOB2    ((unsigned int) AT91C_PIO_PA27) //  
#define AT91C_PA27_MCI0_DA3 ((unsigned int) AT91C_PIO_PA27) //  
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) // Pin Controlled by PA28
#define AT91C_PA28_DSR1     ((unsigned int) AT91C_PIO_PA28) //  
#define AT91C_PA28_TCLK1    ((unsigned int) AT91C_PIO_PA28) //  
#define AT91C_PA28_MCI0_CDA ((unsigned int) AT91C_PIO_PA28) //  
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) // Pin Controlled by PA29
#define AT91C_PA29_RI1      ((unsigned int) AT91C_PIO_PA29) //  
#define AT91C_PA29_TCLK2    ((unsigned int) AT91C_PIO_PA29) //  
#define AT91C_PA29_MCI0_CK  ((unsigned int) AT91C_PIO_PA29) //  
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) // Pin Controlled by PA3
#define AT91C_PA3_TWD0     ((unsigned int) AT91C_PIO_PA3) //  
#define AT91C_PA3_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PA3) //  
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) // Pin Controlled by PA30
#define AT91C_PA30_PWML2    ((unsigned int) AT91C_PIO_PA30) //  
#define AT91C_PA30_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PA30) //  
#define AT91C_PA30_MCI0_DA0 ((unsigned int) AT91C_PIO_PA30) //  
#define AT91C_PIO_PA31       ((unsigned int) 1 << 31) // Pin Controlled by PA31
#define AT91C_PA31_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA31) //  
#define AT91C_PA31_PCK2     ((unsigned int) AT91C_PIO_PA31) //  
#define AT91C_PA31_MCI0_DA1 ((unsigned int) AT91C_PIO_PA31) //  
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) // Pin Controlled by PA4
#define AT91C_PA4_TWCK0    ((unsigned int) AT91C_PIO_PA4) //  
#define AT91C_PA4_TCLK0    ((unsigned int) AT91C_PIO_PA4) //  
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) // Pin Controlled by PA5
#define AT91C_PA5_RXD0     ((unsigned int) AT91C_PIO_PA5) //  
#define AT91C_PA5_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PA5) //  
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) // Pin Controlled by PA6
#define AT91C_PA6_TXD0     ((unsigned int) AT91C_PIO_PA6) //  
#define AT91C_PA6_PCK0     ((unsigned int) AT91C_PIO_PA6) //  
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) // Pin Controlled by PA7
#define AT91C_PA7_RTS0     ((unsigned int) AT91C_PIO_PA7) //  
#define AT91C_PA7_PWMH3    ((unsigned int) AT91C_PIO_PA7) //  
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) // Pin Controlled by PA8
#define AT91C_PA8_CTS0     ((unsigned int) AT91C_PIO_PA8) //  
#define AT91C_PA8_ADTRG    ((unsigned int) AT91C_PIO_PA8) //  
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) // Pin Controlled by PA9
#define AT91C_PA9_URXD0    ((unsigned int) AT91C_PIO_PA9) //  
#define AT91C_PA9_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA9) //  
#define AT91C_PA9_PWMFI0   ((unsigned int) AT91C_PIO_PA9) //  
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) // Pin Controlled by PB0
#define AT91C_PB0_PWMH0    ((unsigned int) AT91C_PIO_PB0) //  
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) // Pin Controlled by PB1
#define AT91C_PB1_PWMH1    ((unsigned int) AT91C_PIO_PB1) //  
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) // Pin Controlled by PB10
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) // Pin Controlled by PB11
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) // Pin Controlled by PB12
#define AT91C_PB12_PWML1    ((unsigned int) AT91C_PIO_PB12) //  
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) // Pin Controlled by PB13
#define AT91C_PB13_PWML2    ((unsigned int) AT91C_PIO_PB13) //  
#define AT91C_PB13_PCK0     ((unsigned int) AT91C_PIO_PB13) //  
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) // Pin Controlled by PB14
#define AT91C_PB14_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PB14) //  
#define AT91C_PB14_PWMH3    ((unsigned int) AT91C_PIO_PB14) //  
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) // Pin Controlled by PB2
#define AT91C_PB2_URXD1    ((unsigned int) AT91C_PIO_PB2) //  
#define AT91C_PB2_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PB2) //  
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) // Pin Controlled by PB3
#define AT91C_PB3_UTXD1    ((unsigned int) AT91C_PIO_PB3) //  
#define AT91C_PB3_PCK2     ((unsigned int) AT91C_PIO_PB3) //  
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) // Pin Controlled by PB4
#define AT91C_PB4_TWD1     ((unsigned int) AT91C_PIO_PB4) //  
#define AT91C_PB4_PWMH2    ((unsigned int) AT91C_PIO_PB4) //  
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) // Pin Controlled by PB5
#define AT91C_PB5_TWCK1    ((unsigned int) AT91C_PIO_PB5) //  
#define AT91C_PB5_PWML0    ((unsigned int) AT91C_PIO_PB5) //  
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) // Pin Controlled by PB6
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) // Pin Controlled by PB7
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) // Pin Controlled by PB8
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) // Pin Controlled by PB9
#define AT91C_PIO_PC0        ((unsigned int) 1 <<  0) // Pin Controlled by PC0
#define AT91C_PC0_D0       ((unsigned int) AT91C_PIO_PC0) //  
#define AT91C_PC0_PWML0    ((unsigned int) AT91C_PIO_PC0) //  
#define AT91C_PIO_PC1        ((unsigned int) 1 <<  1) // Pin Controlled by PC1
#define AT91C_PC1_D1       ((unsigned int) AT91C_PIO_PC1) //  
#define AT91C_PC1_PWML1    ((unsigned int) AT91C_PIO_PC1) //  
#define AT91C_PIO_PC10       ((unsigned int) 1 << 10) // Pin Controlled by PC10
#define AT91C_PC10_NANDWE   ((unsigned int) AT91C_PIO_PC10) //  
#define AT91C_PIO_PC11       ((unsigned int) 1 << 11) // Pin Controlled by PC11
#define AT91C_PC11_NRD      ((unsigned int) AT91C_PIO_PC11) //  
#define AT91C_PIO_PC12       ((unsigned int) 1 << 12) // Pin Controlled by PC12
#define AT91C_PC12_NCS3     ((unsigned int) AT91C_PIO_PC12) //  
#define AT91C_PIO_PC13       ((unsigned int) 1 << 13) // Pin Controlled by PC13
#define AT91C_PC13_NWAIT    ((unsigned int) AT91C_PIO_PC13) //  
#define AT91C_PC13_PWML0    ((unsigned int) AT91C_PIO_PC13) //  
#define AT91C_PIO_PC14       ((unsigned int) 1 << 14) // Pin Controlled by PC14
#define AT91C_PC14_NCS0     ((unsigned int) AT91C_PIO_PC14) //  
#define AT91C_PIO_PC15       ((unsigned int) 1 << 15) // Pin Controlled by PC15
#define AT91C_PC15_NCS1     ((unsigned int) AT91C_PIO_PC15) //  
#define AT91C_PC15_PWML1    ((unsigned int) AT91C_PIO_PC15) //  
#define AT91C_PIO_PC16       ((unsigned int) 1 << 16) // Pin Controlled by PC16
#define AT91C_PC16_A21_NANDALE ((unsigned int) AT91C_PIO_PC16) //  
#define AT91C_PIO_PC17       ((unsigned int) 1 << 17) // Pin Controlled by PC17
#define AT91C_PC17_A22_NANDCLE ((unsigned int) AT91C_PIO_PC17) //  
#define AT91C_PIO_PC18       ((unsigned int) 1 << 18) // Pin Controlled by PC18
#define AT91C_PC18_A0_NBS0  ((unsigned int) AT91C_PIO_PC18) //  
#define AT91C_PC18_PWMH0    ((unsigned int) AT91C_PIO_PC18) //  
#define AT91C_PIO_PC19       ((unsigned int) 1 << 19) // Pin Controlled by PC19
#define AT91C_PC19_A1       ((unsigned int) AT91C_PIO_PC19) //  
#define AT91C_PC19_PWMH1    ((unsigned int) AT91C_PIO_PC19) //  
#define AT91C_PIO_PC2        ((unsigned int) 1 <<  2) // Pin Controlled by PC2
#define AT91C_PC2_D2       ((unsigned int) AT91C_PIO_PC2) //  
#define AT91C_PC2_PWML2    ((unsigned int) AT91C_PIO_PC2) //  
#define AT91C_PIO_PC20       ((unsigned int) 1 << 20) // Pin Controlled by PC20
#define AT91C_PC20_A2       ((unsigned int) AT91C_PIO_PC20) //  
#define AT91C_PC20_PWMH2    ((unsigned int) AT91C_PIO_PC20) //  
#define AT91C_PIO_PC21       ((unsigned int) 1 << 21) // Pin Controlled by PC21
#define AT91C_PC21_A3       ((unsigned int) AT91C_PIO_PC21) //  
#define AT91C_PC21_PWMH3    ((unsigned int) AT91C_PIO_PC21) //  
#define AT91C_PIO_PC22       ((unsigned int) 1 << 22) // Pin Controlled by PC22
#define AT91C_PC22_A4       ((unsigned int) AT91C_PIO_PC22) //  
#define AT91C_PC22_PWML3    ((unsigned int) AT91C_PIO_PC22) //  
#define AT91C_PIO_PC23       ((unsigned int) 1 << 23) // Pin Controlled by PC23
#define AT91C_PC23_A5       ((unsigned int) AT91C_PIO_PC23) //  
#define AT91C_PC23_TIOA3    ((unsigned int) AT91C_PIO_PC23) //  
#define AT91C_PIO_PC24       ((unsigned int) 1 << 24) // Pin Controlled by PC24
#define AT91C_PC24_A6       ((unsigned int) AT91C_PIO_PC24) //  
#define AT91C_PC24_TIOB3    ((unsigned int) AT91C_PIO_PC24) //  
#define AT91C_PIO_PC25       ((unsigned int) 1 << 25) // Pin Controlled by PC25
#define AT91C_PC25_A7       ((unsigned int) AT91C_PIO_PC25) //  
#define AT91C_PC25_TCLK3    ((unsigned int) AT91C_PIO_PC25) //  
#define AT91C_PIO_PC26       ((unsigned int) 1 << 26) // Pin Controlled by PC26
#define AT91C_PC26_A8       ((unsigned int) AT91C_PIO_PC26) //  
#define AT91C_PC26_TIOA4    ((unsigned int) AT91C_PIO_PC26) //  
#define AT91C_PIO_PC27       ((unsigned int) 1 << 27) // Pin Controlled by PC27
#define AT91C_PC27_A9       ((unsigned int) AT91C_PIO_PC27) //  
#define AT91C_PC27_TIOB4    ((unsigned int) AT91C_PIO_PC27) //  
#define AT91C_PIO_PC28       ((unsigned int) 1 << 28) // Pin Controlled by PC28
#define AT91C_PC28_A10      ((unsigned int) AT91C_PIO_PC28) //  
#define AT91C_PC28_TCLK4    ((unsigned int) AT91C_PIO_PC28) //  
#define AT91C_PIO_PC29       ((unsigned int) 1 << 29) // Pin Controlled by PC29
#define AT91C_PC29_A11      ((unsigned int) AT91C_PIO_PC29) //  
#define AT91C_PC29_TIOA5    ((unsigned int) AT91C_PIO_PC29) //  
#define AT91C_PIO_PC3        ((unsigned int) 1 <<  3) // Pin Controlled by PC3
#define AT91C_PC3_D3       ((unsigned int) AT91C_PIO_PC3) //  
#define AT91C_PC3_PWML3    ((unsigned int) AT91C_PIO_PC3) //  
#define AT91C_PIO_PC30       ((unsigned int) 1 << 30) // Pin Controlled by PC30
#define AT91C_PC30_A12      ((unsigned int) AT91C_PIO_PC30) //  
#define AT91C_PC30_TIOB5    ((unsigned int) AT91C_PIO_PC30) //  
#define AT91C_PIO_PC31       ((unsigned int) 1 << 31) // Pin Controlled by PC31
#define AT91C_PC31_A13      ((unsigned int) AT91C_PIO_PC31) //  
#define AT91C_PC31_TCLK5    ((unsigned int) AT91C_PIO_PC31) //  
#define AT91C_PIO_PC4        ((unsigned int) 1 <<  4) // Pin Controlled by PC4
#define AT91C_PC4_D4       ((unsigned int) AT91C_PIO_PC4) //  
#define AT91C_PC4_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PC4) //  
#define AT91C_PIO_PC5        ((unsigned int) 1 <<  5) // Pin Controlled by PC5
#define AT91C_PC5_D5       ((unsigned int) AT91C_PIO_PC5) //  
#define AT91C_PIO_PC6        ((unsigned int) 1 <<  6) // Pin Controlled by PC6
#define AT91C_PC6_D6       ((unsigned int) AT91C_PIO_PC6) //  
#define AT91C_PIO_PC7        ((unsigned int) 1 <<  7) // Pin Controlled by PC7
#define AT91C_PC7_D7       ((unsigned int) AT91C_PIO_PC7) //  
#define AT91C_PIO_PC8        ((unsigned int) 1 <<  8) // Pin Controlled by PC8
#define AT91C_PC8_NWR0_NWE ((unsigned int) AT91C_PIO_PC8) //  
#define AT91C_PIO_PC9        ((unsigned int) 1 <<  9) // Pin Controlled by PC9
#define AT91C_PC9_NANDOE   ((unsigned int) AT91C_PIO_PC9) //  

// *****************************************************************************
//               PERIPHERAL ID DEFINITIONS FOR AT91SAM3S1
// *****************************************************************************
#define AT91C_ID_SUPC   ((unsigned int)  0) // SUPPLY CONTROLLER
#define AT91C_ID_RSTC   ((unsigned int)  1) // RESET CONTROLLER
#define AT91C_ID_RTC    ((unsigned int)  2) // REAL TIME CLOCK
#define AT91C_ID_RTT    ((unsigned int)  3) // REAL TIME TIMER
#define AT91C_ID_WDG    ((unsigned int)  4) // WATCHDOG TIMER
#define AT91C_ID_PMC    ((unsigned int)  5) // PMC
#define AT91C_ID_EFC0   ((unsigned int)  6) // EFC0
#define AT91C_ID_DBGU0  ((unsigned int)  8) // DBGU0
#define AT91C_ID_DBGU1  ((unsigned int)  9) // DBGU1
#define AT91C_ID_HSMC3  ((unsigned int) 10) // HSMC3
#define AT91C_ID_PIOA   ((unsigned int) 11) // Parallel IO Controller A
#define AT91C_ID_PIOB   ((unsigned int) 12) // Parallel IO Controller B
#define AT91C_ID_PIOC   ((unsigned int) 13) // Parallel IO Controller C
#define AT91C_ID_US0    ((unsigned int) 14) // USART 0
#define AT91C_ID_US1    ((unsigned int) 15) // USART 1
#define AT91C_ID_MCI0   ((unsigned int) 18) // Multimedia Card Interface
#define AT91C_ID_TWI0   ((unsigned int) 19) // TWI 0
#define AT91C_ID_TWI1   ((unsigned int) 20) // TWI 1
#define AT91C_ID_SPI0   ((unsigned int) 21) // Serial Peripheral Interface
#define AT91C_ID_SSC0   ((unsigned int) 22) // Serial Synchronous Controller 0
#define AT91C_ID_TC0    ((unsigned int) 23) // Timer Counter 0
#define AT91C_ID_TC1    ((unsigned int) 24) // Timer Counter 1
#define AT91C_ID_TC2    ((unsigned int) 25) // Timer Counter 2
#define AT91C_ID_TC3    ((unsigned int) 26) // Timer Counter 0
#define AT91C_ID_TC4    ((unsigned int) 27) // Timer Counter 1
#define AT91C_ID_TC5    ((unsigned int) 28) // Timer Counter 2
#define AT91C_ID_ADC0   ((unsigned int) 29) // ADC controller0
#define AT91C_ID_DAC0   ((unsigned int) 30) // Digital to Analog Converter
#define AT91C_ID_PWMC   ((unsigned int) 31) // Pulse Width Modulation Controller
#define AT91C_ID_HCBDMA ((unsigned int) 32) // Context Based Direct Memory Access Controller Interface
#define AT91C_ID_ACC0   ((unsigned int) 33) // Analog Comparator Controller
#define AT91C_ID_UDP    ((unsigned int) 34) // USB Device
#define AT91C_ALL_INT   ((unsigned int) 0xFFFFFFFF) // ALL VALID INTERRUPTS

// *****************************************************************************
//               BASE ADDRESS DEFINITIONS FOR AT91SAM3S1
// *****************************************************************************
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0x400E0000) // (SYS) Base Address
#define AT91C_BASE_SMC       ((AT91PS_SMC) 	0x400E0000) // (SMC) Base Address
#define AT91C_BASE_MATRIX    ((AT91PS_HMATRIX2) 	0x400E0200) // (MATRIX) Base Address
#define AT91C_BASE_CCFG      ((AT91PS_CCFG) 	0x400E0310) // (CCFG) Base Address
#define AT91C_BASE_NVIC      ((AT91PS_NVIC) 	0xE000E000) // (NVIC) Base Address
#define AT91C_BASE_MPU       ((AT91PS_MPU) 	0xE000ED90) // (MPU) Base Address
#define AT91C_BASE_CM3       ((AT91PS_CM3) 	0xE000ED00) // (CM3) Base Address
#define AT91C_BASE_PDC_DBGU0 ((AT91PS_PDC) 	0x400E0700) // (PDC_DBGU0) Base Address
#define AT91C_BASE_DBGU0     ((AT91PS_DBGU) 	0x400E0600) // (DBGU0) Base Address
#define AT91C_BASE_PDC_DBGU1 ((AT91PS_PDC) 	0x400E0900) // (PDC_DBGU1) Base Address
#define AT91C_BASE_DBGU1     ((AT91PS_DBGU) 	0x400E0800) // (DBGU1) Base Address
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0x400E0E00) // (PIOA) Base Address
#define AT91C_BASE_PDC_PIOA  ((AT91PS_PDC) 	0x400E0F68) // (PDC_PIOA) Base Address
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0x400E1000) // (PIOB) Base Address
#define AT91C_BASE_PIOC      ((AT91PS_PIO) 	0x400E1200) // (PIOC) Base Address
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0x400E0400) // (PMC) Base Address
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0x400E041C) // (CKGR) Base Address
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0x400E1400) // (RSTC) Base Address
#define AT91C_BASE_SUPC      ((AT91PS_SUPC) 	0x400E1410) // (SUPC) Base Address
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0x400E1430) // (RTTC) Base Address
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0x400E1450) // (WDTC) Base Address
#define AT91C_BASE_RTC       ((AT91PS_RTC) 	0x400E1460) // (RTC) Base Address
#define AT91C_BASE_ADC0      ((AT91PS_ADC) 	0x40038000) // (ADC0) Base Address
#define AT91C_BASE_DAC0      ((AT91PS_DAC) 	0x4003C000) // (DAC0) Base Address
#define AT91C_BASE_ACC0      ((AT91PS_ACC) 	0x40040000) // (ACC0) Base Address
#define AT91C_BASE_HCBDMA    ((AT91PS_HCBDMA) 	0x40044000) // (HCBDMA) Base Address
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0x40010000) // (TC0) Base Address
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0x40010040) // (TC1) Base Address
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0x40010080) // (TC2) Base Address
#define AT91C_BASE_TC3       ((AT91PS_TC) 	0x40014000) // (TC3) Base Address
#define AT91C_BASE_TC4       ((AT91PS_TC) 	0x40014040) // (TC4) Base Address
#define AT91C_BASE_TC5       ((AT91PS_TC) 	0x40014080) // (TC5) Base Address
#define AT91C_BASE_TCB0      ((AT91PS_TCB) 	0x40010000) // (TCB0) Base Address
#define AT91C_BASE_TCB1      ((AT91PS_TCB) 	0x40010040) // (TCB1) Base Address
#define AT91C_BASE_TCB2      ((AT91PS_TCB) 	0x40010080) // (TCB2) Base Address
#define AT91C_BASE_TCB3      ((AT91PS_TCB) 	0x40014000) // (TCB3) Base Address
#define AT91C_BASE_TCB4      ((AT91PS_TCB) 	0x40014040) // (TCB4) Base Address
#define AT91C_BASE_TCB5      ((AT91PS_TCB) 	0x40014080) // (TCB5) Base Address
#define AT91C_BASE_EFC0      ((AT91PS_EFC) 	0x400E0A00) // (EFC0) Base Address
#define AT91C_BASE_MCI0      ((AT91PS_MCI) 	0x40000000) // (MCI0) Base Address
#define AT91C_BASE_PDC_TWI0  ((AT91PS_PDC) 	0x40018100) // (PDC_TWI0) Base Address
#define AT91C_BASE_PDC_TWI1  ((AT91PS_PDC) 	0x4001C100) // (PDC_TWI1) Base Address
#define AT91C_BASE_TWI0      ((AT91PS_TWI) 	0x40018000) // (TWI0) Base Address
#define AT91C_BASE_TWI1      ((AT91PS_TWI) 	0x4001C000) // (TWI1) Base Address
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0x40024100) // (PDC_US0) Base Address
#define AT91C_BASE_US0       ((AT91PS_USART) 	0x40024000) // (US0) Base Address
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0x40028100) // (PDC_US1) Base Address
#define AT91C_BASE_US1       ((AT91PS_USART) 	0x40028000) // (US1) Base Address
#define AT91C_BASE_PDC_SSC0  ((AT91PS_PDC) 	0x40004100) // (PDC_SSC0) Base Address
#define AT91C_BASE_SSC0      ((AT91PS_SSC) 	0x40004000) // (SSC0) Base Address
#define AT91C_BASE_PDC_PWMC  ((AT91PS_PDC) 	0x40020100) // (PDC_PWMC) Base Address
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0x40020200) // (PWMC_CH0) Base Address
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0x40020220) // (PWMC_CH1) Base Address
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0x40020240) // (PWMC_CH2) Base Address
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0x40020260) // (PWMC_CH3) Base Address
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0x40020000) // (PWMC) Base Address
#define AT91C_BASE_SPI0      ((AT91PS_SPI) 	0x40008000) // (SPI0) Base Address
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0x40034000) // (UDP) Base Address

