una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s1.h
// *****************************************************************************
//               MEMORY MAPPING DEFINITIONS FOR AT91SAM3S1
// *****************************************************************************
// IRAM
#define AT91C_IRAM 	 ((char *) 	0x20000000) // Maximum Internal SRAM base address
#define AT91C_IRAM_SIZE	 ((unsigned int) 0x0000C000) // Maximum Internal SRAM size in byte (48 Kbytes)
// IROM
#define AT91C_IROM 	 ((char *) 	0x00800000) // Internal ROM base address
#define AT91C_IROM_SIZE	 ((unsigned int) 0x00008000) // Internal ROM size in byte (32 Kbytes)
// EBI_CS0
#define AT91C_EBI_CS0	 ((char *) 	0x60000000) // EBI Chip Select 0 base address
#define AT91C_EBI_CS0_SIZE	 ((unsigned int) 0x01000000) // EBI Chip Select 0 size in byte (16384 Kbytes)
// EBI_SM0
#define AT91C_EBI_SM0	 ((char *) 	0x60000000) // NANDFLASH on EBI Chip Select 0 base address
#define AT91C_EBI_SM0_SIZE	 ((unsigned int) 0x01000000) // NANDFLASH on EBI Chip Select 0 size in byte (16384 Kbytes)
// EBI_CS1
#define AT91C_EBI_CS1	 ((char *) 	0x61000000) // EBI Chip Select 1 base address
#define AT91C_EBI_CS1_SIZE	 ((unsigned int) 0x01000000) // EBI Chip Select 1 size in byte (16384 Kbytes)
// EBI_SM1
#define AT91C_EBI_SM1	 ((char *) 	0x61000000) // NANDFLASH on EBI Chip Select 1 base address
#define AT91C_EBI_SM1_SIZE	 ((unsigned int) 0x01000000) // NANDFLASH on EBI Chip Select 1 size in byte (16384 Kbytes)
// EBI_CS2
#define AT91C_EBI_CS2	 ((char *) 	0x62000000) // EBI Chip Select 2 base address
#define AT91C_EBI_CS2_SIZE	 ((unsigned int) 0x01000000) // EBI Chip Select 2 size in byte (16384 Kbytes)
// EBI_SM2
#define AT91C_EBI_SM2	 ((char *) 	0x62000000) // NANDFLASH on EBI Chip Select 2 base address
#define AT91C_EBI_SM2_SIZE	 ((unsigned int) 0x01000000) // NANDFLASH on EBI Chip Select 2 size in byte (16384 Kbytes)
// EBI_CS3
#define AT91C_EBI_CS3	 ((char *) 	0x63000000) // EBI Chip Select 3 base address
#define AT91C_EBI_CS3_SIZE	 ((unsigned int) 0x01000000) // EBI Chip Select 3 size in byte (16384 Kbytes)
// EBI_SM3
#define AT91C_EBI_SM3	 ((char *) 	0x63000000) // NANDFLASH on EBI Chip Select 3 base address
#define AT91C_EBI_SM3_SIZE	 ((unsigned int) 0x01000000) // NANDFLASH on EBI Chip Select 3 size in byte (16384 Kbytes)
// EBI_CS4
#define AT91C_EBI_CS4	 ((char *) 	0x64000000) // EBI Chip Select 4 base address
#define AT91C_EBI_CS4_SIZE	 ((unsigned int) 0x10000000) // EBI Chip Select 4 size in byte (262144 Kbytes)
// EBI_CF0
#define AT91C_EBI_CF0	 ((char *) 	0x64000000) // CompactFlash 0 on EBI Chip Select 4 base address
#define AT91C_EBI_CF0_SIZE	 ((unsigned int) 0x10000000) // CompactFlash 0 on EBI Chip Select 4 size in byte (262144 Kbytes)
// EBI_CS5
#define AT91C_EBI_CS5	 ((char *) 	0x65000000) // EBI Chip Select 5 base address
#define AT91C_EBI_CS5_SIZE	 ((unsigned int) 0x10000000) // EBI Chip Select 5 size in byte (262144 Kbytes)
// EBI_CF1
#define AT91C_EBI_CF1	 ((char *) 	0x65000000) // CompactFlash 1 on EBIChip Select 5 base address
#define AT91C_EBI_CF1_SIZE	 ((unsigned int) 0x10000000) // CompactFlash 1 on EBIChip Select 5 size in byte (262144 Kbytes)
// EBI_SDRAM
#define AT91C_EBI_SDRAM	 ((char *) 	0x66000000) // SDRAM on EBI Chip Select 1 base address
#define AT91C_EBI_SDRAM_SIZE	 ((unsigned int) 0x10000000) // SDRAM on EBI Chip Select 1 size in byte (262144 Kbytes)
// EBI_SDRAM_16BIT
#define AT91C_EBI_SDRAM_16BIT	 ((char *) 	0x67000000) // SDRAM on EBI Chip Select 1 base address
#define AT91C_EBI_SDRAM_16BIT_SIZE	 ((unsigned int) 0x02000000) // SDRAM on EBI Chip Select 1 size in byte (32768 Kbytes)
// EBI_SDRAM_32BIT
#define AT91C_EBI_SDRAM_32BIT	 ((char *) 	0x68000000) // SDRAM on EBI Chip Select 1 base address
#define AT91C_EBI_SDRAM_32BIT_SIZE	 ((unsigned int) 0x04000000) // SDRAM on EBI Chip Select 1 size in byte (65536 Kbytes)
#endif /* __IAR_SYSTEMS_ICC__ */

#ifdef __IAR_SYSTEMS_ASM__

// - Hardware register definition

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR System Peripherals
// - *****************************************************************************
// - -------- GPBR : (SYS Offset: 0x1490) GPBR General Purpose Register -------- 
AT91C_GPBR_GPRV           EQU (0x0 <<  0) ;- (SYS) General Purpose Register Value

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Static Memory Controller Interface
// - *****************************************************************************
// - -------- SMC_SETUP : (SMC Offset: 0x0) Setup Register for CS x -------- 
AT91C_SMC_NWESETUP        EQU (0x3F <<  0) ;- (SMC) NWE Setup Length
AT91C_SMC_NCSSETUPWR      EQU (0x3F <<  8) ;- (SMC) NCS Setup Length in WRite Access
AT91C_SMC_NRDSETUP        EQU (0x3F << 16) ;- (SMC) NRD Setup Length
AT91C_SMC_NCSSETUPRD      EQU (0x3F << 24) ;- (SMC) NCS Setup Length in ReaD Access
// - -------- SMC_PULSE : (SMC Offset: 0x4) Pulse Register for CS x -------- 
AT91C_SMC_NWEPULSE        EQU (0x7F <<  0) ;- (SMC) NWE Pulse Length
AT91C_SMC_NCSPULSEWR      EQU (0x7F <<  8) ;- (SMC) NCS Pulse Length in WRite Access
AT91C_SMC_NRDPULSE        EQU (0x7F << 16) ;- (SMC) NRD Pulse Length
AT91C_SMC_NCSPULSERD      EQU (0x7F << 24) ;- (SMC) NCS Pulse Length in ReaD Access
// - -------- SMC_CYC : (SMC Offset: 0x8) Cycle Register for CS x -------- 
AT91C_SMC_NWECYCLE        EQU (0x1FF <<  0) ;- (SMC) Total Write Cycle Length
AT91C_SMC_NRDCYCLE        EQU (0x1FF << 16) ;- (SMC) Total Read Cycle Length
// - -------- SMC_CTRL : (SMC Offset: 0xc) Control Register for CS x -------- 
AT91C_SMC_READMODE        EQU (0x1 <<  0) ;- (SMC) Read Mode
AT91C_SMC_WRITEMODE       EQU (0x1 <<  1) ;- (SMC) Write Mode
AT91C_SMC_NWAITM          EQU (0x3 <<  5) ;- (SMC) NWAIT Mode
AT91C_SMC_NWAITM_NWAIT_DISABLE EQU (0x0 <<  5) ;- (SMC) External NWAIT disabled.
AT91C_SMC_NWAITM_NWAIT_ENABLE_FROZEN EQU (0x2 <<  5) ;- (SMC) External NWAIT enabled in frozen mode.
AT91C_SMC_NWAITM_NWAIT_ENABLE_READY EQU (0x3 <<  5) ;- (SMC) External NWAIT enabled in ready mode.
AT91C_SMC_BAT             EQU (0x1 <<  8) ;- (SMC) Byte Access Type
AT91C_SMC_BAT_BYTE_SELECT EQU (0x0 <<  8) ;- (SMC) Write controled by ncs, nbs0, nbs1, nbs2, nbs3. Read controled by ncs, nrd, nbs0, nbs1, nbs2, nbs3.
AT91C_SMC_BAT_BYTE_WRITE  EQU (0x1 <<  8) ;- (SMC) Write controled by ncs, nwe0, nwe1, nwe2, nwe3. Read controled by ncs and nrd.
AT91C_SMC_DBW             EQU (0x3 << 12) ;- (SMC) Data Bus Width
AT91C_SMC_DBW_WIDTH_EIGTH_BITS EQU (0x0 << 12) ;- (SMC) 8 bits.
AT91C_SMC_DBW_WIDTH_SIXTEEN_BITS EQU (0x1 << 12) ;- (SMC) 16 bits.
AT91C_SMC_DBW_WIDTH_THIRTY_TWO_BITS EQU (0x2 << 12) ;- (SMC) 32 bits.
AT91C_SMC_TDF             EQU (0xF << 16) ;- (SMC) Data Float Time.
AT91C_SMC_TDFEN           EQU (0x1 << 20) ;- (SMC) TDF Enabled.
AT91C_SMC_PMEN            EQU (0x1 << 24) ;- (SMC) Page Mode Enabled.
AT91C_SMC_PS              EQU (0x3 << 28) ;- (SMC) Page Size
AT91C_SMC_PS_SIZE_FOUR_BYTES EQU (0x0 << 28) ;- (SMC) 4 bytes.
AT91C_SMC_PS_SIZE_EIGHT_BYTES EQU (0x1 << 28) ;- (SMC) 8 bytes.
AT91C_SMC_PS_SIZE_SIXTEEN_BYTES EQU (0x2 << 28) ;- (SMC) 16 bytes.
AT91C_SMC_PS_SIZE_THIRTY_TWO_BYTES EQU (0x3 << 28) ;- (SMC) 32 bytes.
// - -------- SMC_SETUP : (SMC Offset: 0x10) Setup Register for CS x -------- 
// - -------- SMC_PULSE : (SMC Offset: 0x14) Pulse Register for CS x -------- 
// - -------- SMC_CYC : (SMC Offset: 0x18) Cycle Register for CS x -------- 
// - -------- SMC_CTRL : (SMC Offset: 0x1c) Control Register for CS x -------- 
// - -------- SMC_SETUP : (SMC Offset: 0x20) Setup Register for CS x -------- 
// - -------- SMC_PULSE : (SMC Offset: 0x24) Pulse Register for CS x -------- 
// - -------- SMC_CYC : (SMC Offset: 0x28) Cycle Register for CS x -------- 
// - -------- SMC_CTRL : (SMC Offset: 0x2c) Control Register for CS x -------- 
// - -------- SMC_SETUP : (SMC Offset: 0x30) Setup Register for CS x -------- 
// - -------- SMC_PULSE : (SMC Offset: 0x34) Pulse Register for CS x -------- 
// - -------- SMC_CYC : (SMC Offset: 0x38) Cycle Register for CS x -------- 
// - -------- SMC_CTRL : (SMC Offset: 0x3c) Control Register for CS x -------- 
// - -------- SMC_SETUP : (SMC Offset: 0x40) Setup Register for CS x -------- 
// - -------- SMC_PULSE : (SMC Offset: 0x44) Pulse Register for CS x -------- 
// - -------- SMC_CYC : (SMC Offset: 0x48) Cycle Register for CS x -------- 
// - -------- SMC_CTRL : (SMC Offset: 0x4c) Control Register for CS x -------- 
// - -------- SMC_SETUP : (SMC Offset: 0x50) Setup Register for CS x -------- 
// - -------- SMC_PULSE : (SMC Offset: 0x54) Pulse Register for CS x -------- 
// - -------- SMC_CYC : (SMC Offset: 0x58) Cycle Register for CS x -------- 
// - -------- SMC_CTRL : (SMC Offset: 0x5c) Control Register for CS x -------- 
// - -------- SMC_SETUP : (SMC Offset: 0x60) Setup Register for CS x -------- 
// - -------- SMC_PULSE : (SMC Offset: 0x64) Pulse Register for CS x -------- 
// - -------- SMC_CYC : (SMC Offset: 0x68) Cycle Register for CS x -------- 
// - -------- SMC_CTRL : (SMC Offset: 0x6c) Control Register for CS x -------- 
// - -------- SMC_SETUP : (SMC Offset: 0x70) Setup Register for CS x -------- 
// - -------- SMC_PULSE : (SMC Offset: 0x74) Pulse Register for CS x -------- 
// - -------- SMC_CYC : (SMC Offset: 0x78) Cycle Register for CS x -------- 
// - -------- SMC_CTRL : (SMC Offset: 0x7c) Control Register for CS x -------- 

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR AHB Matrix2 Interface
// - *****************************************************************************
// - -------- MATRIX_MCFG0 : (HMATRIX2 Offset: 0x0) Master Configuration Register ARM bus I and D -------- 
AT91C_MATRIX_ULBT         EQU (0x7 <<  0) ;- (HMATRIX2) Undefined Length Burst Type
AT91C_MATRIX_ULBT_INFINIT_LENGTH EQU (0x0) ;- (HMATRIX2) infinite length burst
AT91C_MATRIX_ULBT_SINGLE_ACCESS EQU (0x1) ;- (HMATRIX2) Single Access
AT91C_MATRIX_ULBT_4_BEAT  EQU (0x2) ;- (HMATRIX2) 4 Beat Burst
AT91C_MATRIX_ULBT_8_BEAT  EQU (0x3) ;- (HMATRIX2) 8 Beat Burst
AT91C_MATRIX_ULBT_16_BEAT EQU (0x4) ;- (HMATRIX2) 16 Beat Burst
AT91C_MATRIX_ULBT_32_BEAT EQU (0x5) ;- (HMATRIX2) 32 Beat Burst
AT91C_MATRIX_ULBT_64_BEAT EQU (0x6) ;- (HMATRIX2) 64 Beat Burst
AT91C_MATRIX_ULBT_128_BEAT EQU (0x7) ;- (HMATRIX2) 128 Beat Burst
// - -------- MATRIX_MCFG1 : (HMATRIX2 Offset: 0x4) Master Configuration Register ARM bus S -------- 
// - -------- MATRIX_MCFG2 : (HMATRIX2 Offset: 0x8) Master Configuration Register -------- 
// - -------- MATRIX_MCFG3 : (HMATRIX2 Offset: 0xc) Master Configuration Register -------- 
// - -------- MATRIX_MCFG4 : (HMATRIX2 Offset: 0x10) Master Configuration Register -------- 
// - -------- MATRIX_MCFG5 : (HMATRIX2 Offset: 0x14) Master Configuration Register -------- 
// - -------- MATRIX_MCFG6 : (HMATRIX2 Offset: 0x18) Master Configuration Register -------- 
// - -------- MATRIX_MCFG7 : (HMATRIX2 Offset: 0x1c) Master Configuration Register -------- 
// - -------- MATRIX_SCFG0 : (HMATRIX2 Offset: 0x40) Slave Configuration Register 0 -------- 
AT91C_MATRIX_SLOT_CYCLE   EQU (0xFF <<  0) ;- (HMATRIX2) Maximum Number of Allowed Cycles for a Burst
AT91C_MATRIX_DEFMSTR_TYPE EQU (0x3 << 16) ;- (HMATRIX2) Default Master Type
AT91C_MATRIX_DEFMSTR_TYPE_NO_DEFMSTR EQU (0x0 << 16) ;- (HMATRIX2) No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This results in having a one cycle latency for the first transfer of a burst.
AT91C_MATRIX_DEFMSTR_TYPE_LAST_DEFMSTR EQU (0x1 << 16) ;- (HMATRIX2) Last Default Master. At the end of current slave access, if no other master request is pending, the slave stay connected with the last master having accessed it. This results in not having the one cycle latency when the last master re-trying access on the slave.
AT91C_MATRIX_DEFMSTR_TYPE_FIXED_DEFMSTR EQU (0x2 << 16) ;- (HMATRIX2) Fixed Default Master. At the end of current slave access, if no other master request is pending, the slave connects with fixed which number is in FIXED_DEFMSTR field. This results in not having the one cycle latency when the fixed master re-trying access on the slave.
AT91C_MATRIX_FIXED_DEFMSTR_SCFG0 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG0_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG1 : (HMATRIX2 Offset: 0x44) Slave Configuration Register 1 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG1 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG1_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG2 : (HMATRIX2 Offset: 0x48) Slave Configuration Register 2 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG2 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG2_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG3 : (HMATRIX2 Offset: 0x4c) Slave Configuration Register 3 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG3 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG3_ARMC EQU (0x0 << 18) ;- (HMATRIX2) ARMC is Default Master
// - -------- MATRIX_SCFG4 : (HMATRIX2 Offset: 0x50) Slave Configuration Register 4 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG4 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG4_ARMC EQU (0x0 << 18) ;- (HMATRIX2) ARMC is Default Master
// - -------- MATRIX_SCFG5 : (HMATRIX2 Offset: 0x54) Slave Configuration Register 5 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG5 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG5_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG6 : (HMATRIX2 Offset: 0x58) Slave Configuration Register 6 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG6 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG6_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG7 : (HMATRIX2 Offset: 0x5c) Slave Configuration Register 7 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG7 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG7_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
// - -------- MATRIX_SCFG8 : (HMATRIX2 Offset: 0x60) Slave Configuration Register 8 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG8 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG8_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG8_HDMA EQU (0x4 << 18) ;- (HMATRIX2) HDMA is Default Master
// - -------- MATRIX_SCFG9 : (HMATRIX2 Offset: 0x64) Slave Configuration Register 9 -------- 
AT91C_MATRIX_FIXED_DEFMSTR_SCFG9 EQU (0x7 << 18) ;- (HMATRIX2) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG9_ARMS EQU (0x1 << 18) ;- (HMATRIX2) ARMS is Default Master
AT91C_MATRIX_FIXED_DEFMSTR_SCFG9_HDMA EQU (0x4 << 18) ;- (HMATRIX2) HDMA is Default Master
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x110) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x114) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x118) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x11c) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x120) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x124) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x128) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x12c) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x130) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x134) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x138) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x13c) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x140) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x144) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x148) Special Function Register 0 -------- 
// - -------- MATRIX_SFR0 : (HMATRIX2 Offset: 0x14c) Special Function Register 0 -------- 
// - -------- HMATRIX2_VER : (HMATRIX2 Offset: 0x1fc)  VERSION  Register -------- 
AT91C_HMATRIX2_VER        EQU (0xF <<  0) ;- (HMATRIX2)  VERSION  Register

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR AHB CCFG Interface
// - *****************************************************************************
// - -------- CCFG_RAM0 : (CCFG Offset: 0x0) RAM0 Configuration -------- 
// - -------- CCFG_ROM : (CCFG Offset: 0x4) ROM configuration -------- 
// - -------- CCFG_FLASH0 : (CCFG Offset: 0x8) FLASH0 configuration -------- 
// - -------- CCFG_EBICSA : (CCFG Offset: 0xc) EBI Chip Select Assignement Register -------- 
AT91C_EBI_CS0A            EQU (0x1 <<  0) ;- (CCFG) Chip Select 0 Assignment
AT91C_EBI_CS0A_SMC        EQU (0x0) ;- (CCFG) Chip Select 0 is only assigned to the Static Memory Controller and NCS0 behaves as defined by the SMC.
AT91C_EBI_CS0A_SM         EQU (0x1) ;- (CCFG) Chip Select 0 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.
AT91C_EBI_CS1A            EQU (0x1 <<  1) ;- (CCFG) Chip Select 1 Assignment
AT91C_EBI_CS1A_SMC        EQU (0x0 <<  1) ;- (CCFG) Chip Select 1 is only assigned to the Static Memory Controller and NCS1 behaves as defined by the SMC.
AT91C_EBI_CS1A_SM         EQU (0x1 <<  1) ;- (CCFG) Chip Select 1 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.
AT91C_EBI_CS2A            EQU (0x1 <<  2) ;- (CCFG) Chip Select 2 Assignment
AT91C_EBI_CS2A_SMC        EQU (0x0 <<  2) ;- (CCFG) Chip Select 2 is only assigned to the Static Memory Controller and NCS2 behaves as defined by the SMC.
AT91C_EBI_CS2A_SM         EQU (0x1 <<  2) ;- (CCFG) Chip Select 2 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.
AT91C_EBI_CS3A            EQU (0x1 <<  3) ;- (CCFG) Chip Select 3 Assignment
AT91C_EBI_CS3A_SMC        EQU (0x0 <<  3) ;- (CCFG) Chip Select 3 is only assigned to the Static Memory Controller and NCS3 behaves as defined by the SMC.
AT91C_EBI_CS3A_SM         EQU (0x1 <<  3) ;- (CCFG) Chip Select 3 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.
// - -------- CCFG_BRIDGE : (CCFG Offset: 0x10) BRIDGE configuration -------- 

