una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s1.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Power Management Controler
// - *****************************************************************************
// - -------- PMC_SCER : (PMC Offset: 0x0) System Clock Enable Register -------- 
AT91C_PMC_PCK             EQU (0x1 <<  0) ;- (PMC) Processor Clock
AT91C_PMC_UDP             EQU (0x1 <<  7) ;- (PMC) USB Device Port Clock
AT91C_PMC_PCK0            EQU (0x1 <<  8) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK1            EQU (0x1 <<  9) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK2            EQU (0x1 << 10) ;- (PMC) Programmable Clock Output
// - -------- PMC_SCDR : (PMC Offset: 0x4) System Clock Disable Register -------- 
// - -------- PMC_SCSR : (PMC Offset: 0x8) System Clock Status Register -------- 
// - -------- CKGR_UCKR : (PMC Offset: 0x1c) UTMI Clock Configuration Register -------- 
AT91C_CKGR_UPLLEN         EQU (0x1 << 16) ;- (PMC) UTMI PLL Enable
AT91C_CKGR_UPLLEN_DISABLED EQU (0x0 << 16) ;- (PMC) The UTMI PLL is disabled
AT91C_CKGR_UPLLEN_ENABLED EQU (0x1 << 16) ;- (PMC) The UTMI PLL is enabled
AT91C_CKGR_UPLLCOUNT      EQU (0xF << 20) ;- (PMC) UTMI Oscillator Start-up Time
AT91C_CKGR_BIASEN         EQU (0x1 << 24) ;- (PMC) UTMI BIAS Enable
AT91C_CKGR_BIASEN_DISABLED EQU (0x0 << 24) ;- (PMC) The UTMI BIAS is disabled
AT91C_CKGR_BIASEN_ENABLED EQU (0x1 << 24) ;- (PMC) The UTMI BIAS is enabled
AT91C_CKGR_BIASCOUNT      EQU (0xF << 28) ;- (PMC) UTMI BIAS Start-up Time
// - -------- CKGR_MOR : (PMC Offset: 0x20) Main Oscillator Register -------- 
AT91C_CKGR_MOSCXTEN       EQU (0x1 <<  0) ;- (PMC) Main Crystal Oscillator Enable
AT91C_CKGR_MOSCXTBY       EQU (0x1 <<  1) ;- (PMC) Main Crystal Oscillator Bypass
AT91C_CKGR_WAITMODE       EQU (0x1 <<  2) ;- (PMC) Main Crystal Oscillator Bypass
AT91C_CKGR_MOSCRCEN       EQU (0x1 <<  3) ;- (PMC) Main On-Chip RC Oscillator Enable
AT91C_CKGR_MOSCRCF        EQU (0x7 <<  4) ;- (PMC) Main On-Chip RC Oscillator Frequency Selection
AT91C_CKGR_MOSCXTST       EQU (0xFF <<  8) ;- (PMC) Main Crystal Oscillator Start-up Time
AT91C_CKGR_KEY            EQU (0xFF << 16) ;- (PMC) Clock Generator Controller Writing Protection Key
AT91C_CKGR_MOSCSEL        EQU (0x1 << 24) ;- (PMC) Main Oscillator Selection
AT91C_CKGR_CFDEN          EQU (0x1 << 25) ;- (PMC) Clock Failure Detector Enable
// - -------- CKGR_MCFR : (PMC Offset: 0x24) Main Clock Frequency Register -------- 
AT91C_CKGR_MAINF          EQU (0xFFFF <<  0) ;- (PMC) Main Clock Frequency
AT91C_CKGR_MAINRDY        EQU (0x1 << 16) ;- (PMC) Main Clock Ready
// - -------- CKGR_PLLAR : (PMC Offset: 0x28) PLL A Register -------- 
AT91C_CKGR_DIVA           EQU (0xFF <<  0) ;- (PMC) Divider Selected
AT91C_CKGR_DIVA_0         EQU (0x0) ;- (PMC) Divider output is 0
AT91C_CKGR_DIVA_BYPASS    EQU (0x1) ;- (PMC) Divider is bypassed
AT91C_CKGR_PLLACOUNT      EQU (0x3F <<  8) ;- (PMC) PLLA Counter
AT91C_CKGR_STMODE         EQU (0x3 << 14) ;- (PMC) Start Mode
AT91C_CKGR_STMODE_0       EQU (0x0 << 14) ;- (PMC) Fast startup
AT91C_CKGR_STMODE_1       EQU (0x1 << 14) ;- (PMC) Reserved
AT91C_CKGR_STMODE_2       EQU (0x2 << 14) ;- (PMC) Normal startup
AT91C_CKGR_STMODE_3       EQU (0x3 << 14) ;- (PMC) Reserved
AT91C_CKGR_MULA           EQU (0x7FF << 16) ;- (PMC) PLL Multiplier
AT91C_CKGR_SRC            EQU (0x1 << 29) ;- (PMC) 
// - -------- CKGR_PLLBR : (PMC Offset: 0x2c) PLL B Register -------- 
AT91C_CKGR_DIVB           EQU (0xFF <<  0) ;- (PMC) Divider B Selected
AT91C_CKGR_DIVB_0         EQU (0x0) ;- (PMC) Divider B output is 0
AT91C_CKGR_DIVB_BYPASS    EQU (0x1) ;- (PMC) Divider B is bypassed
AT91C_CKGR_PLLBCOUNT      EQU (0x3F <<  8) ;- (PMC) PLL B Counter
AT91C_CKGR_OUTB           EQU (0x3 << 14) ;- (PMC) PLL B Output Frequency Range
AT91C_CKGR_OUTB_0         EQU (0x0 << 14) ;- (PMC) Please refer to the PLLB datasheet
AT91C_CKGR_OUTB_1         EQU (0x1 << 14) ;- (PMC) Please refer to the PLLB datasheet
AT91C_CKGR_OUTB_2         EQU (0x2 << 14) ;- (PMC) Please refer to the PLLB datasheet
AT91C_CKGR_OUTB_3         EQU (0x3 << 14) ;- (PMC) Please refer to the PLLB datasheet
AT91C_CKGR_MULB           EQU (0x7FF << 16) ;- (PMC) PLL B Multiplier
// - -------- PMC_MCKR : (PMC Offset: 0x30) Master Clock Register -------- 
AT91C_PMC_CSS             EQU (0x7 <<  0) ;- (PMC) Programmable Clock Selection
AT91C_PMC_CSS_SLOW_CLK    EQU (0x0) ;- (PMC) Slow Clock is selected
AT91C_PMC_CSS_MAIN_CLK    EQU (0x1) ;- (PMC) Main Clock is selected
AT91C_PMC_CSS_PLLA_CLK    EQU (0x2) ;- (PMC) Clock from PLL A is selected
AT91C_PMC_CSS_PLLB_CLK    EQU (0x3) ;- (PMC) Clock from PLL B is selected
AT91C_PMC_CSS_SYS_CLK     EQU (0x4) ;- (PMC) System clock is selected
AT91C_PMC_PRES            EQU (0xF <<  4) ;- (PMC) Programmable Clock Prescaler
AT91C_PMC_PRES_CLK        EQU (0x0 <<  4) ;- (PMC) Selected clock
AT91C_PMC_PRES_CLK_2      EQU (0x1 <<  4) ;- (PMC) Selected clock divided by 2
AT91C_PMC_PRES_CLK_4      EQU (0x2 <<  4) ;- (PMC) Selected clock divided by 4
AT91C_PMC_PRES_CLK_8      EQU (0x3 <<  4) ;- (PMC) Selected clock divided by 8
AT91C_PMC_PRES_CLK_16     EQU (0x4 <<  4) ;- (PMC) Selected clock divided by 16
AT91C_PMC_PRES_CLK_32     EQU (0x5 <<  4) ;- (PMC) Selected clock divided by 32
AT91C_PMC_PRES_CLK_64     EQU (0x6 <<  4) ;- (PMC) Selected clock divided by 64
AT91C_PMC_PRES_CLK_3      EQU (0x7 <<  4) ;- (PMC) Selected clock divided by 3
AT91C_PMC_PRES_CLK_1_5    EQU (0x8 <<  4) ;- (PMC) Selected clock divided by 1.5
// - -------- PMC_UDPR : (PMC Offset: 0x38) USB DEV Clock Configuration Register -------- 
AT91C_PMC_UDP_CLK_SEL     EQU (0x1 <<  0) ;- (PMC) UDP Clock Selection
AT91C_PMC_UDP_CLK_SEL_PLLA EQU (0x0) ;- (PMC) PLL A is the selected clock source for UDP DEV
AT91C_PMC_UDP_CLK_SEL_PLLB EQU (0x1) ;- (PMC) PLL B is the selected clock source for UDP DEV
AT91C_PMC_UDP_DIV         EQU (0xF <<  8) ;- (PMC) UDP Clock Divider
AT91C_PMC_UDP_DIV_DIV     EQU (0x0 <<  8) ;- (PMC) Selected clock
AT91C_PMC_UDP_DIV_DIV_2   EQU (0x1 <<  8) ;- (PMC) Selected clock divided by 2
// - -------- PMC_PCKR : (PMC Offset: 0x40) Programmable Clock Register -------- 
// - -------- PMC_IER : (PMC Offset: 0x60) PMC Interrupt Enable Register -------- 
AT91C_PMC_MOSCXTS         EQU (0x1 <<  0) ;- (PMC) Main Crystal Oscillator Status/Enable/Disable/Mask
AT91C_PMC_LOCKA           EQU (0x1 <<  1) ;- (PMC) PLL A Status/Enable/Disable/Mask
AT91C_PMC_LOCKB           EQU (0x1 <<  2) ;- (PMC) PLL B Status/Enable/Disable/Mask
AT91C_PMC_MCKRDY          EQU (0x1 <<  3) ;- (PMC) Master Clock Status/Enable/Disable/Mask
AT91C_PMC_LOCKU           EQU (0x1 <<  6) ;- (PMC) PLL UTMI Status/Enable/Disable/Mask
AT91C_PMC_PCKRDY0         EQU (0x1 <<  8) ;- (PMC) PCK0_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCKRDY1         EQU (0x1 <<  9) ;- (PMC) PCK1_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCKRDY2         EQU (0x1 << 10) ;- (PMC) PCK2_RDY Status/Enable/Disable/Mask
AT91C_PMC_MOSCSELS        EQU (0x1 << 16) ;- (PMC) Main Oscillator Selection Status
AT91C_PMC_MOSCRCS         EQU (0x1 << 17) ;- (PMC) Main On-Chip RC Oscillator Status
AT91C_PMC_CFDEV           EQU (0x1 << 18) ;- (PMC) Clock Failure Detector Event
// - -------- PMC_IDR : (PMC Offset: 0x64) PMC Interrupt Disable Register -------- 
// - -------- PMC_SR : (PMC Offset: 0x68) PMC Status Register -------- 
AT91C_                    EQU (0x0 <<  7) ;- (PMC) 
AT91C_PMC_CFDS            EQU (0x1 << 19) ;- (PMC) Clock Failure Detector Status
AT91C_PMC_FOS             EQU (0x1 << 20) ;- (PMC) Clock Failure Detector Fault Output Status
// - -------- PMC_IMR : (PMC Offset: 0x6c) PMC Interrupt Mask Register -------- 
// - -------- PMC_FSMR : (PMC Offset: 0x70) Fast Startup Mode Register -------- 
AT91C_PMC_FSTT            EQU (0xFFFF <<  0) ;- (PMC) Fast Start-up Input Enable 0 to 15
AT91C_PMC_RTTAL           EQU (0x1 << 16) ;- (PMC) RTT Alarm Enable
AT91C_PMC_RTCAL           EQU (0x1 << 17) ;- (PMC) RTC Alarm Enable
AT91C_PMC_USBAL           EQU (0x1 << 18) ;- (PMC) USB Alarm Enable
AT91C_PMC_LPM             EQU (0x1 << 20) ;- (PMC) Low Power Mode
// - -------- PMC_FSPR : (PMC Offset: 0x74) Fast Startup Polarity Register -------- 
AT91C_PMC_FSTP            EQU (0xFFFF <<  0) ;- (PMC) Fast Start-up Input Polarity 0 to 15
// - -------- PMC_FOCR : (PMC Offset: 0x78) Fault Output Clear Register -------- 
AT91C_PMC_FOCLR           EQU (0x1 <<  0) ;- (PMC) Fault Output Clear
// - -------- PMC_PCR : (PMC Offset: 0x10c) Peripheral Control Register -------- 
AT91C_PMC_PID             EQU (0x3F <<  0) ;- (PMC) Peripheral Identifier
AT91C_PMC_CMD             EQU (0x1 << 12) ;- (PMC) Read / Write Command
AT91C_PMC_DIV             EQU (0x3 << 16) ;- (PMC) Peripheral clock Divider
AT91C_PMC_EN              EQU (0x1 << 28) ;- (PMC) Peripheral Clock Enable

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Clock Generator Controler
// - *****************************************************************************
// - -------- CKGR_UCKR : (CKGR Offset: 0x0) UTMI Clock Configuration Register -------- 
// - -------- CKGR_MOR : (CKGR Offset: 0x4) Main Oscillator Register -------- 
// - -------- CKGR_MCFR : (CKGR Offset: 0x8) Main Clock Frequency Register -------- 
// - -------- CKGR_PLLAR : (CKGR Offset: 0xc) PLL A Register -------- 
// - -------- CKGR_PLLBR : (CKGR Offset: 0x10) PLL B Register -------- 

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Reset Controller Interface
// - *****************************************************************************
// - -------- RSTC_RCR : (RSTC Offset: 0x0) Reset Control Register -------- 
AT91C_RSTC_PROCRST        EQU (0x1 <<  0) ;- (RSTC) Processor Reset
AT91C_RSTC_ICERST         EQU (0x1 <<  1) ;- (RSTC) ICE Interface Reset
AT91C_RSTC_PERRST         EQU (0x1 <<  2) ;- (RSTC) Peripheral Reset
AT91C_RSTC_EXTRST         EQU (0x1 <<  3) ;- (RSTC) External Reset
AT91C_RSTC_KEY            EQU (0xFF << 24) ;- (RSTC) Password
// - -------- RSTC_RSR : (RSTC Offset: 0x4) Reset Status Register -------- 
AT91C_RSTC_URSTS          EQU (0x1 <<  0) ;- (RSTC) User Reset Status
AT91C_RSTC_RSTTYP         EQU (0x7 <<  8) ;- (RSTC) Reset Type
AT91C_RSTC_RSTTYP_GENERAL EQU (0x0 <<  8) ;- (RSTC) General reset. Both VDDCORE and VDDBU rising.
AT91C_RSTC_RSTTYP_WAKEUP  EQU (0x1 <<  8) ;- (RSTC) WakeUp Reset. VDDCORE rising.
AT91C_RSTC_RSTTYP_WATCHDOG EQU (0x2 <<  8) ;- (RSTC) Watchdog Reset. Watchdog overflow occured.
AT91C_RSTC_RSTTYP_SOFTWARE EQU (0x3 <<  8) ;- (RSTC) Software Reset. Processor reset required by the software.
AT91C_RSTC_RSTTYP_USER    EQU (0x4 <<  8) ;- (RSTC) User Reset. NRST pin detected low.
AT91C_RSTC_NRSTL          EQU (0x1 << 16) ;- (RSTC) NRST pin level
AT91C_RSTC_SRCMP          EQU (0x1 << 17) ;- (RSTC) Software Reset Command in Progress.
// - -------- RSTC_RMR : (RSTC Offset: 0x8) Reset Mode Register -------- 
AT91C_RSTC_URSTEN         EQU (0x1 <<  0) ;- (RSTC) User Reset Enable
AT91C_RSTC_URSTIEN        EQU (0x1 <<  4) ;- (RSTC) User Reset Interrupt Enable
AT91C_RSTC_ERSTL          EQU (0xF <<  8) ;- (RSTC) User Reset Enable

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Supply Controller Interface
// - *****************************************************************************
// - -------- SUPC_CR : (SUPC Offset: 0x0) Control Register -------- 
AT91C_SUPC_SHDW           EQU (0x1 <<  0) ;- (SUPC) Shut Down Command
AT91C_SUPC_SHDWEOF        EQU (0x1 <<  1) ;- (SUPC) Shut Down after End Of Frame
AT91C_SUPC_VROFF          EQU (0x1 <<  2) ;- (SUPC) Voltage Regulator Off
AT91C_SUPC_XTALSEL        EQU (0x1 <<  3) ;- (SUPC) Crystal Oscillator Select
AT91C_SUPC_KEY            EQU (0xFF << 24) ;- (SUPC) Supply Controller Writing Protection Key
// - -------- SUPC_BOMR : (SUPC Offset: 0x4) Brown Out Mode Register -------- 
AT91C_SUPC_BODTH          EQU (0xF <<  0) ;- (SUPC) Brown Out Threshold
AT91C_SUPC_BODSMPL        EQU (0x7 <<  8) ;- (SUPC) Brown Out Sampling Period
AT91C_SUPC_BODSMPL_DISABLED EQU (0x0 <<  8) ;- (SUPC) Brown Out Detector disabled
AT91C_SUPC_BODSMPL_CONTINUOUS EQU (0x1 <<  8) ;- (SUPC) Continuous Brown Out Detector
AT91C_SUPC_BODSMPL_32_SLCK EQU (0x2 <<  8) ;- (SUPC) Brown Out Detector enabled one SLCK period every 32 SLCK periods
AT91C_SUPC_BODSMPL_256_SLCK EQU (0x3 <<  8) ;- (SUPC) Brown Out Detector enabled one SLCK period every 256 SLCK periods
AT91C_SUPC_BODSMPL_2048_SLCK EQU (0x4 <<  8) ;- (SUPC) Brown Out Detector enabled one SLCK period every 2048 SLCK periods
AT91C_SUPC_BODRSTEN       EQU (0x1 << 12) ;- (SUPC) Brownout Reset Enable
// - -------- SUPC_MR : (SUPC Offset: 0x8) Supply Controller Mode Register -------- 
AT91C_SUPC_LCDOUT         EQU (0xF <<  0) ;- (SUPC) LCD Charge Pump Output Voltage Selection
AT91C_SUPC_LCDMODE        EQU (0x3 <<  4) ;- (SUPC) Segment LCD Supply Mode
AT91C_SUPC_LCDMODE_OFF    EQU (0x0 <<  4) ;- (SUPC) The internal and external supply sources are both deselected and the on-chip charge pump is turned off
AT91C_SUPC_LCDMODE_OFF_AFTER_EOF EQU (0x1 <<  4) ;- (SUPC) At the End Of Frame from LCD controller, the internal and external supply sources are both deselected and the on-chip charge pump is turned off
AT91C_SUPC_LCDMODE_EXTERNAL EQU (0x2 <<  4) ;- (SUPC) The external supply source is selected
AT91C_SUPC_LCDMODE_INTERNAL EQU (0x3 <<  4) ;- (SUPC) The internal supply source is selected and the on-chip charge pump is turned on
AT91C_SUPC_VRDEEP         EQU (0x1 <<  8) ;- (SUPC) Voltage Regulator Deep Mode
AT91C_SUPC_VRVDD          EQU (0x7 <<  9) ;- (SUPC) Voltage Regulator Output Voltage Selection
AT91C_SUPC_VRRSTEN        EQU (0x1 << 12) ;- (SUPC) Voltage Regulation Loss Reset Enable
AT91C_SUPC_GPBRON         EQU (0x1 << 16) ;- (SUPC) GPBR ON
AT91C_SUPC_SRAMON         EQU (0x1 << 17) ;- (SUPC) SRAM ON
AT91C_SUPC_RTCON          EQU (0x1 << 18) ;- (SUPC) Real Time Clock Power switch ON
AT91C_SUPC_FLASHON        EQU (0x1 << 19) ;- (SUPC) Flash Power switch On
AT91C_SUPC_BYPASS         EQU (0x1 << 20) ;- (SUPC) 32kHz oscillator bypass
AT91C_SUPC_MKEY           EQU (0xFF << 24) ;- (SUPC) Supply Controller Writing Protection Key
// - -------- SUPC_WUMR : (SUPC Offset: 0xc) Wake Up Mode Register -------- 
AT91C_SUPC_FWUPEN         EQU (0x1 <<  0) ;- (SUPC) Force Wake Up Enable
AT91C_SUPC_BODEN          EQU (0x1 <<  1) ;- (SUPC) Brown Out Wake Up Enable
AT91C_SUPC_RTTEN          EQU (0x1 <<  2) ;- (SUPC) Real Time Timer Wake Up Enable
AT91C_SUPC_RTCEN          EQU (0x1 <<  3) ;- (SUPC) Real Time Clock Wake Up Enable
AT91C_SUPC_FWUPDBC        EQU (0x7 <<  8) ;- (SUPC) Force Wake Up debouncer
AT91C_SUPC_FWUPDBC_IMMEDIATE EQU (0x0 <<  8) ;- (SUPC) Immediate, No debouncing, detected active at least one Slow clock edge
AT91C_SUPC_FWUPDBC_3_SLCK EQU (0x1 <<  8) ;- (SUPC) An enabled Wake Up input shall be low for at least 3 SLCK periods
AT91C_SUPC_FWUPDBC_32_SLCK EQU (0x2 <<  8) ;- (SUPC) An enabled Wake Up input  shall be low for at least 32 SLCK periods
AT91C_SUPC_FWUPDBC_512_SLCK EQU (0x3 <<  8) ;- (SUPC) An enabled Wake Up input  shall be low for at least 512 SLCK periods
AT91C_SUPC_FWUPDBC_4096_SLCK EQU (0x4 <<  8) ;- (SUPC) An enabled Wake Up input  shall be low for at least 4096 SLCK periods
AT91C_SUPC_FWUPDBC_32768_SLCK EQU (0x5 <<  8) ;- (SUPC) An enabled Wake Up input  shall be low for at least 32768 SLCK periods
AT91C_SUPC_WKUPDBC        EQU (0x7 << 12) ;- (SUPC) Force Wake Up debouncer
AT91C_SUPC_WKUPDBC_IMMEDIATE EQU (0x0 << 12) ;- (SUPC) Immediate, No debouncing, detected active at least one Slow clock edge
AT91C_SUPC_WKUPDBC_3_SLCK EQU (0x1 << 12) ;- (SUPC) FWUP shall be low for at least 3 SLCK periods
AT91C_SUPC_WKUPDBC_32_SLCK EQU (0x2 << 12) ;- (SUPC) FWUP shall be low for at least 32 SLCK periods
AT91C_SUPC_WKUPDBC_512_SLCK EQU (0x3 << 12) ;- (SUPC) FWUP shall be low for at least 512 SLCK periods
AT91C_SUPC_WKUPDBC_4096_SLCK EQU (0x4 << 12) ;- (SUPC) FWUP shall be low for at least 4096 SLCK periods
AT91C_SUPC_WKUPDBC_32768_SLCK EQU (0x5 << 12) ;- (SUPC) FWUP shall be low for at least 32768 SLCK periods
// - -------- SUPC_WUIR : (SUPC Offset: 0x10) Wake Up Inputs Register -------- 
AT91C_SUPC_WKUPEN0        EQU (0x1 <<  0) ;- (SUPC) Wake Up Input Enable 0
AT91C_SUPC_WKUPEN1        EQU (0x1 <<  1) ;- (SUPC) Wake Up Input Enable 1
AT91C_SUPC_WKUPEN2        EQU (0x1 <<  2) ;- (SUPC) Wake Up Input Enable 2
AT91C_SUPC_WKUPEN3        EQU (0x1 <<  3) ;- (SUPC) Wake Up Input Enable 3
AT91C_SUPC_WKUPEN4        EQU (0x1 <<  4) ;- (SUPC) Wake Up Input Enable 4
AT91C_SUPC_WKUPEN5        EQU (0x1 <<  5) ;- (SUPC) Wake Up Input Enable 5
AT91C_SUPC_WKUPEN6        EQU (0x1 <<  6) ;- (SUPC) Wake Up Input Enable 6
AT91C_SUPC_WKUPEN7        EQU (0x1 <<  7) ;- (SUPC) Wake Up Input Enable 7
AT91C_SUPC_WKUPEN8        EQU (0x1 <<  8) ;- (SUPC) Wake Up Input Enable 8
AT91C_SUPC_WKUPEN9        EQU (0x1 <<  9) ;- (SUPC) Wake Up Input Enable 9
AT91C_SUPC_WKUPEN10       EQU (0x1 << 10) ;- (SUPC) Wake Up Input Enable 10
AT91C_SUPC_WKUPEN11       EQU (0x1 << 11) ;- (SUPC) Wake Up Input Enable 11
AT91C_SUPC_WKUPEN12       EQU (0x1 << 12) ;- (SUPC) Wake Up Input Enable 12
AT91C_SUPC_WKUPEN13       EQU (0x1 << 13) ;- (SUPC) Wake Up Input Enable 13
AT91C_SUPC_WKUPEN14       EQU (0x1 << 14) ;- (SUPC) Wake Up Input Enable 14
AT91C_SUPC_WKUPEN15       EQU (0x1 << 15) ;- (SUPC) Wake Up Input Enable 15
AT91C_SUPC_WKUPT0         EQU (0x1 << 16) ;- (SUPC) Wake Up Input Transition 0
AT91C_SUPC_WKUPT1         EQU (0x1 << 17) ;- (SUPC) Wake Up Input Transition 1
AT91C_SUPC_WKUPT2         EQU (0x1 << 18) ;- (SUPC) Wake Up Input Transition 2
AT91C_SUPC_WKUPT3         EQU (0x1 << 19) ;- (SUPC) Wake Up Input Transition 3
AT91C_SUPC_WKUPT4         EQU (0x1 << 20) ;- (SUPC) Wake Up Input Transition 4
AT91C_SUPC_WKUPT5         EQU (0x1 << 21) ;- (SUPC) Wake Up Input Transition 5
AT91C_SUPC_WKUPT6         EQU (0x1 << 22) ;- (SUPC) Wake Up Input Transition 6
AT91C_SUPC_WKUPT7         EQU (0x1 << 23) ;- (SUPC) Wake Up Input Transition 7
AT91C_SUPC_WKUPT8         EQU (0x1 << 24) ;- (SUPC) Wake Up Input Transition 8
AT91C_SUPC_WKUPT9         EQU (0x1 << 25) ;- (SUPC) Wake Up Input Transition 9
AT91C_SUPC_WKUPT10        EQU (0x1 << 26) ;- (SUPC) Wake Up Input Transition 10
AT91C_SUPC_WKUPT11        EQU (0x1 << 27) ;- (SUPC) Wake Up Input Transition 11
AT91C_SUPC_WKUPT12        EQU (0x1 << 28) ;- (SUPC) Wake Up Input Transition 12
AT91C_SUPC_WKUPT13        EQU (0x1 << 29) ;- (SUPC) Wake Up Input Transition 13
AT91C_SUPC_WKUPT14        EQU (0x1 << 30) ;- (SUPC) Wake Up Input Transition 14
AT91C_SUPC_WKUPT15        EQU (0x1 << 31) ;- (SUPC) Wake Up Input Transition 15
// - -------- SUPC_SR : (SUPC Offset: 0x14) Status Register -------- 
AT91C_SUPC_FWUPS          EQU (0x1 <<  0) ;- (SUPC) Force Wake Up Status
AT91C_SUPC_WKUPS          EQU (0x1 <<  1) ;- (SUPC) Wake Up Status
AT91C_SUPC_BODWS          EQU (0x1 <<  2) ;- (SUPC) BOD Detection Wake Up Status
AT91C_SUPC_VRRSTS         EQU (0x1 <<  3) ;- (SUPC) Voltage regulation Loss Reset Status
AT91C_SUPC_BODRSTS        EQU (0x1 <<  4) ;- (SUPC) BOD detection Reset Status
AT91C_SUPC_BODS           EQU (0x1 <<  5) ;- (SUPC) BOD Status
AT91C_SUPC_BROWNOUT       EQU (0x1 <<  6) ;- (SUPC) BOD Output Status
AT91C_SUPC_OSCSEL         EQU (0x1 <<  7) ;- (SUPC) 32kHz Oscillator Selection Status
AT91C_SUPC_LCDS           EQU (0x1 <<  8) ;- (SUPC) LCD Status
AT91C_SUPC_GPBRS          EQU (0x1 <<  9) ;- (SUPC) General Purpose Back-up registers Status
AT91C_SUPC_RTS            EQU (0x1 << 10) ;- (SUPC) Clock Status
AT91C_SUPC_FLASHS         EQU (0x1 << 11) ;- (SUPC) FLASH Memory Status
AT91C_SUPC_FWUPIS         EQU (0x1 << 12) ;- (SUPC) WKUP Input Status
AT91C_SUPC_WKUPIS0        EQU (0x1 << 16) ;- (SUPC) WKUP Input 0 Status
AT91C_SUPC_WKUPIS1        EQU (0x1 << 17) ;- (SUPC) WKUP Input 1 Status
AT91C_SUPC_WKUPIS2        EQU (0x1 << 18) ;- (SUPC) WKUP Input 2 Status
AT91C_SUPC_WKUPIS3        EQU (0x1 << 19) ;- (SUPC) WKUP Input 3 Status
AT91C_SUPC_WKUPIS4        EQU (0x1 << 20) ;- (SUPC) WKUP Input 4 Status
AT91C_SUPC_WKUPIS5        EQU (0x1 << 21) ;- (SUPC) WKUP Input 5 Status
AT91C_SUPC_WKUPIS6        EQU (0x1 << 22) ;- (SUPC) WKUP Input 6 Status
AT91C_SUPC_WKUPIS7        EQU (0x1 << 23) ;- (SUPC) WKUP Input 7 Status
AT91C_SUPC_WKUPIS8        EQU (0x1 << 24) ;- (SUPC) WKUP Input 8 Status
AT91C_SUPC_WKUPIS9        EQU (0x1 << 25) ;- (SUPC) WKUP Input 9 Status
AT91C_SUPC_WKUPIS10       EQU (0x1 << 26) ;- (SUPC) WKUP Input 10 Status
AT91C_SUPC_WKUPIS11       EQU (0x1 << 27) ;- (SUPC) WKUP Input 11 Status
AT91C_SUPC_WKUPIS12       EQU (0x1 << 28) ;- (SUPC) WKUP Input 12 Status
AT91C_SUPC_WKUPIS13       EQU (0x1 << 29) ;- (SUPC) WKUP Input 13 Status
AT91C_SUPC_WKUPIS14       EQU (0x1 << 30) ;- (SUPC) WKUP Input 14 Status
AT91C_SUPC_WKUPIS15       EQU (0x1 << 31) ;- (SUPC) WKUP Input 15 Status
// - -------- SUPC_FWUTR : (SUPC Offset: 0x18) Flash Wake Up Timer Register -------- 
AT91C_SUPC_FWUT           EQU (0x3FF <<  0) ;- (SUPC) Flash Wake Up Timer

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Real Time Timer Controller Interface
// - *****************************************************************************
// - -------- RTTC_RTMR : (RTTC Offset: 0x0) Real-time Mode Register -------- 
AT91C_RTTC_RTPRES         EQU (0xFFFF <<  0) ;- (RTTC) Real-time Timer Prescaler Value
AT91C_RTTC_ALMIEN         EQU (0x1 << 16) ;- (RTTC) Alarm Interrupt Enable
AT91C_RTTC_RTTINCIEN      EQU (0x1 << 17) ;- (RTTC) Real Time Timer Increment Interrupt Enable
AT91C_RTTC_RTTRST         EQU (0x1 << 18) ;- (RTTC) Real Time Timer Restart
// - -------- RTTC_RTAR : (RTTC Offset: 0x4) Real-time Alarm Register -------- 
AT91C_RTTC_ALMV           EQU (0x0 <<  0) ;- (RTTC) Alarm Value
// - -------- RTTC_RTVR : (RTTC Offset: 0x8) Current Real-time Value Register -------- 
AT91C_RTTC_CRTV           EQU (0x0 <<  0) ;- (RTTC) Current Real-time Value
// - -------- RTTC_RTSR : (RTTC Offset: 0xc) Real-time Status Register -------- 
AT91C_RTTC_ALMS           EQU (0x1 <<  0) ;- (RTTC) Real-time Alarm Status
AT91C_RTTC_RTTINC         EQU (0x1 <<  1) ;- (RTTC) Real-time Timer Increment

