una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s1.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Context Based Direct Memory Access Controller Interface
// - *****************************************************************************
// - -------- HCBDMA_CBDSCR : (HCBDMA Offset: 0x0) CB DMA Descriptor Base Register -------- 
AT91C_HCBDMA_DSCR         EQU (0x0 <<  0) ;- (HCBDMA) Descriptor Base Address
// - -------- HCBDMA_CBNXTEN : (HCBDMA Offset: 0x4) Next Descriptor Enable Register -------- 
AT91C_HCBDMA_NXTID0       EQU (0x1 <<  0) ;- (HCBDMA) Next Descriptor Identifier for the Channel 0
AT91C_HCBDMA_NXTID1       EQU (0x1 <<  1) ;- (HCBDMA) Next Descriptor Identifier for the Channel 1
AT91C_HCBDMA_NXTID2       EQU (0x1 <<  2) ;- (HCBDMA) Next Descriptor Identifier for the Channel 2
AT91C_HCBDMA_NXTID3       EQU (0x1 <<  3) ;- (HCBDMA) Next Descriptor Identifier for the Channel 3
AT91C_HCBDMA_NXTID4       EQU (0x1 <<  4) ;- (HCBDMA) Next Descriptor Identifier for the Channel 4
AT91C_HCBDMA_NXTID5       EQU (0x1 <<  5) ;- (HCBDMA) Next Descriptor Identifier for the Channel 5
AT91C_HCBDMA_NXTID6       EQU (0x1 <<  6) ;- (HCBDMA) Next Descriptor Identifier for the Channel 6
AT91C_HCBDMA_NXTID7       EQU (0x1 <<  7) ;- (HCBDMA) Next Descriptor Identifier for the Channel 7
AT91C_HCBDMA_NXTID8       EQU (0x1 <<  8) ;- (HCBDMA) Next Descriptor Identifier for the Channel 8
AT91C_HCBDMA_NXTID9       EQU (0x1 <<  9) ;- (HCBDMA) Next Descriptor Identifier for the Channel 9
AT91C_HCBDMA_NXTID10      EQU (0x1 << 10) ;- (HCBDMA) Next Descriptor Identifier for the Channel 10
AT91C_HCBDMA_NXTID11      EQU (0x1 << 11) ;- (HCBDMA) Next Descriptor Identifier for the Channel 11
AT91C_HCBDMA_NXTID12      EQU (0x1 << 12) ;- (HCBDMA) Next Descriptor Identifier for the Channel 12
AT91C_HCBDMA_NXTID13      EQU (0x1 << 13) ;- (HCBDMA) Next Descriptor Identifier for the Channel 13
AT91C_HCBDMA_NXTID14      EQU (0x1 << 14) ;- (HCBDMA) Next Descriptor Identifier for the Channel 14
AT91C_HCBDMA_NXTID15      EQU (0x1 << 15) ;- (HCBDMA) Next Descriptor Identifier for the Channel 15
AT91C_HCBDMA_NXTID16      EQU (0x1 << 16) ;- (HCBDMA) Next Descriptor Identifier for the Channel 16
AT91C_HCBDMA_NXTID17      EQU (0x1 << 17) ;- (HCBDMA) Next Descriptor Identifier for the Channel 17
AT91C_HCBDMA_NXTID18      EQU (0x1 << 18) ;- (HCBDMA) Next Descriptor Identifier for the Channel 18
AT91C_HCBDMA_NXTID19      EQU (0x1 << 19) ;- (HCBDMA) Next Descriptor Identifier for the Channel 19
AT91C_HCBDMA_NXTID20      EQU (0x1 << 20) ;- (HCBDMA) Next Descriptor Identifier for the Channel 20
AT91C_HCBDMA_NXTID21      EQU (0x1 << 21) ;- (HCBDMA) Next Descriptor Identifier for the Channel 21
AT91C_HCBDMA_NXTID22      EQU (0x1 << 22) ;- (HCBDMA) Next Descriptor Identifier for the Channel 22
AT91C_HCBDMA_NXTID23      EQU (0x1 << 23) ;- (HCBDMA) Next Descriptor Identifier for the Channel 23
AT91C_HCBDMA_NXTID24      EQU (0x1 << 24) ;- (HCBDMA) Next Descriptor Identifier for the Channel 24
AT91C_HCBDMA_NXTID25      EQU (0x1 << 25) ;- (HCBDMA) Next Descriptor Identifier for the Channel 25
AT91C_HCBDMA_NXTID26      EQU (0x1 << 26) ;- (HCBDMA) Next Descriptor Identifier for the Channel 26
AT91C_HCBDMA_NXTID27      EQU (0x1 << 27) ;- (HCBDMA) Next Descriptor Identifier for the Channel 27
AT91C_HCBDMA_NXTID28      EQU (0x1 << 28) ;- (HCBDMA) Next Descriptor Identifier for the Channel 28
AT91C_HCBDMA_NXTID29      EQU (0x1 << 29) ;- (HCBDMA) Next Descriptor Identifier for the Channel 29
AT91C_HCBDMA_NXTID30      EQU (0x1 << 30) ;- (HCBDMA) Next Descriptor Identifier for the Channel 30
AT91C_HCBDMA_NXTID31      EQU (0x1 << 31) ;- (HCBDMA) Next Descriptor Identifier for the Channel 31
// - -------- HCBDMA_CBEN : (HCBDMA Offset: 0x8) CB DMA Enable Register -------- 
AT91C_HCBDMA_CBEN0        EQU (0x1 <<  0) ;- (HCBDMA) Enable for the Channel 0
AT91C_HCBDMA_CBEN1        EQU (0x1 <<  1) ;- (HCBDMA) Enable for the Channel 1
AT91C_HCBDMA_CBEN2        EQU (0x1 <<  2) ;- (HCBDMA) Enable for the Channel 2
AT91C_HCBDMA_CBEN3        EQU (0x1 <<  3) ;- (HCBDMA) Enable for the Channel 3
AT91C_HCBDMA_CBEN4        EQU (0x1 <<  4) ;- (HCBDMA) Enable for the Channel 4
AT91C_HCBDMA_CBEN5        EQU (0x1 <<  5) ;- (HCBDMA) Enable for the Channel 5
AT91C_HCBDMA_CBEN6        EQU (0x1 <<  6) ;- (HCBDMA) Enable for the Channel 6
AT91C_HCBDMA_CBEN7        EQU (0x1 <<  7) ;- (HCBDMA) Enable for the Channel 7
AT91C_HCBDMA_CBEN8        EQU (0x1 <<  8) ;- (HCBDMA) Enable for the Channel 8
AT91C_HCBDMA_CBEN9        EQU (0x1 <<  9) ;- (HCBDMA) Enable for the Channel 9
AT91C_HCBDMA_CBEN10       EQU (0x1 << 10) ;- (HCBDMA) Enable for the Channel 10
AT91C_HCBDMA_CBEN11       EQU (0x1 << 11) ;- (HCBDMA) Enable for the Channel 11
AT91C_HCBDMA_CBEN12       EQU (0x1 << 12) ;- (HCBDMA) Enable for the Channel 12
AT91C_HCBDMA_CBEN13       EQU (0x1 << 13) ;- (HCBDMA) Enable for the Channel 13
AT91C_HCBDMA_CBEN14       EQU (0x1 << 14) ;- (HCBDMA) Enable for the Channel 14
AT91C_HCBDMA_CBEN15       EQU (0x1 << 15) ;- (HCBDMA) Enable for the Channel 15
AT91C_HCBDMA_CBEN16       EQU (0x1 << 16) ;- (HCBDMA) Enable for the Channel 16
AT91C_HCBDMA_CBEN17       EQU (0x1 << 17) ;- (HCBDMA) Enable for the Channel 17
AT91C_HCBDMA_CBEN18       EQU (0x1 << 18) ;- (HCBDMA) Enable for the Channel 18
AT91C_HCBDMA_CBEN19       EQU (0x1 << 19) ;- (HCBDMA) Enable for the Channel 19
AT91C_HCBDMA_CBEN20       EQU (0x1 << 20) ;- (HCBDMA) Enable for the Channel 20
AT91C_HCBDMA_CBEN21       EQU (0x1 << 21) ;- (HCBDMA) Enable for the Channel 21
AT91C_HCBDMA_CBEN22       EQU (0x1 << 22) ;- (HCBDMA) Enable for the Channel 22
AT91C_HCBDMA_CBEN23       EQU (0x1 << 23) ;- (HCBDMA) Enable for the Channel 23
AT91C_HCBDMA_CBEN24       EQU (0x1 << 24) ;- (HCBDMA) Enable for the Channel 24
AT91C_HCBDMA_CBEN25       EQU (0x1 << 25) ;- (HCBDMA) Enable for the Channel 25
AT91C_HCBDMA_CBEN26       EQU (0x1 << 26) ;- (HCBDMA) Enable for the Channel 26
AT91C_HCBDMA_CBEN27       EQU (0x1 << 27) ;- (HCBDMA) Enable for the Channel 27
AT91C_HCBDMA_CBEN28       EQU (0x1 << 28) ;- (HCBDMA) Enable for the Channel 28
AT91C_HCBDMA_CBEN29       EQU (0x1 << 29) ;- (HCBDMA) Enable for the Channel 29
AT91C_HCBDMA_CBEN30       EQU (0x1 << 30) ;- (HCBDMA) Enable for the Channel 30
AT91C_HCBDMA_CBEN31       EQU (0x1 << 31) ;- (HCBDMA) Enable for the Channel 31
// - -------- HCBDMA_CBDIS : (HCBDMA Offset: 0xc) CB DMA Disable Register -------- 
AT91C_HCBDMA_CBDIS0       EQU (0x1 <<  0) ;- (HCBDMA) Disable for the Channel 0
AT91C_HCBDMA_CBDIS1       EQU (0x1 <<  1) ;- (HCBDMA) Disable for the Channel 1
AT91C_HCBDMA_CBDIS2       EQU (0x1 <<  2) ;- (HCBDMA) Disable for the Channel 2
AT91C_HCBDMA_CBDIS3       EQU (0x1 <<  3) ;- (HCBDMA) Disable for the Channel 3
AT91C_HCBDMA_CBDIS4       EQU (0x1 <<  4) ;- (HCBDMA) Disable for the Channel 4
AT91C_HCBDMA_CBDIS5       EQU (0x1 <<  5) ;- (HCBDMA) Disable for the Channel 5
AT91C_HCBDMA_CBDIS6       EQU (0x1 <<  6) ;- (HCBDMA) Disable for the Channel 6
AT91C_HCBDMA_CBDIS7       EQU (0x1 <<  7) ;- (HCBDMA) Disable for the Channel 7
AT91C_HCBDMA_CBDIS8       EQU (0x1 <<  8) ;- (HCBDMA) Disable for the Channel 8
AT91C_HCBDMA_CBDIS9       EQU (0x1 <<  9) ;- (HCBDMA) Disable for the Channel 9
AT91C_HCBDMA_CBDIS10      EQU (0x1 << 10) ;- (HCBDMA) Disable for the Channel 10
AT91C_HCBDMA_CBDIS11      EQU (0x1 << 11) ;- (HCBDMA) Disable for the Channel 11
AT91C_HCBDMA_CBDIS12      EQU (0x1 << 12) ;- (HCBDMA) Disable for the Channel 12
AT91C_HCBDMA_CBDIS13      EQU (0x1 << 13) ;- (HCBDMA) Disable for the Channel 13
AT91C_HCBDMA_CBDIS14      EQU (0x1 << 14) ;- (HCBDMA) Disable for the Channel 14
AT91C_HCBDMA_CBDIS15      EQU (0x1 << 15) ;- (HCBDMA) Disable for the Channel 15
AT91C_HCBDMA_CBDIS16      EQU (0x1 << 16) ;- (HCBDMA) Disable for the Channel 16
AT91C_HCBDMA_CBDIS17      EQU (0x1 << 17) ;- (HCBDMA) Disable for the Channel 17
AT91C_HCBDMA_CBDIS18      EQU (0x1 << 18) ;- (HCBDMA) Disable for the Channel 18
AT91C_HCBDMA_CBDIS19      EQU (0x1 << 19) ;- (HCBDMA) Disable for the Channel 19
AT91C_HCBDMA_CBDIS20      EQU (0x1 << 20) ;- (HCBDMA) Disable for the Channel 20
AT91C_HCBDMA_CBDIS21      EQU (0x1 << 21) ;- (HCBDMA) Disable for the Channel 21
AT91C_HCBDMA_CBDIS22      EQU (0x1 << 22) ;- (HCBDMA) Disable for the Channel 22
AT91C_HCBDMA_CBDIS23      EQU (0x1 << 23) ;- (HCBDMA) Disable for the Channel 23
AT91C_HCBDMA_CBDIS24      EQU (0x1 << 24) ;- (HCBDMA) Disable for the Channel 24
AT91C_HCBDMA_CBDIS25      EQU (0x1 << 25) ;- (HCBDMA) Disable for the Channel 25
AT91C_HCBDMA_CBDIS26      EQU (0x1 << 26) ;- (HCBDMA) Disable for the Channel 26
AT91C_HCBDMA_CBDIS27      EQU (0x1 << 27) ;- (HCBDMA) Disable for the Channel 27
AT91C_HCBDMA_CBDIS28      EQU (0x1 << 28) ;- (HCBDMA) Disable for the Channel 28
AT91C_HCBDMA_CBDIS29      EQU (0x1 << 29) ;- (HCBDMA) Disable for the Channel 29
AT91C_HCBDMA_CBDIS30      EQU (0x1 << 30) ;- (HCBDMA) Disable for the Channel 30
AT91C_HCBDMA_CBDIS31      EQU (0x1 << 31) ;- (HCBDMA) Disable for the Channel 31
// - -------- HCBDMA_CBSR : (HCBDMA Offset: 0x10) CB DMA Status Register -------- 
AT91C_HCBDMA_CBSR0        EQU (0x1 <<  0) ;- (HCBDMA) Status for the Channel 0
AT91C_HCBDMA_CBSR1        EQU (0x1 <<  1) ;- (HCBDMA) Status for the Channel 1
AT91C_HCBDMA_CBSR2        EQU (0x1 <<  2) ;- (HCBDMA) Status for the Channel 2
AT91C_HCBDMA_CBSR3        EQU (0x1 <<  3) ;- (HCBDMA) Status for the Channel 3
AT91C_HCBDMA_CBSR4        EQU (0x1 <<  4) ;- (HCBDMA) Status for the Channel 4
AT91C_HCBDMA_CBSR5        EQU (0x1 <<  5) ;- (HCBDMA) Status for the Channel 5
AT91C_HCBDMA_CBSR6        EQU (0x1 <<  6) ;- (HCBDMA) Status for the Channel 6
AT91C_HCBDMA_CBSR7        EQU (0x1 <<  7) ;- (HCBDMA) Status for the Channel 7
AT91C_HCBDMA_CBSR8        EQU (0x1 <<  8) ;- (HCBDMA) Status for the Channel 8
AT91C_HCBDMA_CBSR9        EQU (0x1 <<  9) ;- (HCBDMA) Status for the Channel 9
AT91C_HCBDMA_CBSR10       EQU (0x1 << 10) ;- (HCBDMA) Status for the Channel 10
AT91C_HCBDMA_CBSR11       EQU (0x1 << 11) ;- (HCBDMA) Status for the Channel 11
AT91C_HCBDMA_CBSR12       EQU (0x1 << 12) ;- (HCBDMA) Status for the Channel 12
AT91C_HCBDMA_CBSR13       EQU (0x1 << 13) ;- (HCBDMA) Status for the Channel 13
AT91C_HCBDMA_CBSR14       EQU (0x1 << 14) ;- (HCBDMA) Status for the Channel 14
AT91C_HCBDMA_CBSR15       EQU (0x1 << 15) ;- (HCBDMA) Status for the Channel 15
AT91C_HCBDMA_CBSR16       EQU (0x1 << 16) ;- (HCBDMA) Status for the Channel 16
AT91C_HCBDMA_CBSR17       EQU (0x1 << 17) ;- (HCBDMA) Status for the Channel 17
AT91C_HCBDMA_CBSR18       EQU (0x1 << 18) ;- (HCBDMA) Status for the Channel 18
AT91C_HCBDMA_CBSR19       EQU (0x1 << 19) ;- (HCBDMA) Status for the Channel 19
AT91C_HCBDMA_CBSR20       EQU (0x1 << 20) ;- (HCBDMA) Status for the Channel 20
AT91C_HCBDMA_CBSR21       EQU (0x1 << 21) ;- (HCBDMA) Status for the Channel 21
AT91C_HCBDMA_CBSR22       EQU (0x1 << 22) ;- (HCBDMA) Status for the Channel 22
AT91C_HCBDMA_CBSR23       EQU (0x1 << 23) ;- (HCBDMA) Status for the Channel 23
AT91C_HCBDMA_CBSR24       EQU (0x1 << 24) ;- (HCBDMA) Status for the Channel 24
AT91C_HCBDMA_CBSR25       EQU (0x1 << 25) ;- (HCBDMA) Status for the Channel 25
AT91C_HCBDMA_CBSR26       EQU (0x1 << 26) ;- (HCBDMA) Status for the Channel 26
AT91C_HCBDMA_CBSR27       EQU (0x1 << 27) ;- (HCBDMA) Status for the Channel 27
AT91C_HCBDMA_CBSR28       EQU (0x1 << 28) ;- (HCBDMA) Status for the Channel 28
AT91C_HCBDMA_CBSR29       EQU (0x1 << 29) ;- (HCBDMA) Status for the Channel 29
AT91C_HCBDMA_CBSR30       EQU (0x1 << 30) ;- (HCBDMA) Status for the Channel 30
AT91C_HCBDMA_CBSR31       EQU (0x1 << 31) ;- (HCBDMA) Status for the Channel 31
// - -------- HCBDMA_CBIER : (HCBDMA Offset: 0x14) CB DMA Interrupt Enable Register -------- 
AT91C_HCBDMA_CBIER0       EQU (0x1 <<  0) ;- (HCBDMA) Interrupt enable for the Channel 0
AT91C_HCBDMA_CBIER1       EQU (0x1 <<  1) ;- (HCBDMA) Interrupt enable for the Channel 1
AT91C_HCBDMA_CBIER2       EQU (0x1 <<  2) ;- (HCBDMA) Interrupt enable for the Channel 2
AT91C_HCBDMA_CBIER3       EQU (0x1 <<  3) ;- (HCBDMA) Interrupt enable for the Channel 3
AT91C_HCBDMA_CBIER4       EQU (0x1 <<  4) ;- (HCBDMA) Interrupt enable for the Channel 4
AT91C_HCBDMA_CBIER5       EQU (0x1 <<  5) ;- (HCBDMA) Interrupt enable for the Channel 5
AT91C_HCBDMA_CBIER6       EQU (0x1 <<  6) ;- (HCBDMA) Interrupt enable for the Channel 6
AT91C_HCBDMA_CBIER7       EQU (0x1 <<  7) ;- (HCBDMA) Interrupt enable for the Channel 7
AT91C_HCBDMA_CBIER8       EQU (0x1 <<  8) ;- (HCBDMA) Interrupt enable for the Channel 8
AT91C_HCBDMA_CBIER9       EQU (0x1 <<  9) ;- (HCBDMA) Interrupt enable for the Channel 9
AT91C_HCBDMA_CBIER10      EQU (0x1 << 10) ;- (HCBDMA) Interrupt enable for the Channel 10
AT91C_HCBDMA_CBIER11      EQU (0x1 << 11) ;- (HCBDMA) Interrupt enable for the Channel 11
AT91C_HCBDMA_CBIER12      EQU (0x1 << 12) ;- (HCBDMA) Interrupt enable for the Channel 12
AT91C_HCBDMA_CBIER13      EQU (0x1 << 13) ;- (HCBDMA) Interrupt enable for the Channel 13
AT91C_HCBDMA_CBIER14      EQU (0x1 << 14) ;- (HCBDMA) Interrupt enable for the Channel 14
AT91C_HCBDMA_CBIER15      EQU (0x1 << 15) ;- (HCBDMA) Interrupt enable for the Channel 15
AT91C_HCBDMA_CBIER16      EQU (0x1 << 16) ;- (HCBDMA) Interrupt enable for the Channel 16
AT91C_HCBDMA_CBIER17      EQU (0x1 << 17) ;- (HCBDMA) Interrupt enable for the Channel 17
AT91C_HCBDMA_CBIER18      EQU (0x1 << 18) ;- (HCBDMA) Interrupt enable for the Channel 18
AT91C_HCBDMA_CBIER19      EQU (0x1 << 19) ;- (HCBDMA) Interrupt enable for the Channel 19
AT91C_HCBDMA_CBIER20      EQU (0x1 << 20) ;- (HCBDMA) Interrupt enable for the Channel 20
AT91C_HCBDMA_CBIER21      EQU (0x1 << 21) ;- (HCBDMA) Interrupt enable for the Channel 21
AT91C_HCBDMA_CBIER22      EQU (0x1 << 22) ;- (HCBDMA) Interrupt enable for the Channel 22
AT91C_HCBDMA_CBIER23      EQU (0x1 << 23) ;- (HCBDMA) Interrupt enable for the Channel 23
AT91C_HCBDMA_CBIER24      EQU (0x1 << 24) ;- (HCBDMA) Interrupt enable for the Channel 24
AT91C_HCBDMA_CBIER25      EQU (0x1 << 25) ;- (HCBDMA) Interrupt enable for the Channel 25
AT91C_HCBDMA_CBIER26      EQU (0x1 << 26) ;- (HCBDMA) Interrupt enable for the Channel 26
AT91C_HCBDMA_CBIER27      EQU (0x1 << 27) ;- (HCBDMA) Interrupt enable for the Channel 27
AT91C_HCBDMA_CBIER28      EQU (0x1 << 28) ;- (HCBDMA) Interrupt enable for the Channel 28
AT91C_HCBDMA_CBIER29      EQU (0x1 << 29) ;- (HCBDMA) Interrupt enable for the Channel 29
AT91C_HCBDMA_CBIER30      EQU (0x1 << 30) ;- (HCBDMA) Interrupt enable for the Channel 30
AT91C_HCBDMA_CBIER31      EQU (0x1 << 31) ;- (HCBDMA) Interrupt enable for the Channel 31
// - -------- HCBDMA_CBIDR : (HCBDMA Offset: 0x18) CB DMA Interrupt Disable Register -------- 
AT91C_HCBDMA_CBIDR0       EQU (0x1 <<  0) ;- (HCBDMA) Interrupt disable for the Channel 0
AT91C_HCBDMA_CBIDR1       EQU (0x1 <<  1) ;- (HCBDMA) Interrupt disable for the Channel 1
AT91C_HCBDMA_CBIDR2       EQU (0x1 <<  2) ;- (HCBDMA) Interrupt disable for the Channel 2
AT91C_HCBDMA_CBIDR3       EQU (0x1 <<  3) ;- (HCBDMA) Interrupt disable for the Channel 3
AT91C_HCBDMA_CBIDR4       EQU (0x1 <<  4) ;- (HCBDMA) Interrupt disable for the Channel 4
AT91C_HCBDMA_CBIDR5       EQU (0x1 <<  5) ;- (HCBDMA) Interrupt disable for the Channel 5
AT91C_HCBDMA_CBIDR6       EQU (0x1 <<  6) ;- (HCBDMA) Interrupt disable for the Channel 6
AT91C_HCBDMA_CBIDR7       EQU (0x1 <<  7) ;- (HCBDMA) Interrupt disable for the Channel 7
AT91C_HCBDMA_CBIDR8       EQU (0x1 <<  8) ;- (HCBDMA) Interrupt disable for the Channel 8
AT91C_HCBDMA_CBIDR9       EQU (0x1 <<  9) ;- (HCBDMA) Interrupt disable for the Channel 9
AT91C_HCBDMA_CBIDR10      EQU (0x1 << 10) ;- (HCBDMA) Interrupt disable for the Channel 10
AT91C_HCBDMA_CBIDR11      EQU (0x1 << 11) ;- (HCBDMA) Interrupt disable for the Channel 11
AT91C_HCBDMA_CBIDR12      EQU (0x1 << 12) ;- (HCBDMA) Interrupt disable for the Channel 12
AT91C_HCBDMA_CBIDR13      EQU (0x1 << 13) ;- (HCBDMA) Interrupt disable for the Channel 13
AT91C_HCBDMA_CBIDR14      EQU (0x1 << 14) ;- (HCBDMA) Interrupt disable for the Channel 14
AT91C_HCBDMA_CBIDR15      EQU (0x1 << 15) ;- (HCBDMA) Interrupt disable for the Channel 15
AT91C_HCBDMA_CBIDR16      EQU (0x1 << 16) ;- (HCBDMA) Interrupt disable for the Channel 16
AT91C_HCBDMA_CBIDR17      EQU (0x1 << 17) ;- (HCBDMA) Interrupt disable for the Channel 17
AT91C_HCBDMA_CBIDR18      EQU (0x1 << 18) ;- (HCBDMA) Interrupt disable for the Channel 18
AT91C_HCBDMA_CBIDR19      EQU (0x1 << 19) ;- (HCBDMA) Interrupt disable for the Channel 19
AT91C_HCBDMA_CBIDR20      EQU (0x1 << 20) ;- (HCBDMA) Interrupt disable for the Channel 20
AT91C_HCBDMA_CBIDR21      EQU (0x1 << 21) ;- (HCBDMA) Interrupt disable for the Channel 21
AT91C_HCBDMA_CBIDR22      EQU (0x1 << 22) ;- (HCBDMA) Interrupt disable for the Channel 22
AT91C_HCBDMA_CBIDR23      EQU (0x1 << 23) ;- (HCBDMA) Interrupt disable for the Channel 23
AT91C_HCBDMA_CBIDR24      EQU (0x1 << 24) ;- (HCBDMA) Interrupt disable for the Channel 24
AT91C_HCBDMA_CBIDR25      EQU (0x1 << 25) ;- (HCBDMA) Interrupt disable for the Channel 25
AT91C_HCBDMA_CBIDR26      EQU (0x1 << 26) ;- (HCBDMA) Interrupt disable for the Channel 26
AT91C_HCBDMA_CBIDR27      EQU (0x1 << 27) ;- (HCBDMA) Interrupt disable for the Channel 27
AT91C_HCBDMA_CBIDR28      EQU (0x1 << 28) ;- (HCBDMA) Interrupt disable for the Channel 28
AT91C_HCBDMA_CBIDR29      EQU (0x1 << 29) ;- (HCBDMA) Interrupt disable for the Channel 29
AT91C_HCBDMA_CBIDR30      EQU (0x1 << 30) ;- (HCBDMA) Interrupt disable for the Channel 30
AT91C_HCBDMA_CBIDR31      EQU (0x1 << 31) ;- (HCBDMA) Interrupt disable for the Channel 31
// - -------- HCBDMA_CBIMR : (HCBDMA Offset: 0x1c) CB DMA Interrupt Mask Register -------- 
AT91C_HCBDMA_CBIMR0       EQU (0x1 <<  0) ;- (HCBDMA) Interrupt mask for the Channel 0
AT91C_HCBDMA_CBIMR1       EQU (0x1 <<  1) ;- (HCBDMA) Interrupt mask for the Channel 1
AT91C_HCBDMA_CBIMR2       EQU (0x1 <<  2) ;- (HCBDMA) Interrupt mask for the Channel 2
AT91C_HCBDMA_CBIMR3       EQU (0x1 <<  3) ;- (HCBDMA) Interrupt mask for the Channel 3
AT91C_HCBDMA_CBIMR4       EQU (0x1 <<  4) ;- (HCBDMA) Interrupt mask for the Channel 4
AT91C_HCBDMA_CBIMR5       EQU (0x1 <<  5) ;- (HCBDMA) Interrupt mask for the Channel 5
AT91C_HCBDMA_CBIMR6       EQU (0x1 <<  6) ;- (HCBDMA) Interrupt mask for the Channel 6
AT91C_HCBDMA_CBIMR7       EQU (0x1 <<  7) ;- (HCBDMA) Interrupt mask for the Channel 7
AT91C_HCBDMA_CBIMR8       EQU (0x1 <<  8) ;- (HCBDMA) Interrupt mask for the Channel 8
AT91C_HCBDMA_CBIMR9       EQU (0x1 <<  9) ;- (HCBDMA) Interrupt mask for the Channel 9
AT91C_HCBDMA_CBIMR10      EQU (0x1 << 10) ;- (HCBDMA) Interrupt mask for the Channel 10
AT91C_HCBDMA_CBIMR11      EQU (0x1 << 11) ;- (HCBDMA) Interrupt mask for the Channel 11
AT91C_HCBDMA_CBIMR12      EQU (0x1 << 12) ;- (HCBDMA) Interrupt mask for the Channel 12
AT91C_HCBDMA_CBIMR13      EQU (0x1 << 13) ;- (HCBDMA) Interrupt mask for the Channel 13
AT91C_HCBDMA_CBIMR14      EQU (0x1 << 14) ;- (HCBDMA) Interrupt mask for the Channel 14
AT91C_HCBDMA_CBIMR15      EQU (0x1 << 15) ;- (HCBDMA) Interrupt mask for the Channel 15
AT91C_HCBDMA_CBIMR16      EQU (0x1 << 16) ;- (HCBDMA) Interrupt mask for the Channel 16
AT91C_HCBDMA_CBIMR17      EQU (0x1 << 17) ;- (HCBDMA) Interrupt mask for the Channel 17
AT91C_HCBDMA_CBIMR18      EQU (0x1 << 18) ;- (HCBDMA) Interrupt mask for the Channel 18
AT91C_HCBDMA_CBIMR19      EQU (0x1 << 19) ;- (HCBDMA) Interrupt mask for the Channel 19
AT91C_HCBDMA_CBIMR20      EQU (0x1 << 20) ;- (HCBDMA) Interrupt mask for the Channel 20
AT91C_HCBDMA_CBIMR21      EQU (0x1 << 21) ;- (HCBDMA) Interrupt mask for the Channel 21
AT91C_HCBDMA_CBIMR22      EQU (0x1 << 22) ;- (HCBDMA) Interrupt mask for the Channel 22
AT91C_HCBDMA_CBIMR23      EQU (0x1 << 23) ;- (HCBDMA) Interrupt mask for the Channel 23
AT91C_HCBDMA_CBIMR24      EQU (0x1 << 24) ;- (HCBDMA) Interrupt mask for the Channel 24
AT91C_HCBDMA_CBIMR25      EQU (0x1 << 25) ;- (HCBDMA) Interrupt mask for the Channel 25
AT91C_HCBDMA_CBIMR26      EQU (0x1 << 26) ;- (HCBDMA) Interrupt mask for the Channel 26
AT91C_HCBDMA_CBIMR27      EQU (0x1 << 27) ;- (HCBDMA) Interrupt mask for the Channel 27
AT91C_HCBDMA_CBIMR28      EQU (0x1 << 28) ;- (HCBDMA) Interrupt mask for the Channel 28
AT91C_HCBDMA_CBIMR29      EQU (0x1 << 29) ;- (HCBDMA) Interrupt mask for the Channel 29
AT91C_HCBDMA_CBIMR30      EQU (0x1 << 30) ;- (HCBDMA) Interrupt mask for the Channel 30
AT91C_HCBDMA_CBIMR31      EQU (0x1 << 31) ;- (HCBDMA) Interrupt mask for the Channel 31
// - -------- HCBDMA_CBISR : (HCBDMA Offset: 0x20) CB DMA Interrupt Satus Register -------- 
AT91C_HCBDMA_CBISR0       EQU (0x1 <<  0) ;- (HCBDMA) Interrupt status for the Channel 0
AT91C_HCBDMA_CBISR1       EQU (0x1 <<  1) ;- (HCBDMA) Interrupt status for the Channel 1
AT91C_HCBDMA_CBISR2       EQU (0x1 <<  2) ;- (HCBDMA) Interrupt status for the Channel 2
AT91C_HCBDMA_CBISR3       EQU (0x1 <<  3) ;- (HCBDMA) Interrupt status for the Channel 3
AT91C_HCBDMA_CBISR4       EQU (0x1 <<  4) ;- (HCBDMA) Interrupt status for the Channel 4
AT91C_HCBDMA_CBISR5       EQU (0x1 <<  5) ;- (HCBDMA) Interrupt status for the Channel 5
AT91C_HCBDMA_CBISR6       EQU (0x1 <<  6) ;- (HCBDMA) Interrupt status for the Channel 6
AT91C_HCBDMA_CBISR7       EQU (0x1 <<  7) ;- (HCBDMA) Interrupt status for the Channel 7
AT91C_HCBDMA_CBISR8       EQU (0x1 <<  8) ;- (HCBDMA) Interrupt status for the Channel 8
AT91C_HCBDMA_CBISR9       EQU (0x1 <<  9) ;- (HCBDMA) Interrupt status for the Channel 9
AT91C_HCBDMA_CBISR10      EQU (0x1 << 10) ;- (HCBDMA) Interrupt status for the Channel 10
AT91C_HCBDMA_CBISR11      EQU (0x1 << 11) ;- (HCBDMA) Interrupt status for the Channel 11
AT91C_HCBDMA_CBISR12      EQU (0x1 << 12) ;- (HCBDMA) Interrupt status for the Channel 12
AT91C_HCBDMA_CBISR13      EQU (0x1 << 13) ;- (HCBDMA) Interrupt status for the Channel 13
AT91C_HCBDMA_CBISR14      EQU (0x1 << 14) ;- (HCBDMA) Interrupt status for the Channel 14
AT91C_HCBDMA_CBISR15      EQU (0x1 << 15) ;- (HCBDMA) Interrupt status for the Channel 15
AT91C_HCBDMA_CBISR16      EQU (0x1 << 16) ;- (HCBDMA) Interrupt status for the Channel 16
AT91C_HCBDMA_CBISR17      EQU (0x1 << 17) ;- (HCBDMA) Interrupt status for the Channel 17
AT91C_HCBDMA_CBISR18      EQU (0x1 << 18) ;- (HCBDMA) Interrupt status for the Channel 18
AT91C_HCBDMA_CBISR19      EQU (0x1 << 19) ;- (HCBDMA) Interrupt status for the Channel 19
AT91C_HCBDMA_CBISR20      EQU (0x1 << 20) ;- (HCBDMA) Interrupt status for the Channel 20
AT91C_HCBDMA_CBISR21      EQU (0x1 << 21) ;- (HCBDMA) Interrupt status for the Channel 21
AT91C_HCBDMA_CBISR22      EQU (0x1 << 22) ;- (HCBDMA) Interrupt status for the Channel 22
AT91C_HCBDMA_CBISR23      EQU (0x1 << 23) ;- (HCBDMA) Interrupt status for the Channel 23
AT91C_HCBDMA_CBISR24      EQU (0x1 << 24) ;- (HCBDMA) Interrupt status for the Channel 24
AT91C_HCBDMA_CBISR25      EQU (0x1 << 25) ;- (HCBDMA) Interrupt status for the Channel 25
AT91C_HCBDMA_CBISR26      EQU (0x1 << 26) ;- (HCBDMA) Interrupt status for the Channel 26
AT91C_HCBDMA_CBISR27      EQU (0x1 << 27) ;- (HCBDMA) Interrupt status for the Channel 27
AT91C_HCBDMA_CBISR28      EQU (0x1 << 28) ;- (HCBDMA) Interrupt status for the Channel 28
AT91C_HCBDMA_CBISR29      EQU (0x1 << 29) ;- (HCBDMA) Interrupt status for the Channel 29
AT91C_HCBDMA_CBISR30      EQU (0x1 << 30) ;- (HCBDMA) Interrupt status for the Channel 30
AT91C_HCBDMA_CBISR31      EQU (0x1 << 31) ;- (HCBDMA) Interrupt status for the Channel 31
// - -------- HCBDMA_CBDLIER : (HCBDMA Offset: 0x24) CB DMA Loaded Interrupt Enable Register -------- 
AT91C_HCBDMA_CBDLIER0     EQU (0x1 <<  0) ;- (HCBDMA) Interrupt enable for the Channel 0
