una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s1.h
AT91C_HCBDMA_CBDLIER1     EQU (0x1 <<  1) ;- (HCBDMA) Interrupt enable for the Channel 1
AT91C_HCBDMA_CBDLIER2     EQU (0x1 <<  2) ;- (HCBDMA) Interrupt enable for the Channel 2
AT91C_HCBDMA_CBDLIER3     EQU (0x1 <<  3) ;- (HCBDMA) Interrupt enable for the Channel 3
AT91C_HCBDMA_CBDLIER4     EQU (0x1 <<  4) ;- (HCBDMA) Interrupt enable for the Channel 4
AT91C_HCBDMA_CBDLIER5     EQU (0x1 <<  5) ;- (HCBDMA) Interrupt enable for the Channel 5
AT91C_HCBDMA_CBDLIER6     EQU (0x1 <<  6) ;- (HCBDMA) Interrupt enable for the Channel 6
AT91C_HCBDMA_CBDLIER7     EQU (0x1 <<  7) ;- (HCBDMA) Interrupt enable for the Channel 7
AT91C_HCBDMA_CBDLIER8     EQU (0x1 <<  8) ;- (HCBDMA) Interrupt enable for the Channel 8
AT91C_HCBDMA_CBDLIER9     EQU (0x1 <<  9) ;- (HCBDMA) Interrupt enable for the Channel 9
AT91C_HCBDMA_CBDLIER10    EQU (0x1 << 10) ;- (HCBDMA) Interrupt enable for the Channel 10
AT91C_HCBDMA_CBDLIER11    EQU (0x1 << 11) ;- (HCBDMA) Interrupt enable for the Channel 11
AT91C_HCBDMA_CBDLIER12    EQU (0x1 << 12) ;- (HCBDMA) Interrupt enable for the Channel 12
AT91C_HCBDMA_CBDLIER13    EQU (0x1 << 13) ;- (HCBDMA) Interrupt enable for the Channel 13
AT91C_HCBDMA_CBDLIER14    EQU (0x1 << 14) ;- (HCBDMA) Interrupt enable for the Channel 14
AT91C_HCBDMA_CBDLIER15    EQU (0x1 << 15) ;- (HCBDMA) Interrupt enable for the Channel 15
AT91C_HCBDMA_CBDLIER16    EQU (0x1 << 16) ;- (HCBDMA) Interrupt enable for the Channel 16
AT91C_HCBDMA_CBDLIER17    EQU (0x1 << 17) ;- (HCBDMA) Interrupt enable for the Channel 17
AT91C_HCBDMA_CBDLIER18    EQU (0x1 << 18) ;- (HCBDMA) Interrupt enable for the Channel 18
AT91C_HCBDMA_CBDLIER19    EQU (0x1 << 19) ;- (HCBDMA) Interrupt enable for the Channel 19
AT91C_HCBDMA_CBDLIER20    EQU (0x1 << 20) ;- (HCBDMA) Interrupt enable for the Channel 20
AT91C_HCBDMA_CBDLIER21    EQU (0x1 << 21) ;- (HCBDMA) Interrupt enable for the Channel 21
AT91C_HCBDMA_CBDLIER22    EQU (0x1 << 22) ;- (HCBDMA) Interrupt enable for the Channel 22
AT91C_HCBDMA_CBDLIER23    EQU (0x1 << 23) ;- (HCBDMA) Interrupt enable for the Channel 23
AT91C_HCBDMA_CBDLIER24    EQU (0x1 << 24) ;- (HCBDMA) Interrupt enable for the Channel 24
AT91C_HCBDMA_CBDLIER25    EQU (0x1 << 25) ;- (HCBDMA) Interrupt enable for the Channel 25
AT91C_HCBDMA_CBDLIER26    EQU (0x1 << 26) ;- (HCBDMA) Interrupt enable for the Channel 26
AT91C_HCBDMA_CBDLIER27    EQU (0x1 << 27) ;- (HCBDMA) Interrupt enable for the Channel 27
AT91C_HCBDMA_CBDLIER28    EQU (0x1 << 28) ;- (HCBDMA) Interrupt enable for the Channel 28
AT91C_HCBDMA_CBDLIER29    EQU (0x1 << 29) ;- (HCBDMA) Interrupt enable for the Channel 29
AT91C_HCBDMA_CBDLIER30    EQU (0x1 << 30) ;- (HCBDMA) Interrupt enable for the Channel 30
AT91C_HCBDMA_CBDLIER31    EQU (0x1 << 31) ;- (HCBDMA) Interrupt enable for the Channel 31
// - -------- HCBDMA_CBDLIDR : (HCBDMA Offset: 0x28) CB DMA Interrupt Disable Register -------- 
AT91C_HCBDMA_CBDLIDR0     EQU (0x1 <<  0) ;- (HCBDMA) Interrupt disable for the Channel 0
AT91C_HCBDMA_CBDLIDR1     EQU (0x1 <<  1) ;- (HCBDMA) Interrupt disable for the Channel 1
AT91C_HCBDMA_CBDLIDR2     EQU (0x1 <<  2) ;- (HCBDMA) Interrupt disable for the Channel 2
AT91C_HCBDMA_CBDLIDR3     EQU (0x1 <<  3) ;- (HCBDMA) Interrupt disable for the Channel 3
AT91C_HCBDMA_CBDLIDR4     EQU (0x1 <<  4) ;- (HCBDMA) Interrupt disable for the Channel 4
AT91C_HCBDMA_CBDLIDR5     EQU (0x1 <<  5) ;- (HCBDMA) Interrupt disable for the Channel 5
AT91C_HCBDMA_CBDLIDR6     EQU (0x1 <<  6) ;- (HCBDMA) Interrupt disable for the Channel 6
AT91C_HCBDMA_CBDLIDR7     EQU (0x1 <<  7) ;- (HCBDMA) Interrupt disable for the Channel 7
AT91C_HCBDMA_CBDLIDR8     EQU (0x1 <<  8) ;- (HCBDMA) Interrupt disable for the Channel 8
AT91C_HCBDMA_CBDLIDR9     EQU (0x1 <<  9) ;- (HCBDMA) Interrupt disable for the Channel 9
AT91C_HCBDMA_CBDLIDR10    EQU (0x1 << 10) ;- (HCBDMA) Interrupt disable for the Channel 10
AT91C_HCBDMA_CBDLIDR11    EQU (0x1 << 11) ;- (HCBDMA) Interrupt disable for the Channel 11
AT91C_HCBDMA_CBDLIDR12    EQU (0x1 << 12) ;- (HCBDMA) Interrupt disable for the Channel 12
AT91C_HCBDMA_CBDLIDR13    EQU (0x1 << 13) ;- (HCBDMA) Interrupt disable for the Channel 13
AT91C_HCBDMA_CBDLIDR14    EQU (0x1 << 14) ;- (HCBDMA) Interrupt disable for the Channel 14
AT91C_HCBDMA_CBDLIDR15    EQU (0x1 << 15) ;- (HCBDMA) Interrupt disable for the Channel 15
AT91C_HCBDMA_CBDLIDR16    EQU (0x1 << 16) ;- (HCBDMA) Interrupt disable for the Channel 16
AT91C_HCBDMA_CBDLIDR17    EQU (0x1 << 17) ;- (HCBDMA) Interrupt disable for the Channel 17
AT91C_HCBDMA_CBDLIDR18    EQU (0x1 << 18) ;- (HCBDMA) Interrupt disable for the Channel 18
AT91C_HCBDMA_CBDLIDR19    EQU (0x1 << 19) ;- (HCBDMA) Interrupt disable for the Channel 19
AT91C_HCBDMA_CBDLIDR20    EQU (0x1 << 20) ;- (HCBDMA) Interrupt disable for the Channel 20
AT91C_HCBDMA_CBDLIDR21    EQU (0x1 << 21) ;- (HCBDMA) Interrupt disable for the Channel 21
AT91C_HCBDMA_CBDLIDR22    EQU (0x1 << 22) ;- (HCBDMA) Interrupt disable for the Channel 22
AT91C_HCBDMA_CBDLIDR23    EQU (0x1 << 23) ;- (HCBDMA) Interrupt disable for the Channel 23
AT91C_HCBDMA_CBDLIDR24    EQU (0x1 << 24) ;- (HCBDMA) Interrupt disable for the Channel 24
AT91C_HCBDMA_CBDLIDR25    EQU (0x1 << 25) ;- (HCBDMA) Interrupt disable for the Channel 25
AT91C_HCBDMA_CBDLIDR26    EQU (0x1 << 26) ;- (HCBDMA) Interrupt disable for the Channel 26
AT91C_HCBDMA_CBDLIDR27    EQU (0x1 << 27) ;- (HCBDMA) Interrupt disable for the Channel 27
AT91C_HCBDMA_CBDLIDR28    EQU (0x1 << 28) ;- (HCBDMA) Interrupt disable for the Channel 28
AT91C_HCBDMA_CBDLIDR29    EQU (0x1 << 29) ;- (HCBDMA) Interrupt disable for the Channel 29
AT91C_HCBDMA_CBDLIDR30    EQU (0x1 << 30) ;- (HCBDMA) Interrupt disable for the Channel 30
AT91C_HCBDMA_CBDLIDR31    EQU (0x1 << 31) ;- (HCBDMA) Interrupt disable for the Channel 31
// - -------- HCBDMA_CBDLIMR : (HCBDMA Offset: 0x2c) CB DMA Interrupt Mask Register -------- 
AT91C_HCBDMA_CBDLIMR0     EQU (0x1 <<  0) ;- (HCBDMA) Interrupt mask for the Channel 0
AT91C_HCBDMA_CBDLIMR1     EQU (0x1 <<  1) ;- (HCBDMA) Interrupt mask for the Channel 1
AT91C_HCBDMA_CBDLIMR2     EQU (0x1 <<  2) ;- (HCBDMA) Interrupt mask for the Channel 2
AT91C_HCBDMA_CBDLIMR3     EQU (0x1 <<  3) ;- (HCBDMA) Interrupt mask for the Channel 3
AT91C_HCBDMA_CBDLIMR4     EQU (0x1 <<  4) ;- (HCBDMA) Interrupt mask for the Channel 4
AT91C_HCBDMA_CBDLIMR5     EQU (0x1 <<  5) ;- (HCBDMA) Interrupt mask for the Channel 5
AT91C_HCBDMA_CBDLIMR6     EQU (0x1 <<  6) ;- (HCBDMA) Interrupt mask for the Channel 6
AT91C_HCBDMA_CBDLIMR7     EQU (0x1 <<  7) ;- (HCBDMA) Interrupt mask for the Channel 7
AT91C_HCBDMA_CBDLIMR8     EQU (0x1 <<  8) ;- (HCBDMA) Interrupt mask for the Channel 8
AT91C_HCBDMA_CBDLIMR9     EQU (0x1 <<  9) ;- (HCBDMA) Interrupt mask for the Channel 9
AT91C_HCBDMA_CBDLIMR10    EQU (0x1 << 10) ;- (HCBDMA) Interrupt mask for the Channel 10
AT91C_HCBDMA_CBDLIMR11    EQU (0x1 << 11) ;- (HCBDMA) Interrupt mask for the Channel 11
AT91C_HCBDMA_CBDLIMR12    EQU (0x1 << 12) ;- (HCBDMA) Interrupt mask for the Channel 12
AT91C_HCBDMA_CBDLIMR13    EQU (0x1 << 13) ;- (HCBDMA) Interrupt mask for the Channel 13
AT91C_HCBDMA_CBDLIMR14    EQU (0x1 << 14) ;- (HCBDMA) Interrupt mask for the Channel 14
AT91C_HCBDMA_CBDLIMR15    EQU (0x1 << 15) ;- (HCBDMA) Interrupt mask for the Channel 15
AT91C_HCBDMA_CBDLIMR16    EQU (0x1 << 16) ;- (HCBDMA) Interrupt mask for the Channel 16
AT91C_HCBDMA_CBDLIMR17    EQU (0x1 << 17) ;- (HCBDMA) Interrupt mask for the Channel 17
AT91C_HCBDMA_CBDLIMR18    EQU (0x1 << 18) ;- (HCBDMA) Interrupt mask for the Channel 18
AT91C_HCBDMA_CBDLIMR19    EQU (0x1 << 19) ;- (HCBDMA) Interrupt mask for the Channel 19
AT91C_HCBDMA_CBDLIMR20    EQU (0x1 << 20) ;- (HCBDMA) Interrupt mask for the Channel 20
AT91C_HCBDMA_CBDLIMR21    EQU (0x1 << 21) ;- (HCBDMA) Interrupt mask for the Channel 21
AT91C_HCBDMA_CBDLIMR22    EQU (0x1 << 22) ;- (HCBDMA) Interrupt mask for the Channel 22
AT91C_HCBDMA_CBDLIMR23    EQU (0x1 << 23) ;- (HCBDMA) Interrupt mask for the Channel 23
AT91C_HCBDMA_CBDLIMR24    EQU (0x1 << 24) ;- (HCBDMA) Interrupt mask for the Channel 24
AT91C_HCBDMA_CBDLIMR25    EQU (0x1 << 25) ;- (HCBDMA) Interrupt mask for the Channel 25
AT91C_HCBDMA_CBDLIMR26    EQU (0x1 << 26) ;- (HCBDMA) Interrupt mask for the Channel 26
AT91C_HCBDMA_CBDLIMR27    EQU (0x1 << 27) ;- (HCBDMA) Interrupt mask for the Channel 27
AT91C_HCBDMA_CBDLIMR28    EQU (0x1 << 28) ;- (HCBDMA) Interrupt mask for the Channel 28
AT91C_HCBDMA_CBDLIMR29    EQU (0x1 << 29) ;- (HCBDMA) Interrupt mask for the Channel 29
AT91C_HCBDMA_CBDLIMR30    EQU (0x1 << 30) ;- (HCBDMA) Interrupt mask for the Channel 30
AT91C_HCBDMA_CBDLIMR31    EQU (0x1 << 31) ;- (HCBDMA) Interrupt mask for the Channel 31
// - -------- HCBDMA_CBDLISR : (HCBDMA Offset: 0x30) CB DMA Interrupt Satus Register -------- 
AT91C_HCBDMA_CBDLISR0     EQU (0x1 <<  0) ;- (HCBDMA) Interrupt status for the Channel 0
AT91C_HCBDMA_CBDLISR1     EQU (0x1 <<  1) ;- (HCBDMA) Interrupt status for the Channel 1
AT91C_HCBDMA_CBDLISR2     EQU (0x1 <<  2) ;- (HCBDMA) Interrupt status for the Channel 2
AT91C_HCBDMA_CBDLISR3     EQU (0x1 <<  3) ;- (HCBDMA) Interrupt status for the Channel 3
AT91C_HCBDMA_CBDLISR4     EQU (0x1 <<  4) ;- (HCBDMA) Interrupt status for the Channel 4
AT91C_HCBDMA_CBDLISR5     EQU (0x1 <<  5) ;- (HCBDMA) Interrupt status for the Channel 5
AT91C_HCBDMA_CBDLISR6     EQU (0x1 <<  6) ;- (HCBDMA) Interrupt status for the Channel 6
AT91C_HCBDMA_CBDLISR7     EQU (0x1 <<  7) ;- (HCBDMA) Interrupt status for the Channel 7
AT91C_HCBDMA_CBDLISR8     EQU (0x1 <<  8) ;- (HCBDMA) Interrupt status for the Channel 8
AT91C_HCBDMA_CBDLISR9     EQU (0x1 <<  9) ;- (HCBDMA) Interrupt status for the Channel 9
AT91C_HCBDMA_CBDLISR10    EQU (0x1 << 10) ;- (HCBDMA) Interrupt status for the Channel 10
AT91C_HCBDMA_CBDLISR11    EQU (0x1 << 11) ;- (HCBDMA) Interrupt status for the Channel 11
AT91C_HCBDMA_CBDLISR12    EQU (0x1 << 12) ;- (HCBDMA) Interrupt status for the Channel 12
AT91C_HCBDMA_CBDLISR13    EQU (0x1 << 13) ;- (HCBDMA) Interrupt status for the Channel 13
AT91C_HCBDMA_CBDLISR14    EQU (0x1 << 14) ;- (HCBDMA) Interrupt status for the Channel 14
AT91C_HCBDMA_CBDLISR15    EQU (0x1 << 15) ;- (HCBDMA) Interrupt status for the Channel 15
AT91C_HCBDMA_CBDLISR16    EQU (0x1 << 16) ;- (HCBDMA) Interrupt status for the Channel 16
AT91C_HCBDMA_CBDLISR17    EQU (0x1 << 17) ;- (HCBDMA) Interrupt status for the Channel 17
AT91C_HCBDMA_CBDLISR18    EQU (0x1 << 18) ;- (HCBDMA) Interrupt status for the Channel 18
AT91C_HCBDMA_CBDLISR19    EQU (0x1 << 19) ;- (HCBDMA) Interrupt status for the Channel 19
AT91C_HCBDMA_CBDLISR20    EQU (0x1 << 20) ;- (HCBDMA) Interrupt status for the Channel 20
AT91C_HCBDMA_CBDLISR21    EQU (0x1 << 21) ;- (HCBDMA) Interrupt status for the Channel 21
AT91C_HCBDMA_CBDLISR22    EQU (0x1 << 22) ;- (HCBDMA) Interrupt status for the Channel 22
AT91C_HCBDMA_CBDLISR23    EQU (0x1 << 23) ;- (HCBDMA) Interrupt status for the Channel 23
AT91C_HCBDMA_CBDLISR24    EQU (0x1 << 24) ;- (HCBDMA) Interrupt status for the Channel 24
AT91C_HCBDMA_CBDLISR25    EQU (0x1 << 25) ;- (HCBDMA) Interrupt status for the Channel 25
AT91C_HCBDMA_CBDLISR26    EQU (0x1 << 26) ;- (HCBDMA) Interrupt status for the Channel 26
AT91C_HCBDMA_CBDLISR27    EQU (0x1 << 27) ;- (HCBDMA) Interrupt status for the Channel 27
AT91C_HCBDMA_CBDLISR28    EQU (0x1 << 28) ;- (HCBDMA) Interrupt status for the Channel 28
AT91C_HCBDMA_CBDLISR29    EQU (0x1 << 29) ;- (HCBDMA) Interrupt status for the Channel 29
AT91C_HCBDMA_CBDLISR30    EQU (0x1 << 30) ;- (HCBDMA) Interrupt status for the Channel 30
AT91C_HCBDMA_CBDLISR31    EQU (0x1 << 31) ;- (HCBDMA) Interrupt status for the Channel 31
// - -------- HCBDMA_CBCRCCR : (HCBDMA Offset: 0x34) CB DMA CRC Control Resgister -------- 
AT91C_CRC_START           EQU (0x1 <<  0) ;- (HCBDMA) CRC compuration initialization
// - -------- HCBDMA_CBCRCMR : (HCBDMA Offset: 0x38) CB DMA CRC Mode Resgister -------- 
AT91C_CRC_ENABLE          EQU (0x1 <<  0) ;- (HCBDMA) CRC Enable
AT91C_CRC_COMPARE         EQU (0x1 <<  1) ;- (HCBDMA) CRC Compare
AT91C_CRC_PTYPE           EQU (0x3 <<  2) ;- (HCBDMA) Primitive polynomial type
AT91C_CRC_PTYPE_CCIT802_3 EQU (0x0 <<  2) ;- (HCBDMA) 
AT91C_CRC_PTYPE_CASTAGNOLI EQU (0x1 <<  2) ;- (HCBDMA) 
AT91C_CRC_PTYPE_CCIT_16   EQU (0x2 <<  2) ;- (HCBDMA) 
AT91C_CRC_DIVIDER         EQU (0xF <<  4) ;- (HCBDMA) Request Divider
AT91C_CRC_ID              EQU (0x1F <<  8) ;- (HCBDMA) CRC channel Identifier
AT91C_CRC_ID_CHANNEL_0    EQU (0x0 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_1    EQU (0x1 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_2    EQU (0x2 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_3    EQU (0x3 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_4    EQU (0x4 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_5    EQU (0x5 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_6    EQU (0x6 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_7    EQU (0x7 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_8    EQU (0x8 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_9    EQU (0x9 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_10   EQU (0xA <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_11   EQU (0xB <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_12   EQU (0xC <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_13   EQU (0xD <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_14   EQU (0xE <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_15   EQU (0xF <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_16   EQU (0x10 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_17   EQU (0x11 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_18   EQU (0x12 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_19   EQU (0x13 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_20   EQU (0x14 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_21   EQU (0x15 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_22   EQU (0x16 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_23   EQU (0x17 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_24   EQU (0x18 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_25   EQU (0x19 <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_26   EQU (0x1A <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_27   EQU (0x1B <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_28   EQU (0x1C <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_29   EQU (0x1D <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_30   EQU (0x1E <<  8) ;- (HCBDMA) 
AT91C_CRC_ID_CHANNEL_31   EQU (0x1F <<  8) ;- (HCBDMA) 
// - -------- HCBDMA_CBCRCSR : (HCBDMA Offset: 0x3c) CB DMA CRC Status Resgister -------- 
AT91C_HCBDMA_CRCSR        EQU (0x0 <<  0) ;- (HCBDMA) CRC Status Resgister
// - -------- HCBDMA_CBCRCIER : (HCBDMA Offset: 0x40) CB DMA CRC Interrupt Enable Resgister -------- 
AT91C_CRC_ERRIER          EQU (0x1 <<  0) ;- (HCBDMA) CRC Error Interrupt Enable
// - -------- HCBDMA_CBCRCIDR : (HCBDMA Offset: 0x44) CB DMA CRC Interrupt Enable Resgister -------- 
AT91C_CRC_ERRIDR          EQU (0x1 <<  0) ;- (HCBDMA) CRC Error Interrupt Disable
// - -------- HCBDMA_CBCRCIMR : (HCBDMA Offset: 0x48) CB DMA CRC Interrupt Mask Resgister -------- 
AT91C_CRC_ERRIMR          EQU (0x1 <<  0) ;- (HCBDMA) CRC Error Interrupt Mask
// - -------- HCBDMA_CBCRCISR : (HCBDMA Offset: 0x4c) CB DMA CRC Interrupt Status Resgister -------- 
AT91C_CRC_ERRISR          EQU (0x1 <<  0) ;- (HCBDMA) CRC Error Interrupt Status

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Timer Counter Channel Interface
// - *****************************************************************************
// - -------- TC_CCR : (TC Offset: 0x0) TC Channel Control Register -------- 
AT91C_TC_CLKEN            EQU (0x1 <<  0) ;- (TC) Counter Clock Enable Command
AT91C_TC_CLKDIS           EQU (0x1 <<  1) ;- (TC) Counter Clock Disable Command
AT91C_TC_SWTRG            EQU (0x1 <<  2) ;- (TC) Software Trigger Command
// - -------- TC_CMR : (TC Offset: 0x4) TC Channel Mode Register: Capture Mode / Waveform Mode -------- 
AT91C_TC_CLKS             EQU (0x7 <<  0) ;- (TC) Clock Selection
AT91C_TC_CLKS_TIMER_DIV1_CLOCK EQU (0x0) ;- (TC) Clock selected: TIMER_DIV1_CLOCK
AT91C_TC_CLKS_TIMER_DIV2_CLOCK EQU (0x1) ;- (TC) Clock selected: TIMER_DIV2_CLOCK
AT91C_TC_CLKS_TIMER_DIV3_CLOCK EQU (0x2) ;- (TC) Clock selected: TIMER_DIV3_CLOCK
AT91C_TC_CLKS_TIMER_DIV4_CLOCK EQU (0x3) ;- (TC) Clock selected: TIMER_DIV4_CLOCK
AT91C_TC_CLKS_TIMER_DIV5_CLOCK EQU (0x4) ;- (TC) Clock selected: TIMER_DIV5_CLOCK
AT91C_TC_CLKS_XC0         EQU (0x5) ;- (TC) Clock selected: XC0
AT91C_TC_CLKS_XC1         EQU (0x6) ;- (TC) Clock selected: XC1
AT91C_TC_CLKS_XC2         EQU (0x7) ;- (TC) Clock selected: XC2
AT91C_TC_CLKI             EQU (0x1 <<  3) ;- (TC) Clock Invert
AT91C_TC_BURST            EQU (0x3 <<  4) ;- (TC) Burst Signal Selection
AT91C_TC_BURST_NONE       EQU (0x0 <<  4) ;- (TC) The clock is not gated by an external signal
AT91C_TC_BURST_XC0        EQU (0x1 <<  4) ;- (TC) XC0 is ANDed with the selected clock
AT91C_TC_BURST_XC1        EQU (0x2 <<  4) ;- (TC) XC1 is ANDed with the selected clock
AT91C_TC_BURST_XC2        EQU (0x3 <<  4) ;- (TC) XC2 is ANDed with the selected clock
AT91C_TC_CPCSTOP          EQU (0x1 <<  6) ;- (TC) Counter Clock Stopped with RC Compare
AT91C_TC_LDBSTOP          EQU (0x1 <<  6) ;- (TC) Counter Clock Stopped with RB Loading
AT91C_TC_CPCDIS           EQU (0x1 <<  7) ;- (TC) Counter Clock Disable with RC Compare
AT91C_TC_LDBDIS           EQU (0x1 <<  7) ;- (TC) Counter Clock Disabled with RB Loading
AT91C_TC_ETRGEDG          EQU (0x3 <<  8) ;- (TC) External Trigger Edge Selection
AT91C_TC_ETRGEDG_NONE     EQU (0x0 <<  8) ;- (TC) Edge: None
AT91C_TC_ETRGEDG_RISING   EQU (0x1 <<  8) ;- (TC) Edge: rising edge
AT91C_TC_ETRGEDG_FALLING  EQU (0x2 <<  8) ;- (TC) Edge: falling edge
AT91C_TC_ETRGEDG_BOTH     EQU (0x3 <<  8) ;- (TC) Edge: each edge
AT91C_TC_EEVTEDG          EQU (0x3 <<  8) ;- (TC) External Event Edge Selection
AT91C_TC_EEVTEDG_NONE     EQU (0x0 <<  8) ;- (TC) Edge: None
AT91C_TC_EEVTEDG_RISING   EQU (0x1 <<  8) ;- (TC) Edge: rising edge
AT91C_TC_EEVTEDG_FALLING  EQU (0x2 <<  8) ;- (TC) Edge: falling edge
AT91C_TC_EEVTEDG_BOTH     EQU (0x3 <<  8) ;- (TC) Edge: each edge
AT91C_TC_EEVT             EQU (0x3 << 10) ;- (TC) External Event  Selection
AT91C_TC_EEVT_TIOB        EQU (0x0 << 10) ;- (TC) Signal selected as external event: TIOB TIOB direction: input
AT91C_TC_EEVT_XC0         EQU (0x1 << 10) ;- (TC) Signal selected as external event: XC0 TIOB direction: output
AT91C_TC_EEVT_XC1         EQU (0x2 << 10) ;- (TC) Signal selected as external event: XC1 TIOB direction: output
AT91C_TC_EEVT_XC2         EQU (0x3 << 10) ;- (TC) Signal selected as external event: XC2 TIOB direction: output
AT91C_TC_ABETRG           EQU (0x1 << 10) ;- (TC) TIOA or TIOB External Trigger Selection
AT91C_TC_ENETRG           EQU (0x1 << 12) ;- (TC) External Event Trigger enable
AT91C_TC_WAVESEL          EQU (0x3 << 13) ;- (TC) Waveform  Selection
AT91C_TC_WAVESEL_UP       EQU (0x0 << 13) ;- (TC) UP mode without atomatic trigger on RC Compare
AT91C_TC_WAVESEL_UPDOWN   EQU (0x1 << 13) ;- (TC) UPDOWN mode without automatic trigger on RC Compare
AT91C_TC_WAVESEL_UP_AUTO  EQU (0x2 << 13) ;- (TC) UP mode with automatic trigger on RC Compare
AT91C_TC_WAVESEL_UPDOWN_AUTO EQU (0x3 << 13) ;- (TC) UPDOWN mode with automatic trigger on RC Compare
AT91C_TC_CPCTRG           EQU (0x1 << 14) ;- (TC) RC Compare Trigger Enable
AT91C_TC_WAVE             EQU (0x1 << 15) ;- (TC) 
AT91C_TC_ACPA             EQU (0x3 << 16) ;- (TC) RA Compare Effect on TIOA
AT91C_TC_ACPA_NONE        EQU (0x0 << 16) ;- (TC) Effect: none
AT91C_TC_ACPA_SET         EQU (0x1 << 16) ;- (TC) Effect: set
AT91C_TC_ACPA_CLEAR       EQU (0x2 << 16) ;- (TC) Effect: clear
AT91C_TC_ACPA_TOGGLE      EQU (0x3 << 16) ;- (TC) Effect: toggle
AT91C_TC_LDRA             EQU (0x3 << 16) ;- (TC) RA Loading Selection
AT91C_TC_LDRA_NONE        EQU (0x0 << 16) ;- (TC) Edge: None
AT91C_TC_LDRA_RISING      EQU (0x1 << 16) ;- (TC) Edge: rising edge of TIOA
AT91C_TC_LDRA_FALLING     EQU (0x2 << 16) ;- (TC) Edge: falling edge of TIOA
AT91C_TC_LDRA_BOTH        EQU (0x3 << 16) ;- (TC) Edge: each edge of TIOA
AT91C_TC_ACPC             EQU (0x3 << 18) ;- (TC) RC Compare Effect on TIOA
AT91C_TC_ACPC_NONE        EQU (0x0 << 18) ;- (TC) Effect: none
AT91C_TC_ACPC_SET         EQU (0x1 << 18) ;- (TC) Effect: set
AT91C_TC_ACPC_CLEAR       EQU (0x2 << 18) ;- (TC) Effect: clear
AT91C_TC_ACPC_TOGGLE      EQU (0x3 << 18) ;- (TC) Effect: toggle
AT91C_TC_LDRB             EQU (0x3 << 18) ;- (TC) RB Loading Selection
AT91C_TC_LDRB_NONE        EQU (0x0 << 18) ;- (TC) Edge: None
AT91C_TC_LDRB_RISING      EQU (0x1 << 18) ;- (TC) Edge: rising edge of TIOA
AT91C_TC_LDRB_FALLING     EQU (0x2 << 18) ;- (TC) Edge: falling edge of TIOA
AT91C_TC_LDRB_BOTH        EQU (0x3 << 18) ;- (TC) Edge: each edge of TIOA
AT91C_TC_AEEVT            EQU (0x3 << 20) ;- (TC) External Event Effect on TIOA
AT91C_TC_AEEVT_NONE       EQU (0x0 << 20) ;- (TC) Effect: none
AT91C_TC_AEEVT_SET        EQU (0x1 << 20) ;- (TC) Effect: set
AT91C_TC_AEEVT_CLEAR      EQU (0x2 << 20) ;- (TC) Effect: clear
AT91C_TC_AEEVT_TOGGLE     EQU (0x3 << 20) ;- (TC) Effect: toggle
AT91C_TC_ASWTRG           EQU (0x3 << 22) ;- (TC) Software Trigger Effect on TIOA
AT91C_TC_ASWTRG_NONE      EQU (0x0 << 22) ;- (TC) Effect: none
AT91C_TC_ASWTRG_SET       EQU (0x1 << 22) ;- (TC) Effect: set
AT91C_TC_ASWTRG_CLEAR     EQU (0x2 << 22) ;- (TC) Effect: clear
AT91C_TC_ASWTRG_TOGGLE    EQU (0x3 << 22) ;- (TC) Effect: toggle
AT91C_TC_BCPB             EQU (0x3 << 24) ;- (TC) RB Compare Effect on TIOB
AT91C_TC_BCPB_NONE        EQU (0x0 << 24) ;- (TC) Effect: none
AT91C_TC_BCPB_SET         EQU (0x1 << 24) ;- (TC) Effect: set
AT91C_TC_BCPB_CLEAR       EQU (0x2 << 24) ;- (TC) Effect: clear
AT91C_TC_BCPB_TOGGLE      EQU (0x3 << 24) ;- (TC) Effect: toggle
AT91C_TC_BCPC             EQU (0x3 << 26) ;- (TC) RC Compare Effect on TIOB
AT91C_TC_BCPC_NONE        EQU (0x0 << 26) ;- (TC) Effect: none
AT91C_TC_BCPC_SET         EQU (0x1 << 26) ;- (TC) Effect: set
AT91C_TC_BCPC_CLEAR       EQU (0x2 << 26) ;- (TC) Effect: clear
AT91C_TC_BCPC_TOGGLE      EQU (0x3 << 26) ;- (TC) Effect: toggle
AT91C_TC_BEEVT            EQU (0x3 << 28) ;- (TC) External Event Effect on TIOB
AT91C_TC_BEEVT_NONE       EQU (0x0 << 28) ;- (TC) Effect: none
AT91C_TC_BEEVT_SET        EQU (0x1 << 28) ;- (TC) Effect: set
AT91C_TC_BEEVT_CLEAR      EQU (0x2 << 28) ;- (TC) Effect: clear
AT91C_TC_BEEVT_TOGGLE     EQU (0x3 << 28) ;- (TC) Effect: toggle
AT91C_TC_BSWTRG           EQU (0x3 << 30) ;- (TC) Software Trigger Effect on TIOB
AT91C_TC_BSWTRG_NONE      EQU (0x0 << 30) ;- (TC) Effect: none
AT91C_TC_BSWTRG_SET       EQU (0x1 << 30) ;- (TC) Effect: set
AT91C_TC_BSWTRG_CLEAR     EQU (0x2 << 30) ;- (TC) Effect: clear
AT91C_TC_BSWTRG_TOGGLE    EQU (0x3 << 30) ;- (TC) Effect: toggle
// - -------- TC_SR : (TC Offset: 0x20) TC Channel Status Register -------- 
AT91C_TC_COVFS            EQU (0x1 <<  0) ;- (TC) Counter Overflow
AT91C_TC_LOVRS            EQU (0x1 <<  1) ;- (TC) Load Overrun
AT91C_TC_CPAS             EQU (0x1 <<  2) ;- (TC) RA Compare
AT91C_TC_CPBS             EQU (0x1 <<  3) ;- (TC) RB Compare
AT91C_TC_CPCS             EQU (0x1 <<  4) ;- (TC) RC Compare
AT91C_TC_LDRAS            EQU (0x1 <<  5) ;- (TC) RA Loading
AT91C_TC_LDRBS            EQU (0x1 <<  6) ;- (TC) RB Loading
AT91C_TC_ETRGS            EQU (0x1 <<  7) ;- (TC) External Trigger
AT91C_TC_CLKSTA           EQU (0x1 << 16) ;- (TC) Clock Enabling
AT91C_TC_MTIOA            EQU (0x1 << 17) ;- (TC) TIOA Mirror
AT91C_TC_MTIOB            EQU (0x1 << 18) ;- (TC) TIOA Mirror
// - -------- TC_IER : (TC Offset: 0x24) TC Channel Interrupt Enable Register -------- 
// - -------- TC_IDR : (TC Offset: 0x28) TC Channel Interrupt Disable Register -------- 
// - -------- TC_IMR : (TC Offset: 0x2c) TC Channel Interrupt Mask Register -------- 

