una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s1.h
AT91C_PIOB_SLEW1          EQU (0x400E1100) ;- (PIOB) PIO SLEWRATE1 REGISTER 
AT91C_PIOB_SENISR         EQU (0x400E1160) ;- (PIOB) Sensor Interrupt Status Register
AT91C_PIOB_OSR            EQU (0x400E1018) ;- (PIOB) Output Status Register
AT91C_PIOB_IFER           EQU (0x400E1020) ;- (PIOB) Input Filter Enable Register
AT91C_PIOB_SENDATA        EQU (0x400E1164) ;- (PIOB) Sensor Data Register
AT91C_PIOB_MDSR           EQU (0x400E1058) ;- (PIOB) Multi-driver Status Register
AT91C_PIOB_IFDR           EQU (0x400E1024) ;- (PIOB) Input Filter Disable Register
AT91C_PIOB_MDER           EQU (0x400E1050) ;- (PIOB) Multi-driver Enable Register
AT91C_PIOB_SENIDR         EQU (0x400E1158) ;- (PIOB) Sensor Interrupt Disable Register
AT91C_PIOB_IER            EQU (0x400E1040) ;- (PIOB) Interrupt Enable Register
AT91C_PIOB_OWDR           EQU (0x400E10A4) ;- (PIOB) Output Write Disable Register
AT91C_PIOB_IFSR           EQU (0x400E1028) ;- (PIOB) Input Filter Status Register
AT91C_PIOB_ISR            EQU (0x400E104C) ;- (PIOB) Interrupt Status Register
AT91C_PIOB_PPUDR          EQU (0x400E1060) ;- (PIOB) Pull-up Disable Register
AT91C_PIOB_PDSR           EQU (0x400E103C) ;- (PIOB) Pin Data Status Register
AT91C_PIOB_IPNAME2        EQU (0x400E10F4) ;- (PIOB) PIO IPNAME2 REGISTER 
AT91C_PIOB_PPUER          EQU (0x400E1064) ;- (PIOB) Pull-up Enable Register
AT91C_PIOB_SLEW2          EQU (0x400E1104) ;- (PIOB) PIO SLEWRATE2 REGISTER 
AT91C_PIOB_OER            EQU (0x400E1010) ;- (PIOB) Output Enable Register
AT91C_PIOB_CODR           EQU (0x400E1034) ;- (PIOB) Clear Output Data Register
AT91C_PIOB_PPDDR          EQU (0x400E1090) ;- (PIOB) Pull-down Disable Register
AT91C_PIOB_OWER           EQU (0x400E10A0) ;- (PIOB) Output Write Enable Register
AT91C_PIOB_VER            EQU (0x400E10FC) ;- (PIOB) PIO VERSION REGISTER 
AT91C_PIOB_PPDER          EQU (0x400E1094) ;- (PIOB) Pull-down Enable Register
AT91C_PIOB_IMR            EQU (0x400E1048) ;- (PIOB) Interrupt Mask Register
AT91C_PIOB_PPUSR          EQU (0x400E1068) ;- (PIOB) Pull-up Status Register
AT91C_PIOB_IPNAME1        EQU (0x400E10F0) ;- (PIOB) PIO IPNAME1 REGISTER 
AT91C_PIOB_ADDRSIZE       EQU (0x400E10EC) ;- (PIOB) PIO ADDRSIZE REGISTER 
AT91C_PIOB_SP2            EQU (0x400E1074) ;- (PIOB) Select B Register
AT91C_PIOB_IDR            EQU (0x400E1044) ;- (PIOB) Interrupt Disable Register
AT91C_PIOB_SENMR          EQU (0x400E1150) ;- (PIOB) Sensor Mode Register
AT91C_PIOB_SODR           EQU (0x400E1030) ;- (PIOB) Set Output Data Register
AT91C_PIOB_PPDSR          EQU (0x400E1098) ;- (PIOB) Pull-down Status Register
AT91C_PIOB_PSR            EQU (0x400E1008) ;- (PIOB) PIO Status Register
AT91C_PIOB_ODR            EQU (0x400E1014) ;- (PIOB) Output Disable Registerr
AT91C_PIOB_OWSR           EQU (0x400E10A8) ;- (PIOB) Output Write Status Register
AT91C_PIOB_FEATURES       EQU (0x400E10F8) ;- (PIOB) PIO FEATURES REGISTER 
AT91C_PIOB_PDR            EQU (0x400E1004) ;- (PIOB) PIO Disable Register
AT91C_PIOB_SENIMR         EQU (0x400E115C) ;- (PIOB) Sensor Interrupt Mask Register
AT91C_PIOB_SENIER         EQU (0x400E1154) ;- (PIOB) Sensor Interrupt Enable Register
AT91C_PIOB_PER            EQU (0x400E1000) ;- (PIOB) PIO Enable Register
// - ========== Register definition for PIOC peripheral ========== 
AT91C_PIOC_VER            EQU (0x400E12FC) ;- (PIOC) PIO VERSION REGISTER 
AT91C_PIOC_IMR            EQU (0x400E1248) ;- (PIOC) Interrupt Mask Register
AT91C_PIOC_PSR            EQU (0x400E1208) ;- (PIOC) PIO Status Register
AT91C_PIOC_PPDSR          EQU (0x400E1298) ;- (PIOC) Pull-down Status Register
AT91C_PIOC_OER            EQU (0x400E1210) ;- (PIOC) Output Enable Register
AT91C_PIOC_OSR            EQU (0x400E1218) ;- (PIOC) Output Status Register
AT91C_PIOC_MDDR           EQU (0x400E1254) ;- (PIOC) Multi-driver Disable Register
AT91C_PIOC_PPUSR          EQU (0x400E1268) ;- (PIOC) Pull-up Status Register
AT91C_PIOC_ODSR           EQU (0x400E1238) ;- (PIOC) Output Data Status Register
AT91C_PIOC_SLEW2          EQU (0x400E1304) ;- (PIOC) PIO SLEWRATE2 REGISTER 
AT91C_PIOC_SENMR          EQU (0x400E1350) ;- (PIOC) Sensor Mode Register
AT91C_PIOC_IFER           EQU (0x400E1220) ;- (PIOC) Input Filter Enable Register
AT91C_PIOC_PDR            EQU (0x400E1204) ;- (PIOC) PIO Disable Register
AT91C_PIOC_MDER           EQU (0x400E1250) ;- (PIOC) Multi-driver Enable Register
AT91C_PIOC_SP2            EQU (0x400E1274) ;- (PIOC) Select B Register
AT91C_PIOC_IPNAME1        EQU (0x400E12F0) ;- (PIOC) PIO IPNAME1 REGISTER 
AT91C_PIOC_IER            EQU (0x400E1240) ;- (PIOC) Interrupt Enable Register
AT91C_PIOC_OWDR           EQU (0x400E12A4) ;- (PIOC) Output Write Disable Register
AT91C_PIOC_IDR            EQU (0x400E1244) ;- (PIOC) Interrupt Disable Register
AT91C_PIOC_PDSR           EQU (0x400E123C) ;- (PIOC) Pin Data Status Register
AT91C_PIOC_SENIDR         EQU (0x400E1358) ;- (PIOC) Sensor Interrupt Disable Register
AT91C_PIOC_SENISR         EQU (0x400E1360) ;- (PIOC) Sensor Interrupt Status Register
AT91C_PIOC_PER            EQU (0x400E1200) ;- (PIOC) PIO Enable Register
AT91C_PIOC_SENDATA        EQU (0x400E1364) ;- (PIOC) Sensor Data Register
AT91C_PIOC_IPNAME2        EQU (0x400E12F4) ;- (PIOC) PIO IPNAME2 REGISTER 
AT91C_PIOC_PPDDR          EQU (0x400E1290) ;- (PIOC) Pull-down Disable Register
AT91C_PIOC_ADDRSIZE       EQU (0x400E12EC) ;- (PIOC) PIO ADDRSIZE REGISTER 
AT91C_PIOC_IFDR           EQU (0x400E1224) ;- (PIOC) Input Filter Disable Register
AT91C_PIOC_ODR            EQU (0x400E1214) ;- (PIOC) Output Disable Registerr
AT91C_PIOC_CODR           EQU (0x400E1234) ;- (PIOC) Clear Output Data Register
AT91C_PIOC_MDSR           EQU (0x400E1258) ;- (PIOC) Multi-driver Status Register
AT91C_PIOC_FEATURES       EQU (0x400E12F8) ;- (PIOC) PIO FEATURES REGISTER 
AT91C_PIOC_IFSR           EQU (0x400E1228) ;- (PIOC) Input Filter Status Register
AT91C_PIOC_PPUER          EQU (0x400E1264) ;- (PIOC) Pull-up Enable Register
AT91C_PIOC_PPDER          EQU (0x400E1294) ;- (PIOC) Pull-down Enable Register
AT91C_PIOC_OWSR           EQU (0x400E12A8) ;- (PIOC) Output Write Status Register
AT91C_PIOC_ISR            EQU (0x400E124C) ;- (PIOC) Interrupt Status Register
AT91C_PIOC_OWER           EQU (0x400E12A0) ;- (PIOC) Output Write Enable Register
AT91C_PIOC_PPUDR          EQU (0x400E1260) ;- (PIOC) Pull-up Disable Register
AT91C_PIOC_SENIMR         EQU (0x400E135C) ;- (PIOC) Sensor Interrupt Mask Register
AT91C_PIOC_SLEW1          EQU (0x400E1300) ;- (PIOC) PIO SLEWRATE1 REGISTER 
AT91C_PIOC_SENIER         EQU (0x400E1354) ;- (PIOC) Sensor Interrupt Enable Register
AT91C_PIOC_SODR           EQU (0x400E1230) ;- (PIOC) Set Output Data Register
AT91C_PIOC_SP1            EQU (0x400E1270) ;- (PIOC) Select B Register
AT91C_PIOC_ABSR           EQU (0x400E1278) ;- (PIOC) AB Select Status Register
// - ========== Register definition for PMC peripheral ========== 
AT91C_PMC_PLLAR           EQU (0x400E0428) ;- (PMC) PLL Register
AT91C_PMC_UCKR            EQU (0x400E041C) ;- (PMC) UTMI Clock Configuration Register
AT91C_PMC_FSMR            EQU (0x400E0470) ;- (PMC) Fast Startup Mode Register
AT91C_PMC_MCKR            EQU (0x400E0430) ;- (PMC) Master Clock Register
AT91C_PMC_SCER            EQU (0x400E0400) ;- (PMC) System Clock Enable Register
AT91C_PMC_PCSR            EQU (0x400E0418) ;- (PMC) Peripheral Clock Status Register 0:31 PERI_ID
AT91C_PMC_MCFR            EQU (0x400E0424) ;- (PMC) Main Clock  Frequency Register
AT91C_PMC_PCER1           EQU (0x400E0500) ;- (PMC) Peripheral Clock Enable Register 32:63 PERI_ID
AT91C_PMC_FOCR            EQU (0x400E0478) ;- (PMC) Fault Output Clear Register
AT91C_PMC_PCSR1           EQU (0x400E0508) ;- (PMC) Peripheral Clock Status Register 32:63 PERI_ID
AT91C_PMC_FSPR            EQU (0x400E0474) ;- (PMC) Fast Startup Polarity Register
AT91C_PMC_SCSR            EQU (0x400E0408) ;- (PMC) System Clock Status Register
AT91C_PMC_IDR             EQU (0x400E0464) ;- (PMC) Interrupt Disable Register
AT91C_PMC_UDPR            EQU (0x400E0438) ;- (PMC) USB DEV Clock Configuration Register
AT91C_PMC_PCDR1           EQU (0x400E0504) ;- (PMC) Peripheral Clock Disable Register 32:63 PERI_ID
AT91C_PMC_VER             EQU (0x400E04FC) ;- (PMC) APMC VERSION REGISTER
AT91C_PMC_IMR             EQU (0x400E046C) ;- (PMC) Interrupt Mask Register
AT91C_PMC_IPNAME2         EQU (0x400E04F4) ;- (PMC) PMC IPNAME2 REGISTER 
AT91C_PMC_SCDR            EQU (0x400E0404) ;- (PMC) System Clock Disable Register
AT91C_PMC_PCKR            EQU (0x400E0440) ;- (PMC) Programmable Clock Register
AT91C_PMC_ADDRSIZE        EQU (0x400E04EC) ;- (PMC) PMC ADDRSIZE REGISTER 
AT91C_PMC_PCDR            EQU (0x400E0414) ;- (PMC) Peripheral Clock Disable Register 0:31 PERI_ID
AT91C_PMC_MOR             EQU (0x400E0420) ;- (PMC) Main Oscillator Register
AT91C_PMC_SR              EQU (0x400E0468) ;- (PMC) Status Register
AT91C_PMC_IER             EQU (0x400E0460) ;- (PMC) Interrupt Enable Register
AT91C_PMC_PLLBR           EQU (0x400E042C) ;- (PMC) PLL B Register
AT91C_PMC_IPNAME1         EQU (0x400E04F0) ;- (PMC) PMC IPNAME1 REGISTER 
AT91C_PMC_PCER            EQU (0x400E0410) ;- (PMC) Peripheral Clock Enable Register 0:31 PERI_ID
AT91C_PMC_FEATURES        EQU (0x400E04F8) ;- (PMC) PMC FEATURES REGISTER 
AT91C_PMC_PCR             EQU (0x400E050C) ;- (PMC) Peripheral Control Register
// - ========== Register definition for CKGR peripheral ========== 
AT91C_CKGR_PLLAR          EQU (0x400E0428) ;- (CKGR) PLL Register
AT91C_CKGR_UCKR           EQU (0x400E041C) ;- (CKGR) UTMI Clock Configuration Register
AT91C_CKGR_MOR            EQU (0x400E0420) ;- (CKGR) Main Oscillator Register
AT91C_CKGR_MCFR           EQU (0x400E0424) ;- (CKGR) Main Clock  Frequency Register
AT91C_CKGR_PLLBR          EQU (0x400E042C) ;- (CKGR) PLL B Register
// - ========== Register definition for RSTC peripheral ========== 
AT91C_RSTC_RSR            EQU (0x400E1404) ;- (RSTC) Reset Status Register
AT91C_RSTC_RCR            EQU (0x400E1400) ;- (RSTC) Reset Control Register
AT91C_RSTC_RMR            EQU (0x400E1408) ;- (RSTC) Reset Mode Register
AT91C_RSTC_VER            EQU (0x400E14FC) ;- (RSTC) Version Register
// - ========== Register definition for SUPC peripheral ========== 
AT91C_SUPC_FWUTR          EQU (0x400E1428) ;- (SUPC) Flash Wake-up Timer Register
AT91C_SUPC_SR             EQU (0x400E1424) ;- (SUPC) Status Register
AT91C_SUPC_BOMR           EQU (0x400E1414) ;- (SUPC) Brown Out Mode Register
AT91C_SUPC_WUMR           EQU (0x400E141C) ;- (SUPC) Wake Up Mode Register
AT91C_SUPC_WUIR           EQU (0x400E1420) ;- (SUPC) Wake Up Inputs Register
AT91C_SUPC_CR             EQU (0x400E1410) ;- (SUPC) Control Register
AT91C_SUPC_MR             EQU (0x400E1418) ;- (SUPC) Mode Register
// - ========== Register definition for RTTC peripheral ========== 
AT91C_RTTC_RTSR           EQU (0x400E143C) ;- (RTTC) Real-time Status Register
AT91C_RTTC_RTVR           EQU (0x400E1438) ;- (RTTC) Real-time Value Register
AT91C_RTTC_RTMR           EQU (0x400E1430) ;- (RTTC) Real-time Mode Register
AT91C_RTTC_RTAR           EQU (0x400E1434) ;- (RTTC) Real-time Alarm Register
// - ========== Register definition for WDTC peripheral ========== 
AT91C_WDTC_WDCR           EQU (0x400E1450) ;- (WDTC) Watchdog Control Register
AT91C_WDTC_WDMR           EQU (0x400E1454) ;- (WDTC) Watchdog Mode Register
AT91C_WDTC_WDSR           EQU (0x400E1458) ;- (WDTC) Watchdog Status Register
// - ========== Register definition for RTC peripheral ========== 
AT91C_RTC_VER             EQU (0x400E148C) ;- (RTC) Valid Entry Register
AT91C_RTC_TIMR            EQU (0x400E1468) ;- (RTC) Time Register
AT91C_RTC_CALALR          EQU (0x400E1474) ;- (RTC) Calendar Alarm Register
AT91C_RTC_IER             EQU (0x400E1480) ;- (RTC) Interrupt Enable Register
AT91C_RTC_MR              EQU (0x400E1464) ;- (RTC) Mode Register
AT91C_RTC_CALR            EQU (0x400E146C) ;- (RTC) Calendar Register
AT91C_RTC_TIMALR          EQU (0x400E1470) ;- (RTC) Time Alarm Register
AT91C_RTC_SCCR            EQU (0x400E147C) ;- (RTC) Status Clear Command Register
AT91C_RTC_CR              EQU (0x400E1460) ;- (RTC) Control Register
AT91C_RTC_IDR             EQU (0x400E1484) ;- (RTC) Interrupt Disable Register
AT91C_RTC_IMR             EQU (0x400E1488) ;- (RTC) Interrupt Mask Register
AT91C_RTC_SR              EQU (0x400E1478) ;- (RTC) Status Register
// - ========== Register definition for ADC0 peripheral ========== 
AT91C_ADC0_CDR2           EQU (0x40038058) ;- (ADC0) ADC Channel Data Register 2
AT91C_ADC0_CGR            EQU (0x40038048) ;- (ADC0) Control gain register
AT91C_ADC0_CDR7           EQU (0x4003806C) ;- (ADC0) ADC Channel Data Register 7
AT91C_ADC0_IDR            EQU (0x40038028) ;- (ADC0) ADC Interrupt Disable Register
AT91C_ADC0_CR             EQU (0x40038000) ;- (ADC0) ADC Control Register
AT91C_ADC0_FEATURES       EQU (0x400380F8) ;- (ADC0) ADC FEATURES REGISTER 
AT91C_ADC0_CWR            EQU (0x40038040) ;- (ADC0) unspecified
AT91C_ADC0_IPNAME1        EQU (0x400380F0) ;- (ADC0) ADC IPNAME1 REGISTER 
AT91C_ADC0_CDR9           EQU (0x40038074) ;- (ADC0) ADC Channel Data Register 9
AT91C_ADC0_CDR3           EQU (0x4003805C) ;- (ADC0) ADC Channel Data Register 3
AT91C_ADC0_SR             EQU (0x40038030) ;- (ADC0) ADC Status Register
AT91C_ADC0_CHER           EQU (0x40038010) ;- (ADC0) ADC Channel Enable Register
AT91C_ADC0_CDR1           EQU (0x40038054) ;- (ADC0) ADC Channel Data Register 1
AT91C_ADC0_CDR6           EQU (0x40038068) ;- (ADC0) ADC Channel Data Register 6
AT91C_ADC0_MR             EQU (0x40038004) ;- (ADC0) ADC Mode Register
AT91C_ADC0_CWSR           EQU (0x40038044) ;- (ADC0) unspecified
AT91C_ADC0_VER            EQU (0x400380FC) ;- (ADC0) ADC VERSION REGISTER
AT91C_ADC0_COR            EQU (0x4003804C) ;- (ADC0) unspecified
AT91C_ADC0_CDR8           EQU (0x40038070) ;- (ADC0) ADC Channel Data Register 8
AT91C_ADC0_IPNAME2        EQU (0x400380F4) ;- (ADC0) ADC IPNAME2 REGISTER 
AT91C_ADC0_CDR0           EQU (0x40038050) ;- (ADC0) ADC Channel Data Register 0
AT91C_ADC0_LCDR           EQU (0x40038020) ;- (ADC0) ADC Last Converted Data Register
AT91C_ADC0_CDR12          EQU (0x40038080) ;- (ADC0) ADC Channel Data Register 12
AT91C_ADC0_CHDR           EQU (0x40038014) ;- (ADC0) ADC Channel Disable Register
AT91C_ADC0_OVR            EQU (0x4003803C) ;- (ADC0) unspecified
AT91C_ADC0_CDR15          EQU (0x4003808C) ;- (ADC0) ADC Channel Data Register 15
AT91C_ADC0_CDR11          EQU (0x4003807C) ;- (ADC0) ADC Channel Data Register 11
AT91C_ADC0_ADDRSIZE       EQU (0x400380EC) ;- (ADC0) ADC ADDRSIZE REGISTER 
AT91C_ADC0_CDR13          EQU (0x40038084) ;- (ADC0) ADC Channel Data Register 13
AT91C_ADC0_ACR            EQU (0x40038094) ;- (ADC0) unspecified
AT91C_ADC0_CDR5           EQU (0x40038064) ;- (ADC0) ADC Channel Data Register 5
AT91C_ADC0_CDR14          EQU (0x40038088) ;- (ADC0) ADC Channel Data Register 14
AT91C_ADC0_IMR            EQU (0x4003802C) ;- (ADC0) ADC Interrupt Mask Register
AT91C_ADC0_CHSR           EQU (0x40038018) ;- (ADC0) ADC Channel Status Register
AT91C_ADC0_CDR10          EQU (0x40038078) ;- (ADC0) ADC Channel Data Register 10
AT91C_ADC0_IER            EQU (0x40038024) ;- (ADC0) ADC Interrupt Enable Register
AT91C_ADC0_CDR4           EQU (0x40038060) ;- (ADC0) ADC Channel Data Register 4
// - ========== Register definition for DAC0 peripheral ========== 
AT91C_DAC0_FEATURES       EQU (0x4003C0F8) ;- (DAC0) DAC FEATURES REGISTER 
AT91C_DAC0_ADDRSIZE       EQU (0x4003C0EC) ;- (DAC0) DAC ADDRSIZE REGISTER 
AT91C_DAC0_WPMR           EQU (0x4003C0E4) ;- (DAC0) Write Protect Mode Register
AT91C_DAC0_CHDR           EQU (0x4003C014) ;- (DAC0) Channel Disable Register
AT91C_DAC0_IPNAME1        EQU (0x4003C0F0) ;- (DAC0) DAC IPNAME1 REGISTER 
AT91C_DAC0_IDR            EQU (0x4003C028) ;- (DAC0) Interrupt Disable Register
AT91C_DAC0_CR             EQU (0x4003C000) ;- (DAC0) Control Register
AT91C_DAC0_IPNAME2        EQU (0x4003C0F4) ;- (DAC0) DAC IPNAME2 REGISTER 
AT91C_DAC0_IMR            EQU (0x4003C02C) ;- (DAC0) Interrupt Mask Register
AT91C_DAC0_CHSR           EQU (0x4003C018) ;- (DAC0) Channel Status Register
AT91C_DAC0_ACR            EQU (0x4003C094) ;- (DAC0) Analog Current Register
AT91C_DAC0_WPSR           EQU (0x4003C0E8) ;- (DAC0) Write Protect Status Register
AT91C_DAC0_CHER           EQU (0x4003C010) ;- (DAC0) Channel Enable Register
AT91C_DAC0_CDR            EQU (0x4003C020) ;- (DAC0) Coversion Data Register
AT91C_DAC0_IER            EQU (0x4003C024) ;- (DAC0) Interrupt Enable Register
AT91C_DAC0_ISR            EQU (0x4003C030) ;- (DAC0) Interrupt Status Register
AT91C_DAC0_VER            EQU (0x4003C0FC) ;- (DAC0) DAC VERSION REGISTER
AT91C_DAC0_MR             EQU (0x4003C004) ;- (DAC0) Mode Register
// - ========== Register definition for ACC0 peripheral ========== 
AT91C_ACC0_IPNAME1        EQU (0x400400F0) ;- (ACC0) ACC IPNAME1 REGISTER 
AT91C_ACC0_MR             EQU (0x40040004) ;- (ACC0) Mode Register
AT91C_ACC0_FEATURES       EQU (0x400400F8) ;- (ACC0) ACC FEATURES REGISTER 
AT91C_ACC0_IMR            EQU (0x4004002C) ;- (ACC0) Interrupt Mask Register
AT91C_ACC0_ACR            EQU (0x40040094) ;- (ACC0) Analog Control Register
AT91C_ACC0_ADDRSIZE       EQU (0x400400EC) ;- (ACC0) ACC ADDRSIZE REGISTER 
AT91C_ACC0_IER            EQU (0x40040024) ;- (ACC0) Interrupt Enable Register
AT91C_ACC0_ISR            EQU (0x40040030) ;- (ACC0) Interrupt Status Register
AT91C_ACC0_IDR            EQU (0x40040028) ;- (ACC0) Interrupt Disable Register
AT91C_ACC0_MODE           EQU (0x400400E4) ;- (ACC0) Write Protection Mode Register
AT91C_ACC0_VER            EQU (0x400400FC) ;- (ACC0) ACC VERSION REGISTER
AT91C_ACC0_CR             EQU (0x40040000) ;- (ACC0) Control Register
AT91C_ACC0_IPNAME2        EQU (0x400400F4) ;- (ACC0) ACC IPNAME2 REGISTER 
AT91C_ACC0_STATUS         EQU (0x400400E8) ;- (ACC0) Write Protection Status
// - ========== Register definition for HCBDMA peripheral ========== 
AT91C_HCBDMA_CBIMR        EQU (0x4004401C) ;- (HCBDMA) CB DMA Interrupt mask Register
AT91C_HCBDMA_CBCRCCR      EQU (0x40044034) ;- (HCBDMA) CB DMA CRC Control Resgister
AT91C_HCBDMA_CBSR         EQU (0x40044010) ;- (HCBDMA) CB DMA Status Register
AT91C_HCBDMA_CBCRCISR     EQU (0x4004404C) ;- (HCBDMA) CB DMA CRC Interrupt Status Resgister
AT91C_HCBDMA_CBCRCSR      EQU (0x4004403C) ;- (HCBDMA) CB DMA CRC Status Resgister
AT91C_HCBDMA_CBIDR        EQU (0x40044018) ;- (HCBDMA) CB DMA Interrupt Disable Register
AT91C_HCBDMA_CBCRCIDR     EQU (0x40044044) ;- (HCBDMA) CB DMA CRC Interrupt Disable Resgister
AT91C_HCBDMA_CBDLIER      EQU (0x40044024) ;- (HCBDMA) CB DMA Loaded Interrupt Enable Register
AT91C_HCBDMA_CBEN         EQU (0x40044008) ;- (HCBDMA) CB DMA Enable Register
AT91C_HCBDMA_FEATURES     EQU (0x400440F8) ;- (HCBDMA) HCBDMA FEATURES REGISTER 
AT91C_HCBDMA_CBDSCR       EQU (0x40044000) ;- (HCBDMA) CB DMA Descriptor Base Register
AT91C_HCBDMA_ADDRSIZE     EQU (0x400440EC) ;- (HCBDMA) HCBDMA ADDRSIZE REGISTER 
AT91C_HCBDMA_CBDLISR      EQU (0x40044030) ;- (HCBDMA) CB DMA Loaded Interrupt Status Register
AT91C_HCBDMA_CBDLIDR      EQU (0x40044028) ;- (HCBDMA) CB DMA Loaded Interrupt Disable Register
AT91C_HCBDMA_CBCRCIMR     EQU (0x40044048) ;- (HCBDMA) CB DMA CRC Interrupt Mask Resgister
AT91C_HCBDMA_VER          EQU (0x400440FC) ;- (HCBDMA) HCBDMA VERSION REGISTER
AT91C_HCBDMA_CBCRCIER     EQU (0x40044040) ;- (HCBDMA) CB DMA CRC Interrupt Enable Resgister
AT91C_HCBDMA_IPNAME2      EQU (0x400440F4) ;- (HCBDMA) HCBDMA IPNAME2 REGISTER 
AT91C_HCBDMA_CBIER        EQU (0x40044014) ;- (HCBDMA) CB DMA Interrupt Enable Register
AT91C_HCBDMA_CBISR        EQU (0x40044020) ;- (HCBDMA) CB DMA Interrupt Status Register
AT91C_HCBDMA_IPNAME1      EQU (0x400440F0) ;- (HCBDMA) HCBDMA IPNAME1 REGISTER 
AT91C_HCBDMA_CBDIS        EQU (0x4004400C) ;- (HCBDMA) CB DMA Disable Register
AT91C_HCBDMA_CBNXTEN      EQU (0x40044004) ;- (HCBDMA) CB DMA Next Descriptor Enable Register
AT91C_HCBDMA_CBDLIMR      EQU (0x4004402C) ;- (HCBDMA) CB DMA Loaded Interrupt mask Register
AT91C_HCBDMA_CBCRCMR      EQU (0x40044038) ;- (HCBDMA) CB DMA CRC Mode Resgister
// - ========== Register definition for TC0 peripheral ========== 
AT91C_TC0_SR              EQU (0x40010020) ;- (TC0) Status Register
AT91C_TC0_CCR             EQU (0x40010000) ;- (TC0) Channel Control Register
AT91C_TC0_CMR             EQU (0x40010004) ;- (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC0_IER             EQU (0x40010024) ;- (TC0) Interrupt Enable Register
AT91C_TC0_CV              EQU (0x40010010) ;- (TC0) Counter Value
AT91C_TC0_RB              EQU (0x40010018) ;- (TC0) Register B
AT91C_TC0_IDR             EQU (0x40010028) ;- (TC0) Interrupt Disable Register
AT91C_TC0_RA              EQU (0x40010014) ;- (TC0) Register A
AT91C_TC0_RC              EQU (0x4001001C) ;- (TC0) Register C
AT91C_TC0_IMR             EQU (0x4001002C) ;- (TC0) Interrupt Mask Register
// - ========== Register definition for TC1 peripheral ========== 
AT91C_TC1_SR              EQU (0x40010060) ;- (TC1) Status Register
AT91C_TC1_CV              EQU (0x40010050) ;- (TC1) Counter Value
AT91C_TC1_RA              EQU (0x40010054) ;- (TC1) Register A
AT91C_TC1_IER             EQU (0x40010064) ;- (TC1) Interrupt Enable Register
AT91C_TC1_RB              EQU (0x40010058) ;- (TC1) Register B
AT91C_TC1_RC              EQU (0x4001005C) ;- (TC1) Register C
AT91C_TC1_CCR             EQU (0x40010040) ;- (TC1) Channel Control Register
AT91C_TC1_IMR             EQU (0x4001006C) ;- (TC1) Interrupt Mask Register
AT91C_TC1_IDR             EQU (0x40010068) ;- (TC1) Interrupt Disable Register
AT91C_TC1_CMR             EQU (0x40010044) ;- (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
// - ========== Register definition for TC2 peripheral ========== 
AT91C_TC2_SR              EQU (0x400100A0) ;- (TC2) Status Register
AT91C_TC2_IER             EQU (0x400100A4) ;- (TC2) Interrupt Enable Register
AT91C_TC2_CCR             EQU (0x40010080) ;- (TC2) Channel Control Register
AT91C_TC2_IDR             EQU (0x400100A8) ;- (TC2) Interrupt Disable Register
AT91C_TC2_RA              EQU (0x40010094) ;- (TC2) Register A
AT91C_TC2_RB              EQU (0x40010098) ;- (TC2) Register B
AT91C_TC2_IMR             EQU (0x400100AC) ;- (TC2) Interrupt Mask Register
AT91C_TC2_CV              EQU (0x40010090) ;- (TC2) Counter Value
AT91C_TC2_RC              EQU (0x4001009C) ;- (TC2) Register C
AT91C_TC2_CMR             EQU (0x40010084) ;- (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
// - ========== Register definition for TC3 peripheral ========== 
AT91C_TC3_IDR             EQU (0x40014028) ;- (TC3) Interrupt Disable Register
AT91C_TC3_IER             EQU (0x40014024) ;- (TC3) Interrupt Enable Register
AT91C_TC3_SR              EQU (0x40014020) ;- (TC3) Status Register
AT91C_TC3_CV              EQU (0x40014010) ;- (TC3) Counter Value
AT91C_TC3_CMR             EQU (0x40014004) ;- (TC3) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC3_RC              EQU (0x4001401C) ;- (TC3) Register C
AT91C_TC3_RA              EQU (0x40014014) ;- (TC3) Register A
AT91C_TC3_IMR             EQU (0x4001402C) ;- (TC3) Interrupt Mask Register
AT91C_TC3_RB              EQU (0x40014018) ;- (TC3) Register B
AT91C_TC3_CCR             EQU (0x40014000) ;- (TC3) Channel Control Register
// - ========== Register definition for TC4 peripheral ========== 
AT91C_TC4_CV              EQU (0x40014050) ;- (TC4) Counter Value
AT91C_TC4_CMR             EQU (0x40014044) ;- (TC4) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC4_RA              EQU (0x40014054) ;- (TC4) Register A
