una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s1.h
// - *****************************************************************************
// -               PERIPHERAL ID DEFINITIONS FOR AT91SAM3S1
// - *****************************************************************************
AT91C_ID_SUPC             EQU ( 0) ;- SUPPLY CONTROLLER
AT91C_ID_RSTC             EQU ( 1) ;- RESET CONTROLLER
AT91C_ID_RTC              EQU ( 2) ;- REAL TIME CLOCK
AT91C_ID_RTT              EQU ( 3) ;- REAL TIME TIMER
AT91C_ID_WDG              EQU ( 4) ;- WATCHDOG TIMER
AT91C_ID_PMC              EQU ( 5) ;- PMC
AT91C_ID_EFC0             EQU ( 6) ;- EFC0
AT91C_ID_DBGU0            EQU ( 8) ;- DBGU0
AT91C_ID_DBGU1            EQU ( 9) ;- DBGU1
AT91C_ID_HSMC3            EQU (10) ;- HSMC3
AT91C_ID_PIOA             EQU (11) ;- Parallel IO Controller A
AT91C_ID_PIOB             EQU (12) ;- Parallel IO Controller B
AT91C_ID_PIOC             EQU (13) ;- Parallel IO Controller C
AT91C_ID_US0              EQU (14) ;- USART 0
AT91C_ID_US1              EQU (15) ;- USART 1
AT91C_ID_MCI0             EQU (18) ;- Multimedia Card Interface
AT91C_ID_TWI0             EQU (19) ;- TWI 0
AT91C_ID_TWI1             EQU (20) ;- TWI 1
AT91C_ID_SPI0             EQU (21) ;- Serial Peripheral Interface
AT91C_ID_SSC0             EQU (22) ;- Serial Synchronous Controller 0
AT91C_ID_TC0              EQU (23) ;- Timer Counter 0
AT91C_ID_TC1              EQU (24) ;- Timer Counter 1
AT91C_ID_TC2              EQU (25) ;- Timer Counter 2
AT91C_ID_TC3              EQU (26) ;- Timer Counter 0
AT91C_ID_TC4              EQU (27) ;- Timer Counter 1
AT91C_ID_TC5              EQU (28) ;- Timer Counter 2
AT91C_ID_ADC0             EQU (29) ;- ADC controller0
AT91C_ID_DAC0             EQU (30) ;- Digital to Analog Converter
AT91C_ID_PWMC             EQU (31) ;- Pulse Width Modulation Controller
AT91C_ID_HCBDMA           EQU (32) ;- Context Based Direct Memory Access Controller Interface
AT91C_ID_ACC0             EQU (33) ;- Analog Comparator Controller
AT91C_ID_UDP              EQU (34) ;- USB Device
AT91C_ALL_INT             EQU (0xFFFFFFFF) ;- ALL VALID INTERRUPTS

// - *****************************************************************************
// -               BASE ADDRESS DEFINITIONS FOR AT91SAM3S1
// - *****************************************************************************
AT91C_BASE_SYS            EQU (0x400E0000) ;- (SYS) Base Address
AT91C_BASE_SMC            EQU (0x400E0000) ;- (SMC) Base Address
AT91C_BASE_MATRIX         EQU (0x400E0200) ;- (MATRIX) Base Address
AT91C_BASE_CCFG           EQU (0x400E0310) ;- (CCFG) Base Address
AT91C_BASE_NVIC           EQU (0xE000E000) ;- (NVIC) Base Address
AT91C_BASE_MPU            EQU (0xE000ED90) ;- (MPU) Base Address
AT91C_BASE_CM3            EQU (0xE000ED00) ;- (CM3) Base Address
AT91C_BASE_PDC_DBGU0      EQU (0x400E0700) ;- (PDC_DBGU0) Base Address
AT91C_BASE_DBGU0          EQU (0x400E0600) ;- (DBGU0) Base Address
AT91C_BASE_PDC_DBGU1      EQU (0x400E0900) ;- (PDC_DBGU1) Base Address
AT91C_BASE_DBGU1          EQU (0x400E0800) ;- (DBGU1) Base Address
AT91C_BASE_PIOA           EQU (0x400E0E00) ;- (PIOA) Base Address
AT91C_BASE_PDC_PIOA       EQU (0x400E0F68) ;- (PDC_PIOA) Base Address
AT91C_BASE_PIOB           EQU (0x400E1000) ;- (PIOB) Base Address
AT91C_BASE_PIOC           EQU (0x400E1200) ;- (PIOC) Base Address
AT91C_BASE_PMC            EQU (0x400E0400) ;- (PMC) Base Address
AT91C_BASE_CKGR           EQU (0x400E041C) ;- (CKGR) Base Address
AT91C_BASE_RSTC           EQU (0x400E1400) ;- (RSTC) Base Address
AT91C_BASE_SUPC           EQU (0x400E1410) ;- (SUPC) Base Address
AT91C_BASE_RTTC           EQU (0x400E1430) ;- (RTTC) Base Address
AT91C_BASE_WDTC           EQU (0x400E1450) ;- (WDTC) Base Address
AT91C_BASE_RTC            EQU (0x400E1460) ;- (RTC) Base Address
AT91C_BASE_ADC0           EQU (0x40038000) ;- (ADC0) Base Address
AT91C_BASE_DAC0           EQU (0x4003C000) ;- (DAC0) Base Address
AT91C_BASE_ACC0           EQU (0x40040000) ;- (ACC0) Base Address
AT91C_BASE_HCBDMA         EQU (0x40044000) ;- (HCBDMA) Base Address
AT91C_BASE_TC0            EQU (0x40010000) ;- (TC0) Base Address
AT91C_BASE_TC1            EQU (0x40010040) ;- (TC1) Base Address
AT91C_BASE_TC2            EQU (0x40010080) ;- (TC2) Base Address
AT91C_BASE_TC3            EQU (0x40014000) ;- (TC3) Base Address
AT91C_BASE_TC4            EQU (0x40014040) ;- (TC4) Base Address
AT91C_BASE_TC5            EQU (0x40014080) ;- (TC5) Base Address
AT91C_BASE_TCB0           EQU (0x40010000) ;- (TCB0) Base Address
AT91C_BASE_TCB1           EQU (0x40010040) ;- (TCB1) Base Address
AT91C_BASE_TCB2           EQU (0x40010080) ;- (TCB2) Base Address
AT91C_BASE_TCB3           EQU (0x40014000) ;- (TCB3) Base Address
AT91C_BASE_TCB4           EQU (0x40014040) ;- (TCB4) Base Address
AT91C_BASE_TCB5           EQU (0x40014080) ;- (TCB5) Base Address
AT91C_BASE_EFC0           EQU (0x400E0A00) ;- (EFC0) Base Address
AT91C_BASE_MCI0           EQU (0x40000000) ;- (MCI0) Base Address
AT91C_BASE_PDC_TWI0       EQU (0x40018100) ;- (PDC_TWI0) Base Address
AT91C_BASE_PDC_TWI1       EQU (0x4001C100) ;- (PDC_TWI1) Base Address
AT91C_BASE_TWI0           EQU (0x40018000) ;- (TWI0) Base Address
AT91C_BASE_TWI1           EQU (0x4001C000) ;- (TWI1) Base Address
AT91C_BASE_PDC_US0        EQU (0x40024100) ;- (PDC_US0) Base Address
AT91C_BASE_US0            EQU (0x40024000) ;- (US0) Base Address
AT91C_BASE_PDC_US1        EQU (0x40028100) ;- (PDC_US1) Base Address
AT91C_BASE_US1            EQU (0x40028000) ;- (US1) Base Address
AT91C_BASE_PDC_SSC0       EQU (0x40004100) ;- (PDC_SSC0) Base Address
AT91C_BASE_SSC0           EQU (0x40004000) ;- (SSC0) Base Address
AT91C_BASE_PDC_PWMC       EQU (0x40020100) ;- (PDC_PWMC) Base Address
AT91C_BASE_PWMC_CH0       EQU (0x40020200) ;- (PWMC_CH0) Base Address
AT91C_BASE_PWMC_CH1       EQU (0x40020220) ;- (PWMC_CH1) Base Address
AT91C_BASE_PWMC_CH2       EQU (0x40020240) ;- (PWMC_CH2) Base Address
AT91C_BASE_PWMC_CH3       EQU (0x40020260) ;- (PWMC_CH3) Base Address
AT91C_BASE_PWMC           EQU (0x40020000) ;- (PWMC) Base Address
AT91C_BASE_SPI0           EQU (0x40008000) ;- (SPI0) Base Address
AT91C_BASE_UDP            EQU (0x40034000) ;- (UDP) Base Address

// - *****************************************************************************
// -               MEMORY MAPPING DEFINITIONS FOR AT91SAM3S1
// - *****************************************************************************
// - IRAM
AT91C_IRAM                EQU (0x20000000) ;- Maximum Internal SRAM base address
AT91C_IRAM_SIZE           EQU (0x00004000) ;- Maximum Internal SRAM size in byte (16 Kbytes)
// - IROM
AT91C_IROM                EQU (0x00800000) ;- Internal ROM base address
AT91C_IROM_SIZE           EQU (0x00008000) ;- Internal ROM size in byte (32 Kbytes)
// - EBI_CS0
AT91C_EBI_CS0             EQU (0x60000000) ;- EBI Chip Select 0 base address
AT91C_EBI_CS0_SIZE        EQU (0x01000000) ;- EBI Chip Select 0 size in byte (16384 Kbytes)
// - EBI_SM0
AT91C_EBI_SM0             EQU (0x60000000) ;- NANDFLASH on EBI Chip Select 0 base address
AT91C_EBI_SM0_SIZE        EQU (0x01000000) ;- NANDFLASH on EBI Chip Select 0 size in byte (16384 Kbytes)
// - EBI_CS1
AT91C_EBI_CS1             EQU (0x61000000) ;- EBI Chip Select 1 base address
AT91C_EBI_CS1_SIZE        EQU (0x01000000) ;- EBI Chip Select 1 size in byte (16384 Kbytes)
// - EBI_SM1
AT91C_EBI_SM1             EQU (0x61000000) ;- NANDFLASH on EBI Chip Select 1 base address
AT91C_EBI_SM1_SIZE        EQU (0x01000000) ;- NANDFLASH on EBI Chip Select 1 size in byte (16384 Kbytes)
// - EBI_CS2
AT91C_EBI_CS2             EQU (0x62000000) ;- EBI Chip Select 2 base address
AT91C_EBI_CS2_SIZE        EQU (0x01000000) ;- EBI Chip Select 2 size in byte (16384 Kbytes)
// - EBI_SM2
AT91C_EBI_SM2             EQU (0x62000000) ;- NANDFLASH on EBI Chip Select 2 base address
AT91C_EBI_SM2_SIZE        EQU (0x01000000) ;- NANDFLASH on EBI Chip Select 2 size in byte (16384 Kbytes)
// - EBI_CS3
AT91C_EBI_CS3             EQU (0x63000000) ;- EBI Chip Select 3 base address
AT91C_EBI_CS3_SIZE        EQU (0x01000000) ;- EBI Chip Select 3 size in byte (16384 Kbytes)
// - EBI_SM3
AT91C_EBI_SM3             EQU (0x63000000) ;- NANDFLASH on EBI Chip Select 3 base address
AT91C_EBI_SM3_SIZE        EQU (0x01000000) ;- NANDFLASH on EBI Chip Select 3 size in byte (16384 Kbytes)
// - EBI_CS4
AT91C_EBI_CS4             EQU (0x64000000) ;- EBI Chip Select 4 base address
AT91C_EBI_CS4_SIZE        EQU (0x10000000) ;- EBI Chip Select 4 size in byte (262144 Kbytes)
// - EBI_CF0
AT91C_EBI_CF0             EQU (0x64000000) ;- CompactFlash 0 on EBI Chip Select 4 base address
AT91C_EBI_CF0_SIZE        EQU (0x10000000) ;- CompactFlash 0 on EBI Chip Select 4 size in byte (262144 Kbytes)
// - EBI_CS5
AT91C_EBI_CS5             EQU (0x65000000) ;- EBI Chip Select 5 base address
AT91C_EBI_CS5_SIZE        EQU (0x10000000) ;- EBI Chip Select 5 size in byte (262144 Kbytes)
// - EBI_CF1
AT91C_EBI_CF1             EQU (0x65000000) ;- CompactFlash 1 on EBIChip Select 5 base address
AT91C_EBI_CF1_SIZE        EQU (0x10000000) ;- CompactFlash 1 on EBIChip Select 5 size in byte (262144 Kbytes)
// - EBI_SDRAM
AT91C_EBI_SDRAM           EQU (0x66000000) ;- SDRAM on EBI Chip Select 1 base address
AT91C_EBI_SDRAM_SIZE      EQU (0x10000000) ;- SDRAM on EBI Chip Select 1 size in byte (262144 Kbytes)
// - EBI_SDRAM_16BIT
AT91C_EBI_SDRAM_16BIT     EQU (0x67000000) ;- SDRAM on EBI Chip Select 1 base address
AT91C_EBI_SDRAM_16BIT_SIZE EQU (0x02000000) ;- SDRAM on EBI Chip Select 1 size in byte (32768 Kbytes)
// - EBI_SDRAM_32BIT
AT91C_EBI_SDRAM_32BIT     EQU (0x68000000) ;- SDRAM on EBI Chip Select 1 base address
AT91C_EBI_SDRAM_32BIT_SIZE EQU (0x04000000) ;- SDRAM on EBI Chip Select 1 size in byte (65536 Kbytes)
#endif /* __IAR_SYSTEMS_ASM__ */


#endif /* AT91SAM3S1_H */
